zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/*
 * Autogenerated file
 * Copyright (c) 2026 BFLB Pinctrl Generator <nandojve@gmail.com>
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef DT_BINDINGS_PINCTRL_BFLB_BL808X_PINCTRL_H_
#define DT_BINDINGS_PINCTRL_BFLB_BL808X_PINCTRL_H_

#include <dt-bindings/pinctrl/bl808-pinctrl.h>
#include <dt-bindings/pinctrl/bflb-common-pinctrl.h>

/* gpio0_sdh_clk */
#define GPIO0_SDH_CLK \
	BFLB_PINMUX(0, sdh, clk, periph)

/* gpio0_spi0_ss */
#define GPIO0_SPI0_SS \
	BFLB_PINMUX(0, spi0, ss, periph)

/* gpio0_i2s_bclk */
#define GPIO0_I2S_BCLK \
	BFLB_PINMUX(0, i2s, bclk, periph)

/* gpio0_pdm_in */
#define GPIO0_PDM_IN \
	BFLB_PINMUX(0, pdm, in, periph)

/* gpio0_i2c0_scl */
#define GPIO0_I2C0_SCL \
	BFLB_PINMUX(0, i2c0, scl, periph)

/* gpio0_i2c1_scl */
#define GPIO0_I2C1_SCL \
	BFLB_PINMUX(0, i2c1, scl, periph)

/* gpio0_uart0_rts */
#define GPIO0_UART0_RTS \
	BFLB_PINMUX(0, uart0, rts, periph)

/* gpio0_uart0_cts */
#define GPIO0_UART0_CTS \
	BFLB_PINMUX(0, uart0, cts, periph)

/* gpio0_uart0_tx */
#define GPIO0_UART0_TX \
	BFLB_PINMUX(0, uart0, tx, periph)

/* gpio0_uart0_rx */
#define GPIO0_UART0_RX \
	BFLB_PINMUX(0, uart0, rx, periph)

/* gpio0_uart1_rts */
#define GPIO0_UART1_RTS \
	BFLB_PINMUX(0, uart1, rts, periph)

/* gpio0_uart1_cts */
#define GPIO0_UART1_CTS \
	BFLB_PINMUX(0, uart1, cts, periph)

/* gpio0_uart1_tx */
#define GPIO0_UART1_TX \
	BFLB_PINMUX(0, uart1, tx, periph)

/* gpio0_uart1_rx */
#define GPIO0_UART1_RX \
	BFLB_PINMUX(0, uart1, rx, periph)

/* gpio0_uart2_rts */
#define GPIO0_UART2_RTS \
	BFLB_PINMUX(0, uart2, rts, periph)

/* gpio0_uart2_cts */
#define GPIO0_UART2_CTS \
	BFLB_PINMUX(0, uart2, cts, periph)

/* gpio0_uart2_tx */
#define GPIO0_UART2_TX \
	BFLB_PINMUX(0, uart2, tx, periph)

/* gpio0_uart2_rx */
#define GPIO0_UART2_RX \
	BFLB_PINMUX(0, uart2, rx, periph)

/* gpio0_pwm0_ch0p */
#define GPIO0_PWM0_CH0P \
	BFLB_PINMUX(0, pwm0, ch0p, periph)

/* gpio0_pwm1_ch0p */
#define GPIO0_PWM1_CH0P \
	BFLB_PINMUX(0, pwm1, ch0p, periph)

/* gpio0_spi1_ss */
#define GPIO0_SPI1_SS \
	BFLB_PINMUX(0, spi1, ss, periph)

/* gpio0_i2c2_scl */
#define GPIO0_I2C2_SCL \
	BFLB_PINMUX(0, i2c2, scl, periph)

/* gpio0_i2c3_scl */
#define GPIO0_I2C3_SCL \
	BFLB_PINMUX(0, i2c3, scl, periph)

/* gpio0_mm_uart_tx */
#define GPIO0_MM_UART_TX \
	BFLB_PINMUX(0, mm_uart, tx, periph)

/* gpio0_dbi_c_cs */
#define GPIO0_DBI_C_CS \
	BFLB_PINMUX(0, dbi_c, cs, periph)

/* gpio0_jtag_lp_tck */
#define GPIO0_JTAG_LP_TCK \
	BFLB_PINMUX(0, jtag_lp, tck, periph)

/* gpio0_jtag_m0_tck */
#define GPIO0_JTAG_M0_TCK \
	BFLB_PINMUX(0, jtag_m0, tck, periph)

/* gpio0_jtag_d0_tck */
#define GPIO0_JTAG_D0_TCK \
	BFLB_PINMUX(0, jtag_d0, tck, periph)

/* gpio0_clock_out0_cam_ref */
#define GPIO0_CLOCK_OUT0_CAM_REF \
	BFLB_PINMUX(0, clock_out0, cam_ref, periph)

/* gpio0_clock_out0_i2s_ref */
#define GPIO0_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(0, clock_out0, i2s_ref, periph)

/* gpio0_clock_out0_clk_audio_adc */
#define GPIO0_CLOCK_OUT0_CLK_AUDIO_ADC \
	BFLB_PINMUX(0, clock_out0, clk_audio_adc, periph)

/* gpio0_clock_out0_clk_audio_dac */
#define GPIO0_CLOCK_OUT0_CLK_AUDIO_DAC \
	BFLB_PINMUX(0, clock_out0, clk_audio_dac, periph)

/* gpio0_analog_usb20_rref_ext */
#define GPIO0_ANALOG_USB20_RREF_EXT \
	BFLB_PINMUX(0, analog, usb20_rref_ext, analog)

/* gpio1_sdh_cmd */
#define GPIO1_SDH_CMD \
	BFLB_PINMUX(1, sdh, cmd, periph)

/* gpio1_spi0_mosi */
#define GPIO1_SPI0_MOSI \
	BFLB_PINMUX(1, spi0, mosi, periph)

/* gpio1_i2s_fs */
#define GPIO1_I2S_FS \
	BFLB_PINMUX(1, i2s, fs, periph)

/* gpio1_pdm_in */
#define GPIO1_PDM_IN \
	BFLB_PINMUX(1, pdm, in, periph)

/* gpio1_i2c0_sda */
#define GPIO1_I2C0_SDA \
	BFLB_PINMUX(1, i2c0, sda, periph)

/* gpio1_i2c1_sda */
#define GPIO1_I2C1_SDA \
	BFLB_PINMUX(1, i2c1, sda, periph)

/* gpio1_uart0_rts */
#define GPIO1_UART0_RTS \
	BFLB_PINMUX(1, uart0, rts, periph)

/* gpio1_uart0_cts */
#define GPIO1_UART0_CTS \
	BFLB_PINMUX(1, uart0, cts, periph)

/* gpio1_uart0_tx */
#define GPIO1_UART0_TX \
	BFLB_PINMUX(1, uart0, tx, periph)

/* gpio1_uart0_rx */
#define GPIO1_UART0_RX \
	BFLB_PINMUX(1, uart0, rx, periph)

/* gpio1_uart1_rts */
#define GPIO1_UART1_RTS \
	BFLB_PINMUX(1, uart1, rts, periph)

/* gpio1_uart1_cts */
#define GPIO1_UART1_CTS \
	BFLB_PINMUX(1, uart1, cts, periph)

/* gpio1_uart1_tx */
#define GPIO1_UART1_TX \
	BFLB_PINMUX(1, uart1, tx, periph)

/* gpio1_uart1_rx */
#define GPIO1_UART1_RX \
	BFLB_PINMUX(1, uart1, rx, periph)

/* gpio1_uart2_rts */
#define GPIO1_UART2_RTS \
	BFLB_PINMUX(1, uart2, rts, periph)

/* gpio1_uart2_cts */
#define GPIO1_UART2_CTS \
	BFLB_PINMUX(1, uart2, cts, periph)

/* gpio1_uart2_tx */
#define GPIO1_UART2_TX \
	BFLB_PINMUX(1, uart2, tx, periph)

/* gpio1_uart2_rx */
#define GPIO1_UART2_RX \
	BFLB_PINMUX(1, uart2, rx, periph)

/* gpio1_pwm0_ch1p */
#define GPIO1_PWM0_CH1P \
	BFLB_PINMUX(1, pwm0, ch1p, periph)

/* gpio1_pwm1_ch1p */
#define GPIO1_PWM1_CH1P \
	BFLB_PINMUX(1, pwm1, ch1p, periph)

/* gpio1_spi1_mosi */
#define GPIO1_SPI1_MOSI \
	BFLB_PINMUX(1, spi1, mosi, periph)

/* gpio1_i2c2_sda */
#define GPIO1_I2C2_SDA \
	BFLB_PINMUX(1, i2c2, sda, periph)

/* gpio1_i2c3_sda */
#define GPIO1_I2C3_SDA \
	BFLB_PINMUX(1, i2c3, sda, periph)

/* gpio1_mm_uart_rx */
#define GPIO1_MM_UART_RX \
	BFLB_PINMUX(1, mm_uart, rx, periph)

/* gpio1_dbi_c_dcn */
#define GPIO1_DBI_C_DCN \
	BFLB_PINMUX(1, dbi_c, dcn, periph)

/* gpio1_jtag_lp_tdi */
#define GPIO1_JTAG_LP_TDI \
	BFLB_PINMUX(1, jtag_lp, tdi, periph)

/* gpio1_jtag_m0_tdi */
#define GPIO1_JTAG_M0_TDI \
	BFLB_PINMUX(1, jtag_m0, tdi, periph)

/* gpio1_jtag_d0_tdi */
#define GPIO1_JTAG_D0_TDI \
	BFLB_PINMUX(1, jtag_d0, tdi, periph)

/* gpio1_clock_out1_cam_ref */
#define GPIO1_CLOCK_OUT1_CAM_REF \
	BFLB_PINMUX(1, clock_out1, cam_ref, periph)

/* gpio1_clock_out1_i2s_ref */
#define GPIO1_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(1, clock_out1, i2s_ref, periph)

/* gpio1_clock_out1_clk_audio_adc */
#define GPIO1_CLOCK_OUT1_CLK_AUDIO_ADC \
	BFLB_PINMUX(1, clock_out1, clk_audio_adc, periph)

/* gpio1_clock_out1_clk_audio_dac */
#define GPIO1_CLOCK_OUT1_CLK_AUDIO_DAC \
	BFLB_PINMUX(1, clock_out1, clk_audio_dac, periph)

/* gpio2_sdh_dat0 */
#define GPIO2_SDH_DAT0 \
	BFLB_PINMUX(2, sdh, dat0, periph)

