zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio2_spi0_miso */
#define GPIO2_SPI0_MISO \
	BFLB_PINMUX(2, spi0, miso, periph)

/* gpio2_i2s_di */
#define GPIO2_I2S_DI \
	BFLB_PINMUX(2, i2s, di, periph)

/* gpio2_pdm_clk */
#define GPIO2_PDM_CLK \
	BFLB_PINMUX(2, pdm, clk, periph)

/* gpio2_i2c0_scl */
#define GPIO2_I2C0_SCL \
	BFLB_PINMUX(2, i2c0, scl, periph)

/* gpio2_i2c1_scl */
#define GPIO2_I2C1_SCL \
	BFLB_PINMUX(2, i2c1, scl, periph)

/* gpio2_uart0_rts */
#define GPIO2_UART0_RTS \
	BFLB_PINMUX(2, uart0, rts, periph)

/* gpio2_uart0_cts */
#define GPIO2_UART0_CTS \
	BFLB_PINMUX(2, uart0, cts, periph)

/* gpio2_uart0_tx */
#define GPIO2_UART0_TX \
	BFLB_PINMUX(2, uart0, tx, periph)

/* gpio2_uart0_rx */
#define GPIO2_UART0_RX \
	BFLB_PINMUX(2, uart0, rx, periph)

/* gpio2_uart1_rts */
#define GPIO2_UART1_RTS \
	BFLB_PINMUX(2, uart1, rts, periph)

/* gpio2_uart1_cts */
#define GPIO2_UART1_CTS \
	BFLB_PINMUX(2, uart1, cts, periph)

/* gpio2_uart1_tx */
#define GPIO2_UART1_TX \
	BFLB_PINMUX(2, uart1, tx, periph)

/* gpio2_uart1_rx */
#define GPIO2_UART1_RX \
	BFLB_PINMUX(2, uart1, rx, periph)

/* gpio2_uart2_rts */
#define GPIO2_UART2_RTS \
	BFLB_PINMUX(2, uart2, rts, periph)

/* gpio2_uart2_cts */
#define GPIO2_UART2_CTS \
	BFLB_PINMUX(2, uart2, cts, periph)

/* gpio2_uart2_tx */
#define GPIO2_UART2_TX \
	BFLB_PINMUX(2, uart2, tx, periph)

/* gpio2_uart2_rx */
#define GPIO2_UART2_RX \
	BFLB_PINMUX(2, uart2, rx, periph)

/* gpio2_pwm0_ch2p */
#define GPIO2_PWM0_CH2P \
	BFLB_PINMUX(2, pwm0, ch2p, periph)

/* gpio2_pwm1_ch2p */
#define GPIO2_PWM1_CH2P \
	BFLB_PINMUX(2, pwm1, ch2p, periph)

/* gpio2_spi1_miso */
#define GPIO2_SPI1_MISO \
	BFLB_PINMUX(2, spi1, miso, periph)

/* gpio2_i2c2_scl */
#define GPIO2_I2C2_SCL \
	BFLB_PINMUX(2, i2c2, scl, periph)

/* gpio2_i2c3_scl */
#define GPIO2_I2C3_SCL \
	BFLB_PINMUX(2, i2c3, scl, periph)

/* gpio2_mm_uart_rts */
#define GPIO2_MM_UART_RTS \
	BFLB_PINMUX(2, mm_uart, rts, periph)

/* gpio2_dbi_c_scl */
#define GPIO2_DBI_C_SCL \
	BFLB_PINMUX(2, dbi_c, scl, periph)

/* gpio2_jtag_lp_tms */
#define GPIO2_JTAG_LP_TMS \
	BFLB_PINMUX(2, jtag_lp, tms, periph)

/* gpio2_jtag_m0_tms */
#define GPIO2_JTAG_M0_TMS \
	BFLB_PINMUX(2, jtag_m0, tms, periph)

/* gpio2_jtag_d0_tms */
#define GPIO2_JTAG_D0_TMS \
	BFLB_PINMUX(2, jtag_d0, tms, periph)

/* gpio2_clock_out2_cam_ref */
#define GPIO2_CLOCK_OUT2_CAM_REF \
	BFLB_PINMUX(2, clock_out2, cam_ref, periph)

/* gpio2_clock_out2_i2s_ref */
#define GPIO2_CLOCK_OUT2_I2S_REF \
	BFLB_PINMUX(2, clock_out2, i2s_ref, periph)

/* gpio2_clock_out2_xtal */
#define GPIO2_CLOCK_OUT2_XTAL \
	BFLB_PINMUX(2, clock_out2, xtal, periph)

/* gpio2_clock_out2_wifipll_32m */
#define GPIO2_CLOCK_OUT2_WIFIPLL_32M \
	BFLB_PINMUX(2, clock_out2, wifipll_32m, periph)

/* gpio3_sdh_dat1 */
#define GPIO3_SDH_DAT1 \
	BFLB_PINMUX(3, sdh, dat1, periph)

/* gpio3_spi0_sclk */
#define GPIO3_SPI0_SCLK \
	BFLB_PINMUX(3, spi0, sclk, periph)

/* gpio3_i2s_do */
#define GPIO3_I2S_DO \
	BFLB_PINMUX(3, i2s, do, periph)

/* gpio3_pdm_in */
#define GPIO3_PDM_IN \
	BFLB_PINMUX(3, pdm, in, periph)

/* gpio3_i2c0_sda */
#define GPIO3_I2C0_SDA \
	BFLB_PINMUX(3, i2c0, sda, periph)

/* gpio3_i2c1_sda */
#define GPIO3_I2C1_SDA \
	BFLB_PINMUX(3, i2c1, sda, periph)

/* gpio3_uart0_rts */
#define GPIO3_UART0_RTS \
	BFLB_PINMUX(3, uart0, rts, periph)

/* gpio3_uart0_cts */
#define GPIO3_UART0_CTS \
	BFLB_PINMUX(3, uart0, cts, periph)

/* gpio3_uart0_tx */
#define GPIO3_UART0_TX \
	BFLB_PINMUX(3, uart0, tx, periph)

/* gpio3_uart0_rx */
#define GPIO3_UART0_RX \
	BFLB_PINMUX(3, uart0, rx, periph)

/* gpio3_uart1_rts */
#define GPIO3_UART1_RTS \
	BFLB_PINMUX(3, uart1, rts, periph)

/* gpio3_uart1_cts */
#define GPIO3_UART1_CTS \
	BFLB_PINMUX(3, uart1, cts, periph)

/* gpio3_uart1_tx */
#define GPIO3_UART1_TX \
	BFLB_PINMUX(3, uart1, tx, periph)

/* gpio3_uart1_rx */
#define GPIO3_UART1_RX \
	BFLB_PINMUX(3, uart1, rx, periph)

/* gpio3_uart2_rts */
#define GPIO3_UART2_RTS \
	BFLB_PINMUX(3, uart2, rts, periph)

/* gpio3_uart2_cts */
#define GPIO3_UART2_CTS \
	BFLB_PINMUX(3, uart2, cts, periph)

/* gpio3_uart2_tx */
#define GPIO3_UART2_TX \
	BFLB_PINMUX(3, uart2, tx, periph)

/* gpio3_uart2_rx */
#define GPIO3_UART2_RX \
	BFLB_PINMUX(3, uart2, rx, periph)

/* gpio3_pwm0_ch3p */
#define GPIO3_PWM0_CH3P \
	BFLB_PINMUX(3, pwm0, ch3p, periph)

/* gpio3_pwm1_ch3p */
#define GPIO3_PWM1_CH3P \
	BFLB_PINMUX(3, pwm1, ch3p, periph)

/* gpio3_spi1_sclk */
#define GPIO3_SPI1_SCLK \
	BFLB_PINMUX(3, spi1, sclk, periph)

/* gpio3_i2c2_sda */
#define GPIO3_I2C2_SDA \
	BFLB_PINMUX(3, i2c2, sda, periph)

/* gpio3_i2c3_sda */
#define GPIO3_I2C3_SDA \
	BFLB_PINMUX(3, i2c3, sda, periph)

/* gpio3_mm_uart_cts */
#define GPIO3_MM_UART_CTS \
	BFLB_PINMUX(3, mm_uart, cts, periph)

/* gpio3_dbi_c_sda */
#define GPIO3_DBI_C_SDA \
	BFLB_PINMUX(3, dbi_c, sda, periph)

/* gpio3_jtag_lp_tdo */
#define GPIO3_JTAG_LP_TDO \
	BFLB_PINMUX(3, jtag_lp, tdo, periph)

/* gpio3_jtag_m0_tdo */
#define GPIO3_JTAG_M0_TDO \
	BFLB_PINMUX(3, jtag_m0, tdo, periph)

/* gpio3_jtag_d0_tdo */
#define GPIO3_JTAG_D0_TDO \
	BFLB_PINMUX(3, jtag_d0, tdo, periph)

/* gpio3_clock_out3_cam_ref */
#define GPIO3_CLOCK_OUT3_CAM_REF \
	BFLB_PINMUX(3, clock_out3, cam_ref, periph)

/* gpio3_clock_out3_i2s_ref */
#define GPIO3_CLOCK_OUT3_I2S_REF \
	BFLB_PINMUX(3, clock_out3, i2s_ref, periph)

/* gpio3_clock_out3_wifipll_48m */
#define GPIO3_CLOCK_OUT3_WIFIPLL_48M \
	BFLB_PINMUX(3, clock_out3, wifipll_48m, periph)

/* gpio4_sdh_dat2 */
#define GPIO4_SDH_DAT2 \
	BFLB_PINMUX(4, sdh, dat2, periph)

/* gpio4_spi0_ss */
#define GPIO4_SPI0_SS \
	BFLB_PINMUX(4, spi0, ss, periph)

/* gpio4_i2s_bclk */
#define GPIO4_I2S_BCLK \
	BFLB_PINMUX(4, i2s, bclk, periph)

/* gpio4_pdm_in */
#define GPIO4_PDM_IN \
	BFLB_PINMUX(4, pdm, in, periph)

/* gpio4_i2c0_scl */
#define GPIO4_I2C0_SCL \
	BFLB_PINMUX(4, i2c0, scl, periph)

/* gpio4_i2c1_scl */
#define GPIO4_I2C1_SCL \
	BFLB_PINMUX(4, i2c1, scl, periph)

/* gpio4_uart0_rts */
#define GPIO4_UART0_RTS \
	BFLB_PINMUX(4, uart0, rts, periph)

/* gpio4_uart0_cts */
#define GPIO4_UART0_CTS \
	BFLB_PINMUX(4, uart0, cts, periph)

/* gpio4_uart0_tx */
#define GPIO4_UART0_TX \
	BFLB_PINMUX(4, uart0, tx, periph)

/* gpio4_uart0_rx */
#define GPIO4_UART0_RX \
	BFLB_PINMUX(4, uart0, rx, periph)

