zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio4_uart1_rts */
#define GPIO4_UART1_RTS \
	BFLB_PINMUX(4, uart1, rts, periph)

/* gpio4_uart1_cts */
#define GPIO4_UART1_CTS \
	BFLB_PINMUX(4, uart1, cts, periph)

/* gpio4_uart1_tx */
#define GPIO4_UART1_TX \
	BFLB_PINMUX(4, uart1, tx, periph)

/* gpio4_uart1_rx */
#define GPIO4_UART1_RX \
	BFLB_PINMUX(4, uart1, rx, periph)

/* gpio4_uart2_rts */
#define GPIO4_UART2_RTS \
	BFLB_PINMUX(4, uart2, rts, periph)

/* gpio4_uart2_cts */
#define GPIO4_UART2_CTS \
	BFLB_PINMUX(4, uart2, cts, periph)

/* gpio4_uart2_tx */
#define GPIO4_UART2_TX \
	BFLB_PINMUX(4, uart2, tx, periph)

/* gpio4_uart2_rx */
#define GPIO4_UART2_RX \
	BFLB_PINMUX(4, uart2, rx, periph)

/* gpio4_pwm0_ch0p */
#define GPIO4_PWM0_CH0P \
	BFLB_PINMUX(4, pwm0, ch0p, periph)

/* gpio4_pwm1_ch0p */
#define GPIO4_PWM1_CH0P \
	BFLB_PINMUX(4, pwm1, ch0p, periph)

/* gpio4_spi1_ss */
#define GPIO4_SPI1_SS \
	BFLB_PINMUX(4, spi1, ss, periph)

/* gpio4_i2c2_scl */
#define GPIO4_I2C2_SCL \
	BFLB_PINMUX(4, i2c2, scl, periph)

/* gpio4_i2c3_scl */
#define GPIO4_I2C3_SCL \
	BFLB_PINMUX(4, i2c3, scl, periph)

/* gpio4_mm_uart_tx */
#define GPIO4_MM_UART_TX \
	BFLB_PINMUX(4, mm_uart, tx, periph)

/* gpio4_dbi_c_cs */
#define GPIO4_DBI_C_CS \
	BFLB_PINMUX(4, dbi_c, cs, periph)

/* gpio4_jtag_lp_tck */
#define GPIO4_JTAG_LP_TCK \
	BFLB_PINMUX(4, jtag_lp, tck, periph)

/* gpio4_jtag_m0_tck */
#define GPIO4_JTAG_M0_TCK \
	BFLB_PINMUX(4, jtag_m0, tck, periph)

/* gpio4_jtag_d0_tck */
#define GPIO4_JTAG_D0_TCK \
	BFLB_PINMUX(4, jtag_d0, tck, periph)

/* gpio4_clock_out0_cam_ref */
#define GPIO4_CLOCK_OUT0_CAM_REF \
	BFLB_PINMUX(4, clock_out0, cam_ref, periph)

/* gpio4_clock_out0_i2s_ref */
#define GPIO4_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(4, clock_out0, i2s_ref, periph)

/* gpio4_clock_out0_clk_audio_adc */
#define GPIO4_CLOCK_OUT0_CLK_AUDIO_ADC \
	BFLB_PINMUX(4, clock_out0, clk_audio_adc, periph)

/* gpio4_clock_out0_clk_audio_dac */
#define GPIO4_CLOCK_OUT0_CLK_AUDIO_DAC \
	BFLB_PINMUX(4, clock_out0, clk_audio_dac, periph)

/* gpio4_adc_ch2 */
#define GPIO4_ADC_CH2 \
	BFLB_PINMUX(4, adc, ch2, analog)

/* gpio4_dac_chb */
#define GPIO4_DAC_CHB \
	BFLB_PINMUX(4, dac, chb, analog)

/* gpio5_sdh_dat3 */
#define GPIO5_SDH_DAT3 \
	BFLB_PINMUX(5, sdh, dat3, periph)

/* gpio5_spi0_mosi */
#define GPIO5_SPI0_MOSI \
	BFLB_PINMUX(5, spi0, mosi, periph)

/* gpio5_i2s_fs */
#define GPIO5_I2S_FS \
	BFLB_PINMUX(5, i2s, fs, periph)

/* gpio5_pdm_clk */
#define GPIO5_PDM_CLK \
	BFLB_PINMUX(5, pdm, clk, periph)

/* gpio5_i2c0_sda */
#define GPIO5_I2C0_SDA \
	BFLB_PINMUX(5, i2c0, sda, periph)

/* gpio5_i2c1_sda */
#define GPIO5_I2C1_SDA \
	BFLB_PINMUX(5, i2c1, sda, periph)

/* gpio5_uart0_rts */
#define GPIO5_UART0_RTS \
	BFLB_PINMUX(5, uart0, rts, periph)

/* gpio5_uart0_cts */
#define GPIO5_UART0_CTS \
	BFLB_PINMUX(5, uart0, cts, periph)

/* gpio5_uart0_tx */
#define GPIO5_UART0_TX \
	BFLB_PINMUX(5, uart0, tx, periph)

/* gpio5_uart0_rx */
#define GPIO5_UART0_RX \
	BFLB_PINMUX(5, uart0, rx, periph)

/* gpio5_uart1_rts */
#define GPIO5_UART1_RTS \
	BFLB_PINMUX(5, uart1, rts, periph)

/* gpio5_uart1_cts */
#define GPIO5_UART1_CTS \
	BFLB_PINMUX(5, uart1, cts, periph)

/* gpio5_uart1_tx */
#define GPIO5_UART1_TX \
	BFLB_PINMUX(5, uart1, tx, periph)

/* gpio5_uart1_rx */
#define GPIO5_UART1_RX \
	BFLB_PINMUX(5, uart1, rx, periph)

/* gpio5_uart2_rts */
#define GPIO5_UART2_RTS \
	BFLB_PINMUX(5, uart2, rts, periph)

/* gpio5_uart2_cts */
#define GPIO5_UART2_CTS \
	BFLB_PINMUX(5, uart2, cts, periph)

/* gpio5_uart2_tx */
#define GPIO5_UART2_TX \
	BFLB_PINMUX(5, uart2, tx, periph)

/* gpio5_uart2_rx */
#define GPIO5_UART2_RX \
	BFLB_PINMUX(5, uart2, rx, periph)

/* gpio5_pwm0_ch1p */
#define GPIO5_PWM0_CH1P \
	BFLB_PINMUX(5, pwm0, ch1p, periph)

/* gpio5_pwm1_ch1p */
#define GPIO5_PWM1_CH1P \
	BFLB_PINMUX(5, pwm1, ch1p, periph)

/* gpio5_spi1_mosi */
#define GPIO5_SPI1_MOSI \
	BFLB_PINMUX(5, spi1, mosi, periph)

/* gpio5_i2c2_sda */
#define GPIO5_I2C2_SDA \
	BFLB_PINMUX(5, i2c2, sda, periph)

/* gpio5_i2c3_sda */
#define GPIO5_I2C3_SDA \
	BFLB_PINMUX(5, i2c3, sda, periph)

/* gpio5_mm_uart_rx */
#define GPIO5_MM_UART_RX \
	BFLB_PINMUX(5, mm_uart, rx, periph)

/* gpio5_dbi_c_dcn */
#define GPIO5_DBI_C_DCN \
	BFLB_PINMUX(5, dbi_c, dcn, periph)

/* gpio5_jtag_lp_tdi */
#define GPIO5_JTAG_LP_TDI \
	BFLB_PINMUX(5, jtag_lp, tdi, periph)

/* gpio5_jtag_m0_tdi */
#define GPIO5_JTAG_M0_TDI \
	BFLB_PINMUX(5, jtag_m0, tdi, periph)

/* gpio5_jtag_d0_tdi */
#define GPIO5_JTAG_D0_TDI \
	BFLB_PINMUX(5, jtag_d0, tdi, periph)

/* gpio5_clock_out1_cam_ref */
#define GPIO5_CLOCK_OUT1_CAM_REF \
	BFLB_PINMUX(5, clock_out1, cam_ref, periph)

/* gpio5_clock_out1_i2s_ref */
#define GPIO5_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(5, clock_out1, i2s_ref, periph)

/* gpio5_clock_out1_clk_audio_adc */
#define GPIO5_CLOCK_OUT1_CLK_AUDIO_ADC \
	BFLB_PINMUX(5, clock_out1, clk_audio_adc, periph)

/* gpio5_clock_out1_clk_audio_dac */
#define GPIO5_CLOCK_OUT1_CLK_AUDIO_DAC \
	BFLB_PINMUX(5, clock_out1, clk_audio_dac, periph)

/* gpio5_adc_ch1 */
#define GPIO5_ADC_CH1 \
	BFLB_PINMUX(5, adc, ch1, analog)

/* gpio6_spi0_miso */
#define GPIO6_SPI0_MISO \
	BFLB_PINMUX(6, spi0, miso, periph)

/* gpio6_i2s_di */
#define GPIO6_I2S_DI \
	BFLB_PINMUX(6, i2s, di, periph)

/* gpio6_i2c0_scl */
#define GPIO6_I2C0_SCL \
	BFLB_PINMUX(6, i2c0, scl, periph)

/* gpio6_i2c1_scl */
#define GPIO6_I2C1_SCL \
	BFLB_PINMUX(6, i2c1, scl, periph)

/* gpio6_uart0_rts */
#define GPIO6_UART0_RTS \
	BFLB_PINMUX(6, uart0, rts, periph)

/* gpio6_uart0_cts */
#define GPIO6_UART0_CTS \
	BFLB_PINMUX(6, uart0, cts, periph)

/* gpio6_uart0_tx */
#define GPIO6_UART0_TX \
	BFLB_PINMUX(6, uart0, tx, periph)

/* gpio6_uart0_rx */
#define GPIO6_UART0_RX \
	BFLB_PINMUX(6, uart0, rx, periph)

/* gpio6_uart1_rts */
#define GPIO6_UART1_RTS \
	BFLB_PINMUX(6, uart1, rts, periph)

/* gpio6_uart1_cts */
#define GPIO6_UART1_CTS \
	BFLB_PINMUX(6, uart1, cts, periph)

/* gpio6_uart1_tx */
#define GPIO6_UART1_TX \
	BFLB_PINMUX(6, uart1, tx, periph)

/* gpio6_uart1_rx */
#define GPIO6_UART1_RX \
	BFLB_PINMUX(6, uart1, rx, periph)

/* gpio6_uart2_rts */
#define GPIO6_UART2_RTS \
	BFLB_PINMUX(6, uart2, rts, periph)

