zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio6_uart2_cts */
#define GPIO6_UART2_CTS \
	BFLB_PINMUX(6, uart2, cts, periph)

/* gpio6_uart2_tx */
#define GPIO6_UART2_TX \
	BFLB_PINMUX(6, uart2, tx, periph)

/* gpio6_uart2_rx */
#define GPIO6_UART2_RX \
	BFLB_PINMUX(6, uart2, rx, periph)

/* gpio6_pwm0_ch2p */
#define GPIO6_PWM0_CH2P \
	BFLB_PINMUX(6, pwm0, ch2p, periph)

/* gpio6_pwm1_ch2p */
#define GPIO6_PWM1_CH2P \
	BFLB_PINMUX(6, pwm1, ch2p, periph)

/* gpio6_spi1_miso */
#define GPIO6_SPI1_MISO \
	BFLB_PINMUX(6, spi1, miso, periph)

/* gpio6_i2c2_scl */
#define GPIO6_I2C2_SCL \
	BFLB_PINMUX(6, i2c2, scl, periph)

/* gpio6_i2c3_scl */
#define GPIO6_I2C3_SCL \
	BFLB_PINMUX(6, i2c3, scl, periph)

/* gpio6_mm_uart_rts */
#define GPIO6_MM_UART_RTS \
	BFLB_PINMUX(6, mm_uart, rts, periph)

/* gpio6_dbi_c_scl */
#define GPIO6_DBI_C_SCL \
	BFLB_PINMUX(6, dbi_c, scl, periph)

/* gpio6_jtag_lp_tms */
#define GPIO6_JTAG_LP_TMS \
	BFLB_PINMUX(6, jtag_lp, tms, periph)

/* gpio6_jtag_m0_tms */
#define GPIO6_JTAG_M0_TMS \
	BFLB_PINMUX(6, jtag_m0, tms, periph)

/* gpio6_jtag_d0_tms */
#define GPIO6_JTAG_D0_TMS \
	BFLB_PINMUX(6, jtag_d0, tms, periph)

/* gpio6_clock_out2_cam_ref */
#define GPIO6_CLOCK_OUT2_CAM_REF \
	BFLB_PINMUX(6, clock_out2, cam_ref, periph)

/* gpio6_clock_out2_i2s_ref */
#define GPIO6_CLOCK_OUT2_I2S_REF \
	BFLB_PINMUX(6, clock_out2, i2s_ref, periph)

/* gpio6_clock_out2_xtal */
#define GPIO6_CLOCK_OUT2_XTAL \
	BFLB_PINMUX(6, clock_out2, xtal, periph)

/* gpio6_clock_out2_wifipll_32m */
#define GPIO6_CLOCK_OUT2_WIFIPLL_32M \
	BFLB_PINMUX(6, clock_out2, wifipll_32m, periph)

/* gpio6_adc_ch4 */
#define GPIO6_ADC_CH4 \
	BFLB_PINMUX(6, adc, ch4, analog)

/* gpio7_spi0_sclk */
#define GPIO7_SPI0_SCLK \
	BFLB_PINMUX(7, spi0, sclk, periph)

/* gpio7_i2s_do */
#define GPIO7_I2S_DO \
	BFLB_PINMUX(7, i2s, do, periph)

/* gpio7_i2c0_sda */
#define GPIO7_I2C0_SDA \
	BFLB_PINMUX(7, i2c0, sda, periph)

/* gpio7_i2c1_sda */
#define GPIO7_I2C1_SDA \
	BFLB_PINMUX(7, i2c1, sda, periph)

/* gpio7_uart0_rts */
#define GPIO7_UART0_RTS \
	BFLB_PINMUX(7, uart0, rts, periph)

/* gpio7_uart0_cts */
#define GPIO7_UART0_CTS \
	BFLB_PINMUX(7, uart0, cts, periph)

/* gpio7_uart0_tx */
#define GPIO7_UART0_TX \
	BFLB_PINMUX(7, uart0, tx, periph)

/* gpio7_uart0_rx */
#define GPIO7_UART0_RX \
	BFLB_PINMUX(7, uart0, rx, periph)

/* gpio7_uart1_rts */
#define GPIO7_UART1_RTS \
	BFLB_PINMUX(7, uart1, rts, periph)

/* gpio7_uart1_cts */
#define GPIO7_UART1_CTS \
	BFLB_PINMUX(7, uart1, cts, periph)

/* gpio7_uart1_tx */
#define GPIO7_UART1_TX \
	BFLB_PINMUX(7, uart1, tx, periph)

/* gpio7_uart1_rx */
#define GPIO7_UART1_RX \
	BFLB_PINMUX(7, uart1, rx, periph)

/* gpio7_uart2_rts */
#define GPIO7_UART2_RTS \
	BFLB_PINMUX(7, uart2, rts, periph)

/* gpio7_uart2_cts */
#define GPIO7_UART2_CTS \
	BFLB_PINMUX(7, uart2, cts, periph)

/* gpio7_uart2_tx */
#define GPIO7_UART2_TX \
	BFLB_PINMUX(7, uart2, tx, periph)

/* gpio7_uart2_rx */
#define GPIO7_UART2_RX \
	BFLB_PINMUX(7, uart2, rx, periph)

/* gpio7_pwm0_ch3p */
#define GPIO7_PWM0_CH3P \
	BFLB_PINMUX(7, pwm0, ch3p, periph)

/* gpio7_pwm1_ch3p */
#define GPIO7_PWM1_CH3P \
	BFLB_PINMUX(7, pwm1, ch3p, periph)

/* gpio7_spi1_sclk */
#define GPIO7_SPI1_SCLK \
	BFLB_PINMUX(7, spi1, sclk, periph)

/* gpio7_i2c2_sda */
#define GPIO7_I2C2_SDA \
	BFLB_PINMUX(7, i2c2, sda, periph)

/* gpio7_i2c3_sda */
#define GPIO7_I2C3_SDA \
	BFLB_PINMUX(7, i2c3, sda, periph)

/* gpio7_mm_uart_cts */
#define GPIO7_MM_UART_CTS \
	BFLB_PINMUX(7, mm_uart, cts, periph)

/* gpio7_dbi_c_sda */
#define GPIO7_DBI_C_SDA \
	BFLB_PINMUX(7, dbi_c, sda, periph)

/* gpio7_jtag_lp_tdo */
#define GPIO7_JTAG_LP_TDO \
	BFLB_PINMUX(7, jtag_lp, tdo, periph)

/* gpio7_jtag_m0_tdo */
#define GPIO7_JTAG_M0_TDO \
	BFLB_PINMUX(7, jtag_m0, tdo, periph)

/* gpio7_jtag_d0_tdo */
#define GPIO7_JTAG_D0_TDO \
	BFLB_PINMUX(7, jtag_d0, tdo, periph)

/* gpio7_clock_out3_cam_ref */
#define GPIO7_CLOCK_OUT3_CAM_REF \
	BFLB_PINMUX(7, clock_out3, cam_ref, periph)

/* gpio7_clock_out3_i2s_ref */
#define GPIO7_CLOCK_OUT3_I2S_REF \
	BFLB_PINMUX(7, clock_out3, i2s_ref, periph)

/* gpio7_clock_out3_wifipll_48m */
#define GPIO7_CLOCK_OUT3_WIFIPLL_48M \
	BFLB_PINMUX(7, clock_out3, wifipll_48m, periph)

/* gpio8_spi0_ss */
#define GPIO8_SPI0_SS \
	BFLB_PINMUX(8, spi0, ss, periph)

/* gpio8_i2s_bclk */
#define GPIO8_I2S_BCLK \
	BFLB_PINMUX(8, i2s, bclk, periph)

/* gpio8_i2c0_scl */
#define GPIO8_I2C0_SCL \
	BFLB_PINMUX(8, i2c0, scl, periph)

/* gpio8_i2c1_scl */
#define GPIO8_I2C1_SCL \
	BFLB_PINMUX(8, i2c1, scl, periph)

/* gpio8_uart0_rts */
#define GPIO8_UART0_RTS \
	BFLB_PINMUX(8, uart0, rts, periph)

/* gpio8_uart0_cts */
#define GPIO8_UART0_CTS \
	BFLB_PINMUX(8, uart0, cts, periph)

/* gpio8_uart0_tx */
#define GPIO8_UART0_TX \
	BFLB_PINMUX(8, uart0, tx, periph)

/* gpio8_uart0_rx */
#define GPIO8_UART0_RX \
	BFLB_PINMUX(8, uart0, rx, periph)

/* gpio8_uart1_rts */
#define GPIO8_UART1_RTS \
	BFLB_PINMUX(8, uart1, rts, periph)

/* gpio8_uart1_cts */
#define GPIO8_UART1_CTS \
	BFLB_PINMUX(8, uart1, cts, periph)

/* gpio8_uart1_tx */
#define GPIO8_UART1_TX \
	BFLB_PINMUX(8, uart1, tx, periph)

/* gpio8_uart1_rx */
#define GPIO8_UART1_RX \
	BFLB_PINMUX(8, uart1, rx, periph)

/* gpio8_uart2_rts */
#define GPIO8_UART2_RTS \
	BFLB_PINMUX(8, uart2, rts, periph)

/* gpio8_uart2_cts */
#define GPIO8_UART2_CTS \
	BFLB_PINMUX(8, uart2, cts, periph)

/* gpio8_uart2_tx */
#define GPIO8_UART2_TX \
	BFLB_PINMUX(8, uart2, tx, periph)

/* gpio8_uart2_rx */
#define GPIO8_UART2_RX \
	BFLB_PINMUX(8, uart2, rx, periph)

/* gpio8_pwm0_ch0p */
#define GPIO8_PWM0_CH0P \
	BFLB_PINMUX(8, pwm0, ch0p, periph)

/* gpio8_pwm1_ch0p */
#define GPIO8_PWM1_CH0P \
	BFLB_PINMUX(8, pwm1, ch0p, periph)

/* gpio8_spi1_ss */
#define GPIO8_SPI1_SS \
	BFLB_PINMUX(8, spi1, ss, periph)

/* gpio8_i2c2_scl */
#define GPIO8_I2C2_SCL \
	BFLB_PINMUX(8, i2c2, scl, periph)

/* gpio8_i2c3_scl */
#define GPIO8_I2C3_SCL \
	BFLB_PINMUX(8, i2c3, scl, periph)

/* gpio8_mm_uart_tx */
#define GPIO8_MM_UART_TX \
	BFLB_PINMUX(8, mm_uart, tx, periph)

/* gpio8_dbi_c_cs */
#define GPIO8_DBI_C_CS \
	BFLB_PINMUX(8, dbi_c, cs, periph)

