zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio8_jtag_lp_tck */
#define GPIO8_JTAG_LP_TCK \
	BFLB_PINMUX(8, jtag_lp, tck, periph)

/* gpio8_jtag_m0_tck */
#define GPIO8_JTAG_M0_TCK \
	BFLB_PINMUX(8, jtag_m0, tck, periph)

/* gpio8_jtag_d0_tck */
#define GPIO8_JTAG_D0_TCK \
	BFLB_PINMUX(8, jtag_d0, tck, periph)

/* gpio8_clock_out0_cam_ref */
#define GPIO8_CLOCK_OUT0_CAM_REF \
	BFLB_PINMUX(8, clock_out0, cam_ref, periph)

/* gpio8_clock_out0_i2s_ref */
#define GPIO8_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(8, clock_out0, i2s_ref, periph)

/* gpio8_clock_out0_clk_audio_adc */
#define GPIO8_CLOCK_OUT0_CLK_AUDIO_ADC \
	BFLB_PINMUX(8, clock_out0, clk_audio_adc, periph)

/* gpio8_clock_out0_clk_audio_dac */
#define GPIO8_CLOCK_OUT0_CLK_AUDIO_DAC \
	BFLB_PINMUX(8, clock_out0, clk_audio_dac, periph)

/* gpio9_spi0_mosi */
#define GPIO9_SPI0_MOSI \
	BFLB_PINMUX(9, spi0, mosi, periph)

/* gpio9_i2s_fs */
#define GPIO9_I2S_FS \
	BFLB_PINMUX(9, i2s, fs, periph)

/* gpio9_i2c0_sda */
#define GPIO9_I2C0_SDA \
	BFLB_PINMUX(9, i2c0, sda, periph)

/* gpio9_i2c1_sda */
#define GPIO9_I2C1_SDA \
	BFLB_PINMUX(9, i2c1, sda, periph)

/* gpio9_uart0_rts */
#define GPIO9_UART0_RTS \
	BFLB_PINMUX(9, uart0, rts, periph)

/* gpio9_uart0_cts */
#define GPIO9_UART0_CTS \
	BFLB_PINMUX(9, uart0, cts, periph)

/* gpio9_uart0_tx */
#define GPIO9_UART0_TX \
	BFLB_PINMUX(9, uart0, tx, periph)

/* gpio9_uart0_rx */
#define GPIO9_UART0_RX \
	BFLB_PINMUX(9, uart0, rx, periph)

/* gpio9_uart1_rts */
#define GPIO9_UART1_RTS \
	BFLB_PINMUX(9, uart1, rts, periph)

/* gpio9_uart1_cts */
#define GPIO9_UART1_CTS \
	BFLB_PINMUX(9, uart1, cts, periph)

/* gpio9_uart1_tx */
#define GPIO9_UART1_TX \
	BFLB_PINMUX(9, uart1, tx, periph)

/* gpio9_uart1_rx */
#define GPIO9_UART1_RX \
	BFLB_PINMUX(9, uart1, rx, periph)

/* gpio9_uart2_rts */
#define GPIO9_UART2_RTS \
	BFLB_PINMUX(9, uart2, rts, periph)

/* gpio9_uart2_cts */
#define GPIO9_UART2_CTS \
	BFLB_PINMUX(9, uart2, cts, periph)

/* gpio9_uart2_tx */
#define GPIO9_UART2_TX \
	BFLB_PINMUX(9, uart2, tx, periph)

/* gpio9_uart2_rx */
#define GPIO9_UART2_RX \
	BFLB_PINMUX(9, uart2, rx, periph)

/* gpio9_pwm0_ch1p */
#define GPIO9_PWM0_CH1P \
	BFLB_PINMUX(9, pwm0, ch1p, periph)

/* gpio9_pwm1_ch1p */
#define GPIO9_PWM1_CH1P \
	BFLB_PINMUX(9, pwm1, ch1p, periph)

/* gpio9_spi1_mosi */
#define GPIO9_SPI1_MOSI \
	BFLB_PINMUX(9, spi1, mosi, periph)

/* gpio9_i2c2_sda */
#define GPIO9_I2C2_SDA \
	BFLB_PINMUX(9, i2c2, sda, periph)

/* gpio9_i2c3_sda */
#define GPIO9_I2C3_SDA \
	BFLB_PINMUX(9, i2c3, sda, periph)

/* gpio9_mm_uart_rx */
#define GPIO9_MM_UART_RX \
	BFLB_PINMUX(9, mm_uart, rx, periph)

/* gpio9_dbi_c_dcn */
#define GPIO9_DBI_C_DCN \
	BFLB_PINMUX(9, dbi_c, dcn, periph)

/* gpio9_jtag_lp_tdi */
#define GPIO9_JTAG_LP_TDI \
	BFLB_PINMUX(9, jtag_lp, tdi, periph)

/* gpio9_jtag_m0_tdi */
#define GPIO9_JTAG_M0_TDI \
	BFLB_PINMUX(9, jtag_m0, tdi, periph)

/* gpio9_jtag_d0_tdi */
#define GPIO9_JTAG_D0_TDI \
	BFLB_PINMUX(9, jtag_d0, tdi, periph)

/* gpio9_clock_out1_cam_ref */
#define GPIO9_CLOCK_OUT1_CAM_REF \
	BFLB_PINMUX(9, clock_out1, cam_ref, periph)

/* gpio9_clock_out1_i2s_ref */
#define GPIO9_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(9, clock_out1, i2s_ref, periph)

/* gpio9_clock_out1_clk_audio_adc */
#define GPIO9_CLOCK_OUT1_CLK_AUDIO_ADC \
	BFLB_PINMUX(9, clock_out1, clk_audio_adc, periph)

/* gpio9_clock_out1_clk_audio_dac */
#define GPIO9_CLOCK_OUT1_CLK_AUDIO_DAC \
	BFLB_PINMUX(9, clock_out1, clk_audio_dac, periph)

/* gpio10_spi0_miso */
#define GPIO10_SPI0_MISO \
	BFLB_PINMUX(10, spi0, miso, periph)

/* gpio10_i2s_di */
#define GPIO10_I2S_DI \
	BFLB_PINMUX(10, i2s, di, periph)

/* gpio10_pdm_clk */
#define GPIO10_PDM_CLK \
	BFLB_PINMUX(10, pdm, clk, periph)

/* gpio10_i2c0_scl */
#define GPIO10_I2C0_SCL \
	BFLB_PINMUX(10, i2c0, scl, periph)

/* gpio10_i2c1_scl */
#define GPIO10_I2C1_SCL \
	BFLB_PINMUX(10, i2c1, scl, periph)

/* gpio10_uart0_rts */
#define GPIO10_UART0_RTS \
	BFLB_PINMUX(10, uart0, rts, periph)

/* gpio10_uart0_cts */
#define GPIO10_UART0_CTS \
	BFLB_PINMUX(10, uart0, cts, periph)

/* gpio10_uart0_tx */
#define GPIO10_UART0_TX \
	BFLB_PINMUX(10, uart0, tx, periph)

/* gpio10_uart0_rx */
#define GPIO10_UART0_RX \
	BFLB_PINMUX(10, uart0, rx, periph)

/* gpio10_uart1_rts */
#define GPIO10_UART1_RTS \
	BFLB_PINMUX(10, uart1, rts, periph)

/* gpio10_uart1_cts */
#define GPIO10_UART1_CTS \
	BFLB_PINMUX(10, uart1, cts, periph)

/* gpio10_uart1_tx */
#define GPIO10_UART1_TX \
	BFLB_PINMUX(10, uart1, tx, periph)

/* gpio10_uart1_rx */
#define GPIO10_UART1_RX \
	BFLB_PINMUX(10, uart1, rx, periph)

/* gpio10_uart2_rts */
#define GPIO10_UART2_RTS \
	BFLB_PINMUX(10, uart2, rts, periph)

/* gpio10_uart2_cts */
#define GPIO10_UART2_CTS \
	BFLB_PINMUX(10, uart2, cts, periph)

/* gpio10_uart2_tx */
#define GPIO10_UART2_TX \
	BFLB_PINMUX(10, uart2, tx, periph)

/* gpio10_uart2_rx */
#define GPIO10_UART2_RX \
	BFLB_PINMUX(10, uart2, rx, periph)

/* gpio10_pwm0_ch2p */
#define GPIO10_PWM0_CH2P \
	BFLB_PINMUX(10, pwm0, ch2p, periph)

/* gpio10_pwm1_ch2p */
#define GPIO10_PWM1_CH2P \
	BFLB_PINMUX(10, pwm1, ch2p, periph)

/* gpio10_spi1_miso */
#define GPIO10_SPI1_MISO \
	BFLB_PINMUX(10, spi1, miso, periph)

/* gpio10_i2c2_scl */
#define GPIO10_I2C2_SCL \
	BFLB_PINMUX(10, i2c2, scl, periph)

/* gpio10_i2c3_scl */
#define GPIO10_I2C3_SCL \
	BFLB_PINMUX(10, i2c3, scl, periph)

/* gpio10_mm_uart_rts */
#define GPIO10_MM_UART_RTS \
	BFLB_PINMUX(10, mm_uart, rts, periph)

/* gpio10_dbi_c_scl */
#define GPIO10_DBI_C_SCL \
	BFLB_PINMUX(10, dbi_c, scl, periph)

/* gpio10_jtag_lp_tms */
#define GPIO10_JTAG_LP_TMS \
	BFLB_PINMUX(10, jtag_lp, tms, periph)

/* gpio10_jtag_m0_tms */
#define GPIO10_JTAG_M0_TMS \
	BFLB_PINMUX(10, jtag_m0, tms, periph)

/* gpio10_jtag_d0_tms */
#define GPIO10_JTAG_D0_TMS \
	BFLB_PINMUX(10, jtag_d0, tms, periph)

/* gpio10_clock_out2_cam_ref */
#define GPIO10_CLOCK_OUT2_CAM_REF \
	BFLB_PINMUX(10, clock_out2, cam_ref, periph)

/* gpio10_clock_out2_i2s_ref */
#define GPIO10_CLOCK_OUT2_I2S_REF \
	BFLB_PINMUX(10, clock_out2, i2s_ref, periph)

/* gpio10_clock_out2_xtal */
#define GPIO10_CLOCK_OUT2_XTAL \
	BFLB_PINMUX(10, clock_out2, xtal, periph)

/* gpio10_clock_out2_wifipll_32m */
#define GPIO10_CLOCK_OUT2_WIFIPLL_32M \
	BFLB_PINMUX(10, clock_out2, wifipll_32m, periph)

/* gpio11_spi0_sclk */
#define GPIO11_SPI0_SCLK \
	BFLB_PINMUX(11, spi0, sclk, periph)

