zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio11_i2s_do */
#define GPIO11_I2S_DO \
	BFLB_PINMUX(11, i2s, do, periph)

/* gpio11_i2c0_sda */
#define GPIO11_I2C0_SDA \
	BFLB_PINMUX(11, i2c0, sda, periph)

/* gpio11_i2c1_sda */
#define GPIO11_I2C1_SDA \
	BFLB_PINMUX(11, i2c1, sda, periph)

/* gpio11_uart0_rts */
#define GPIO11_UART0_RTS \
	BFLB_PINMUX(11, uart0, rts, periph)

/* gpio11_uart0_cts */
#define GPIO11_UART0_CTS \
	BFLB_PINMUX(11, uart0, cts, periph)

/* gpio11_uart0_tx */
#define GPIO11_UART0_TX \
	BFLB_PINMUX(11, uart0, tx, periph)

/* gpio11_uart0_rx */
#define GPIO11_UART0_RX \
	BFLB_PINMUX(11, uart0, rx, periph)

/* gpio11_uart1_rts */
#define GPIO11_UART1_RTS \
	BFLB_PINMUX(11, uart1, rts, periph)

/* gpio11_uart1_cts */
#define GPIO11_UART1_CTS \
	BFLB_PINMUX(11, uart1, cts, periph)

/* gpio11_uart1_tx */
#define GPIO11_UART1_TX \
	BFLB_PINMUX(11, uart1, tx, periph)

/* gpio11_uart1_rx */
#define GPIO11_UART1_RX \
	BFLB_PINMUX(11, uart1, rx, periph)

/* gpio11_uart2_rts */
#define GPIO11_UART2_RTS \
	BFLB_PINMUX(11, uart2, rts, periph)

/* gpio11_uart2_cts */
#define GPIO11_UART2_CTS \
	BFLB_PINMUX(11, uart2, cts, periph)

/* gpio11_uart2_tx */
#define GPIO11_UART2_TX \
	BFLB_PINMUX(11, uart2, tx, periph)

/* gpio11_uart2_rx */
#define GPIO11_UART2_RX \
	BFLB_PINMUX(11, uart2, rx, periph)

/* gpio11_pwm0_ch3p */
#define GPIO11_PWM0_CH3P \
	BFLB_PINMUX(11, pwm0, ch3p, periph)

/* gpio11_pwm1_ch3p */
#define GPIO11_PWM1_CH3P \
	BFLB_PINMUX(11, pwm1, ch3p, periph)

/* gpio11_spi1_sclk */
#define GPIO11_SPI1_SCLK \
	BFLB_PINMUX(11, spi1, sclk, periph)

/* gpio11_i2c2_sda */
#define GPIO11_I2C2_SDA \
	BFLB_PINMUX(11, i2c2, sda, periph)

/* gpio11_i2c3_sda */
#define GPIO11_I2C3_SDA \
	BFLB_PINMUX(11, i2c3, sda, periph)

/* gpio11_mm_uart_cts */
#define GPIO11_MM_UART_CTS \
	BFLB_PINMUX(11, mm_uart, cts, periph)

/* gpio11_dbi_b_cs */
#define GPIO11_DBI_B_CS \
	BFLB_PINMUX(11, dbi_b, cs, periph)

/* gpio11_dbi_c_sda */
#define GPIO11_DBI_C_SDA \
	BFLB_PINMUX(11, dbi_c, sda, periph)

/* gpio11_jtag_lp_tdo */
#define GPIO11_JTAG_LP_TDO \
	BFLB_PINMUX(11, jtag_lp, tdo, periph)

/* gpio11_jtag_m0_tdo */
#define GPIO11_JTAG_M0_TDO \
	BFLB_PINMUX(11, jtag_m0, tdo, periph)

/* gpio11_jtag_d0_tdo */
#define GPIO11_JTAG_D0_TDO \
	BFLB_PINMUX(11, jtag_d0, tdo, periph)

/* gpio11_clock_out3_cam_ref */
#define GPIO11_CLOCK_OUT3_CAM_REF \
	BFLB_PINMUX(11, clock_out3, cam_ref, periph)

/* gpio11_clock_out3_i2s_ref */
#define GPIO11_CLOCK_OUT3_I2S_REF \
	BFLB_PINMUX(11, clock_out3, i2s_ref, periph)

/* gpio11_clock_out3_wifipll_48m */
#define GPIO11_CLOCK_OUT3_WIFIPLL_48M \
	BFLB_PINMUX(11, clock_out3, wifipll_48m, periph)

/* gpio11_adc_ch3 */
#define GPIO11_ADC_CH3 \
	BFLB_PINMUX(11, adc, ch3, analog)

/* gpio11_dac_cha */
#define GPIO11_DAC_CHA \
	BFLB_PINMUX(11, dac, cha, analog)

/* gpio12_spi0_ss */
#define GPIO12_SPI0_SS \
	BFLB_PINMUX(12, spi0, ss, periph)

/* gpio12_i2s_bclk */
#define GPIO12_I2S_BCLK \
	BFLB_PINMUX(12, i2s, bclk, periph)

/* gpio12_i2c0_scl */
#define GPIO12_I2C0_SCL \
	BFLB_PINMUX(12, i2c0, scl, periph)

/* gpio12_i2c1_scl */
#define GPIO12_I2C1_SCL \
	BFLB_PINMUX(12, i2c1, scl, periph)

/* gpio12_uart0_rts */
#define GPIO12_UART0_RTS \
	BFLB_PINMUX(12, uart0, rts, periph)

/* gpio12_uart0_cts */
#define GPIO12_UART0_CTS \
	BFLB_PINMUX(12, uart0, cts, periph)

/* gpio12_uart0_tx */
#define GPIO12_UART0_TX \
	BFLB_PINMUX(12, uart0, tx, periph)

/* gpio12_uart0_rx */
#define GPIO12_UART0_RX \
	BFLB_PINMUX(12, uart0, rx, periph)

/* gpio12_uart1_rts */
#define GPIO12_UART1_RTS \
	BFLB_PINMUX(12, uart1, rts, periph)

/* gpio12_uart1_cts */
#define GPIO12_UART1_CTS \
	BFLB_PINMUX(12, uart1, cts, periph)

/* gpio12_uart1_tx */
#define GPIO12_UART1_TX \
	BFLB_PINMUX(12, uart1, tx, periph)

/* gpio12_uart1_rx */
#define GPIO12_UART1_RX \
	BFLB_PINMUX(12, uart1, rx, periph)

/* gpio12_uart2_rts */
#define GPIO12_UART2_RTS \
	BFLB_PINMUX(12, uart2, rts, periph)

/* gpio12_uart2_cts */
#define GPIO12_UART2_CTS \
	BFLB_PINMUX(12, uart2, cts, periph)

/* gpio12_uart2_tx */
#define GPIO12_UART2_TX \
	BFLB_PINMUX(12, uart2, tx, periph)

/* gpio12_uart2_rx */
#define GPIO12_UART2_RX \
	BFLB_PINMUX(12, uart2, rx, periph)

/* gpio12_pwm0_ch0p */
#define GPIO12_PWM0_CH0P \
	BFLB_PINMUX(12, pwm0, ch0p, periph)

/* gpio12_pwm1_ch0p */
#define GPIO12_PWM1_CH0P \
	BFLB_PINMUX(12, pwm1, ch0p, periph)

/* gpio12_spi1_ss */
#define GPIO12_SPI1_SS \
	BFLB_PINMUX(12, spi1, ss, periph)

/* gpio12_i2c2_scl */
#define GPIO12_I2C2_SCL \
	BFLB_PINMUX(12, i2c2, scl, periph)

/* gpio12_i2c3_scl */
#define GPIO12_I2C3_SCL \
	BFLB_PINMUX(12, i2c3, scl, periph)

/* gpio12_mm_uart_tx */
#define GPIO12_MM_UART_TX \
	BFLB_PINMUX(12, mm_uart, tx, periph)

/* gpio12_dbi_b_dc */
#define GPIO12_DBI_B_DC \
	BFLB_PINMUX(12, dbi_b, dc, periph)

/* gpio12_dbi_c_cs */
#define GPIO12_DBI_C_CS \
	BFLB_PINMUX(12, dbi_c, cs, periph)

/* gpio12_dpi_vs */
#define GPIO12_DPI_VS \
	BFLB_PINMUX(12, dpi, vs, periph)

/* gpio12_jtag_lp_tck */
#define GPIO12_JTAG_LP_TCK \
	BFLB_PINMUX(12, jtag_lp, tck, periph)

/* gpio12_jtag_m0_tck */
#define GPIO12_JTAG_M0_TCK \
	BFLB_PINMUX(12, jtag_m0, tck, periph)

/* gpio12_jtag_d0_tck */
#define GPIO12_JTAG_D0_TCK \
	BFLB_PINMUX(12, jtag_d0, tck, periph)

/* gpio12_clock_out0_cam_ref */
#define GPIO12_CLOCK_OUT0_CAM_REF \
	BFLB_PINMUX(12, clock_out0, cam_ref, periph)

/* gpio12_clock_out0_i2s_ref */
#define GPIO12_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(12, clock_out0, i2s_ref, periph)

/* gpio12_clock_out0_clk_audio_adc */
#define GPIO12_CLOCK_OUT0_CLK_AUDIO_ADC \
	BFLB_PINMUX(12, clock_out0, clk_audio_adc, periph)

/* gpio12_clock_out0_clk_audio_dac */
#define GPIO12_CLOCK_OUT0_CLK_AUDIO_DAC \
	BFLB_PINMUX(12, clock_out0, clk_audio_dac, periph)

/* gpio12_adc_ch6 */
#define GPIO12_ADC_CH6 \
	BFLB_PINMUX(12, adc, ch6, analog)

/* gpio13_spi0_mosi */
#define GPIO13_SPI0_MOSI \
	BFLB_PINMUX(13, spi0, mosi, periph)

/* gpio13_i2s_fs */
#define GPIO13_I2S_FS \
	BFLB_PINMUX(13, i2s, fs, periph)

/* gpio13_i2c0_sda */
#define GPIO13_I2C0_SDA \
	BFLB_PINMUX(13, i2c0, sda, periph)

/* gpio13_i2c1_sda */
#define GPIO13_I2C1_SDA \
	BFLB_PINMUX(13, i2c1, sda, periph)

/* gpio13_uart0_rts */
#define GPIO13_UART0_RTS \
	BFLB_PINMUX(13, uart0, rts, periph)

/* gpio13_uart0_cts */
#define GPIO13_UART0_CTS \
	BFLB_PINMUX(13, uart0, cts, periph)

/* gpio13_uart0_tx */
#define GPIO13_UART0_TX \
	BFLB_PINMUX(13, uart0, tx, periph)

/* gpio13_uart0_rx */
#define GPIO13_UART0_RX \
	BFLB_PINMUX(13, uart0, rx, periph)

/* gpio13_uart1_rts */
#define GPIO13_UART1_RTS \
	BFLB_PINMUX(13, uart1, rts, periph)

/* gpio13_uart1_cts */
#define GPIO13_UART1_CTS \
	BFLB_PINMUX(13, uart1, cts, periph)

/* gpio13_uart1_tx */
#define GPIO13_UART1_TX \
	BFLB_PINMUX(13, uart1, tx, periph)

/* gpio13_uart1_rx */
#define GPIO13_UART1_RX \
	BFLB_PINMUX(13, uart1, rx, periph)

