zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio13_uart2_rts */
#define GPIO13_UART2_RTS \
	BFLB_PINMUX(13, uart2, rts, periph)

/* gpio13_uart2_cts */
#define GPIO13_UART2_CTS \
	BFLB_PINMUX(13, uart2, cts, periph)

/* gpio13_uart2_tx */
#define GPIO13_UART2_TX \
	BFLB_PINMUX(13, uart2, tx, periph)

/* gpio13_uart2_rx */
#define GPIO13_UART2_RX \
	BFLB_PINMUX(13, uart2, rx, periph)

/* gpio13_pwm0_ch1p */
#define GPIO13_PWM0_CH1P \
	BFLB_PINMUX(13, pwm0, ch1p, periph)

/* gpio13_pwm1_ch1p */
#define GPIO13_PWM1_CH1P \
	BFLB_PINMUX(13, pwm1, ch1p, periph)

/* gpio13_spi1_mosi */
#define GPIO13_SPI1_MOSI \
	BFLB_PINMUX(13, spi1, mosi, periph)

/* gpio13_i2c2_sda */
#define GPIO13_I2C2_SDA \
	BFLB_PINMUX(13, i2c2, sda, periph)

/* gpio13_i2c3_sda */
#define GPIO13_I2C3_SDA \
	BFLB_PINMUX(13, i2c3, sda, periph)

/* gpio13_mm_uart_rx */
#define GPIO13_MM_UART_RX \
	BFLB_PINMUX(13, mm_uart, rx, periph)

/* gpio13_dbi_b_wr */
#define GPIO13_DBI_B_WR \
	BFLB_PINMUX(13, dbi_b, wr, periph)

/* gpio13_dbi_c_dcn */
#define GPIO13_DBI_C_DCN \
	BFLB_PINMUX(13, dbi_c, dcn, periph)

/* gpio13_dpi_hs */
#define GPIO13_DPI_HS \
	BFLB_PINMUX(13, dpi, hs, periph)

/* gpio13_jtag_lp_tdi */
#define GPIO13_JTAG_LP_TDI \
	BFLB_PINMUX(13, jtag_lp, tdi, periph)

/* gpio13_jtag_m0_tdi */
#define GPIO13_JTAG_M0_TDI \
	BFLB_PINMUX(13, jtag_m0, tdi, periph)

/* gpio13_jtag_d0_tdi */
#define GPIO13_JTAG_D0_TDI \
	BFLB_PINMUX(13, jtag_d0, tdi, periph)

/* gpio13_clock_out1_cam_ref */
#define GPIO13_CLOCK_OUT1_CAM_REF \
	BFLB_PINMUX(13, clock_out1, cam_ref, periph)

/* gpio13_clock_out1_i2s_ref */
#define GPIO13_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(13, clock_out1, i2s_ref, periph)

/* gpio13_clock_out1_clk_audio_adc */
#define GPIO13_CLOCK_OUT1_CLK_AUDIO_ADC \
	BFLB_PINMUX(13, clock_out1, clk_audio_adc, periph)

/* gpio13_clock_out1_clk_audio_dac */
#define GPIO13_CLOCK_OUT1_CLK_AUDIO_DAC \
	BFLB_PINMUX(13, clock_out1, clk_audio_dac, periph)

/* gpio13_adc_ch7 */
#define GPIO13_ADC_CH7 \
	BFLB_PINMUX(13, adc, ch7, analog)

/* gpio14_spi0_miso */
#define GPIO14_SPI0_MISO \
	BFLB_PINMUX(14, spi0, miso, periph)

/* gpio14_i2s_di */
#define GPIO14_I2S_DI \
	BFLB_PINMUX(14, i2s, di, periph)

/* gpio14_i2c0_scl */
#define GPIO14_I2C0_SCL \
	BFLB_PINMUX(14, i2c0, scl, periph)

/* gpio14_i2c1_scl */
#define GPIO14_I2C1_SCL \
	BFLB_PINMUX(14, i2c1, scl, periph)

/* gpio14_uart0_rts */
#define GPIO14_UART0_RTS \
	BFLB_PINMUX(14, uart0, rts, periph)

/* gpio14_uart0_cts */
#define GPIO14_UART0_CTS \
	BFLB_PINMUX(14, uart0, cts, periph)

/* gpio14_uart0_tx */
#define GPIO14_UART0_TX \
	BFLB_PINMUX(14, uart0, tx, periph)

/* gpio14_uart0_rx */
#define GPIO14_UART0_RX \
	BFLB_PINMUX(14, uart0, rx, periph)

/* gpio14_uart1_rts */
#define GPIO14_UART1_RTS \
	BFLB_PINMUX(14, uart1, rts, periph)

/* gpio14_uart1_cts */
#define GPIO14_UART1_CTS \
	BFLB_PINMUX(14, uart1, cts, periph)

/* gpio14_uart1_tx */
#define GPIO14_UART1_TX \
	BFLB_PINMUX(14, uart1, tx, periph)

/* gpio14_uart1_rx */
#define GPIO14_UART1_RX \
	BFLB_PINMUX(14, uart1, rx, periph)

/* gpio14_uart2_rts */
#define GPIO14_UART2_RTS \
	BFLB_PINMUX(14, uart2, rts, periph)

/* gpio14_uart2_cts */
#define GPIO14_UART2_CTS \
	BFLB_PINMUX(14, uart2, cts, periph)

/* gpio14_uart2_tx */
#define GPIO14_UART2_TX \
	BFLB_PINMUX(14, uart2, tx, periph)

/* gpio14_uart2_rx */
#define GPIO14_UART2_RX \
	BFLB_PINMUX(14, uart2, rx, periph)

/* gpio14_pwm0_ch2p */
#define GPIO14_PWM0_CH2P \
	BFLB_PINMUX(14, pwm0, ch2p, periph)

/* gpio14_pwm1_ch2p */
#define GPIO14_PWM1_CH2P \
	BFLB_PINMUX(14, pwm1, ch2p, periph)

/* gpio14_spi1_miso */
#define GPIO14_SPI1_MISO \
	BFLB_PINMUX(14, spi1, miso, periph)

/* gpio14_i2c2_scl */
#define GPIO14_I2C2_SCL \
	BFLB_PINMUX(14, i2c2, scl, periph)

/* gpio14_i2c3_scl */
#define GPIO14_I2C3_SCL \
	BFLB_PINMUX(14, i2c3, scl, periph)

/* gpio14_mm_uart_rts */
#define GPIO14_MM_UART_RTS \
	BFLB_PINMUX(14, mm_uart, rts, periph)

/* gpio14_dbi_c_scl */
#define GPIO14_DBI_C_SCL \
	BFLB_PINMUX(14, dbi_c, scl, periph)

/* gpio14_jtag_lp_tms */
#define GPIO14_JTAG_LP_TMS \
	BFLB_PINMUX(14, jtag_lp, tms, periph)

/* gpio14_jtag_m0_tms */
#define GPIO14_JTAG_M0_TMS \
	BFLB_PINMUX(14, jtag_m0, tms, periph)

/* gpio14_jtag_d0_tms */
#define GPIO14_JTAG_D0_TMS \
	BFLB_PINMUX(14, jtag_d0, tms, periph)

/* gpio14_clock_out2_cam_ref */
#define GPIO14_CLOCK_OUT2_CAM_REF \
	BFLB_PINMUX(14, clock_out2, cam_ref, periph)

/* gpio14_clock_out2_i2s_ref */
#define GPIO14_CLOCK_OUT2_I2S_REF \
	BFLB_PINMUX(14, clock_out2, i2s_ref, periph)

/* gpio14_clock_out2_xtal */
#define GPIO14_CLOCK_OUT2_XTAL \
	BFLB_PINMUX(14, clock_out2, xtal, periph)

/* gpio14_clock_out2_wifipll_32m */
#define GPIO14_CLOCK_OUT2_WIFIPLL_32M \
	BFLB_PINMUX(14, clock_out2, wifipll_32m, periph)

/* gpio15_spi0_sclk */
#define GPIO15_SPI0_SCLK \
	BFLB_PINMUX(15, spi0, sclk, periph)

/* gpio15_i2s_do */
#define GPIO15_I2S_DO \
	BFLB_PINMUX(15, i2s, do, periph)

/* gpio15_i2c0_sda */
#define GPIO15_I2C0_SDA \
	BFLB_PINMUX(15, i2c0, sda, periph)

/* gpio15_i2c1_sda */
#define GPIO15_I2C1_SDA \
	BFLB_PINMUX(15, i2c1, sda, periph)

/* gpio15_uart0_rts */
#define GPIO15_UART0_RTS \
	BFLB_PINMUX(15, uart0, rts, periph)

/* gpio15_uart0_cts */
#define GPIO15_UART0_CTS \
	BFLB_PINMUX(15, uart0, cts, periph)

/* gpio15_uart0_tx */
#define GPIO15_UART0_TX \
	BFLB_PINMUX(15, uart0, tx, periph)

/* gpio15_uart0_rx */
#define GPIO15_UART0_RX \
	BFLB_PINMUX(15, uart0, rx, periph)

/* gpio15_uart1_rts */
#define GPIO15_UART1_RTS \
	BFLB_PINMUX(15, uart1, rts, periph)

/* gpio15_uart1_cts */
#define GPIO15_UART1_CTS \
	BFLB_PINMUX(15, uart1, cts, periph)

/* gpio15_uart1_tx */
#define GPIO15_UART1_TX \
	BFLB_PINMUX(15, uart1, tx, periph)

/* gpio15_uart1_rx */
#define GPIO15_UART1_RX \
	BFLB_PINMUX(15, uart1, rx, periph)

/* gpio15_uart2_rts */
#define GPIO15_UART2_RTS \
	BFLB_PINMUX(15, uart2, rts, periph)

/* gpio15_uart2_cts */
#define GPIO15_UART2_CTS \
	BFLB_PINMUX(15, uart2, cts, periph)

/* gpio15_uart2_tx */
#define GPIO15_UART2_TX \
	BFLB_PINMUX(15, uart2, tx, periph)

/* gpio15_uart2_rx */
#define GPIO15_UART2_RX \
	BFLB_PINMUX(15, uart2, rx, periph)

/* gpio15_pwm0_ch3p */
#define GPIO15_PWM0_CH3P \
	BFLB_PINMUX(15, pwm0, ch3p, periph)

/* gpio15_pwm1_ch3p */
#define GPIO15_PWM1_CH3P \
	BFLB_PINMUX(15, pwm1, ch3p, periph)

/* gpio15_spi1_sclk */
#define GPIO15_SPI1_SCLK \
	BFLB_PINMUX(15, spi1, sclk, periph)

/* gpio15_i2c2_sda */
#define GPIO15_I2C2_SDA \
	BFLB_PINMUX(15, i2c2, sda, periph)

/* gpio15_i2c3_sda */
#define GPIO15_I2C3_SDA \
	BFLB_PINMUX(15, i2c3, sda, periph)

/* gpio15_mm_uart_cts */
#define GPIO15_MM_UART_CTS \
	BFLB_PINMUX(15, mm_uart, cts, periph)

/* gpio15_dbi_c_sda */
#define GPIO15_DBI_C_SDA \
	BFLB_PINMUX(15, dbi_c, sda, periph)

