zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio15_jtag_lp_tdo */
#define GPIO15_JTAG_LP_TDO \
	BFLB_PINMUX(15, jtag_lp, tdo, periph)

/* gpio15_jtag_m0_tdo */
#define GPIO15_JTAG_M0_TDO \
	BFLB_PINMUX(15, jtag_m0, tdo, periph)

/* gpio15_jtag_d0_tdo */
#define GPIO15_JTAG_D0_TDO \
	BFLB_PINMUX(15, jtag_d0, tdo, periph)

/* gpio15_clock_out3_cam_ref */
#define GPIO15_CLOCK_OUT3_CAM_REF \
	BFLB_PINMUX(15, clock_out3, cam_ref, periph)

/* gpio15_clock_out3_i2s_ref */
#define GPIO15_CLOCK_OUT3_I2S_REF \
	BFLB_PINMUX(15, clock_out3, i2s_ref, periph)

/* gpio15_clock_out3_wifipll_48m */
#define GPIO15_CLOCK_OUT3_WIFIPLL_48M \
	BFLB_PINMUX(15, clock_out3, wifipll_48m, periph)

/* gpio16_spi0_ss */
#define GPIO16_SPI0_SS \
	BFLB_PINMUX(16, spi0, ss, periph)

/* gpio16_i2s_bclk */
#define GPIO16_I2S_BCLK \
	BFLB_PINMUX(16, i2s, bclk, periph)

/* gpio16_pdm_in */
#define GPIO16_PDM_IN \
	BFLB_PINMUX(16, pdm, in, periph)

/* gpio16_i2c0_scl */
#define GPIO16_I2C0_SCL \
	BFLB_PINMUX(16, i2c0, scl, periph)

/* gpio16_i2c1_scl */
#define GPIO16_I2C1_SCL \
	BFLB_PINMUX(16, i2c1, scl, periph)

/* gpio16_uart0_rts */
#define GPIO16_UART0_RTS \
	BFLB_PINMUX(16, uart0, rts, periph)

/* gpio16_uart0_cts */
#define GPIO16_UART0_CTS \
	BFLB_PINMUX(16, uart0, cts, periph)

/* gpio16_uart0_tx */
#define GPIO16_UART0_TX \
	BFLB_PINMUX(16, uart0, tx, periph)

/* gpio16_uart0_rx */
#define GPIO16_UART0_RX \
	BFLB_PINMUX(16, uart0, rx, periph)

/* gpio16_uart1_rts */
#define GPIO16_UART1_RTS \
	BFLB_PINMUX(16, uart1, rts, periph)

/* gpio16_uart1_cts */
#define GPIO16_UART1_CTS \
	BFLB_PINMUX(16, uart1, cts, periph)

/* gpio16_uart1_tx */
#define GPIO16_UART1_TX \
	BFLB_PINMUX(16, uart1, tx, periph)

/* gpio16_uart1_rx */
#define GPIO16_UART1_RX \
	BFLB_PINMUX(16, uart1, rx, periph)

/* gpio16_uart2_rts */
#define GPIO16_UART2_RTS \
	BFLB_PINMUX(16, uart2, rts, periph)

/* gpio16_uart2_cts */
#define GPIO16_UART2_CTS \
	BFLB_PINMUX(16, uart2, cts, periph)

/* gpio16_uart2_tx */
#define GPIO16_UART2_TX \
	BFLB_PINMUX(16, uart2, tx, periph)

/* gpio16_uart2_rx */
#define GPIO16_UART2_RX \
	BFLB_PINMUX(16, uart2, rx, periph)

/* gpio16_cam_hsync */
#define GPIO16_CAM_HSYNC \
	BFLB_PINMUX(16, cam, hsync, periph)

/* gpio16_pwm0_ch0p */
#define GPIO16_PWM0_CH0P \
	BFLB_PINMUX(16, pwm0, ch0p, periph)

/* gpio16_pwm1_ch0p */
#define GPIO16_PWM1_CH0P \
	BFLB_PINMUX(16, pwm1, ch0p, periph)

/* gpio16_spi1_ss */
#define GPIO16_SPI1_SS \
	BFLB_PINMUX(16, spi1, ss, periph)

/* gpio16_i2c2_scl */
#define GPIO16_I2C2_SCL \
	BFLB_PINMUX(16, i2c2, scl, periph)

/* gpio16_i2c3_scl */
#define GPIO16_I2C3_SCL \
	BFLB_PINMUX(16, i2c3, scl, periph)

/* gpio16_mm_uart_tx */
#define GPIO16_MM_UART_TX \
	BFLB_PINMUX(16, mm_uart, tx, periph)

/* gpio16_dbi_b_db0 */
#define GPIO16_DBI_B_DB0 \
	BFLB_PINMUX(16, dbi_b, db0, periph)

/* gpio16_dbi_c_cs */
#define GPIO16_DBI_C_CS \
	BFLB_PINMUX(16, dbi_c, cs, periph)

/* gpio16_dpi_pclk */
#define GPIO16_DPI_PCLK \
	BFLB_PINMUX(16, dpi, pclk, periph)

/* gpio16_jtag_lp_tck */
#define GPIO16_JTAG_LP_TCK \
	BFLB_PINMUX(16, jtag_lp, tck, periph)

/* gpio16_jtag_m0_tck */
#define GPIO16_JTAG_M0_TCK \
	BFLB_PINMUX(16, jtag_m0, tck, periph)

/* gpio16_jtag_d0_tck */
#define GPIO16_JTAG_D0_TCK \
	BFLB_PINMUX(16, jtag_d0, tck, periph)

/* gpio16_clock_out0_cam_ref */
#define GPIO16_CLOCK_OUT0_CAM_REF \
	BFLB_PINMUX(16, clock_out0, cam_ref, periph)

/* gpio16_clock_out0_i2s_ref */
#define GPIO16_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(16, clock_out0, i2s_ref, periph)

/* gpio16_clock_out0_clk_audio_adc */
#define GPIO16_CLOCK_OUT0_CLK_AUDIO_ADC \
	BFLB_PINMUX(16, clock_out0, clk_audio_adc, periph)

/* gpio16_clock_out0_clk_audio_dac */
#define GPIO16_CLOCK_OUT0_CLK_AUDIO_DAC \
	BFLB_PINMUX(16, clock_out0, clk_audio_dac, periph)

/* gpio16_adc_ch8 */
#define GPIO16_ADC_CH8 \
	BFLB_PINMUX(16, adc, ch8, analog)

/* gpio17_spi0_mosi */
#define GPIO17_SPI0_MOSI \
	BFLB_PINMUX(17, spi0, mosi, periph)

/* gpio17_i2s_fs */
#define GPIO17_I2S_FS \
	BFLB_PINMUX(17, i2s, fs, periph)

/* gpio17_pdm_clk */
#define GPIO17_PDM_CLK \
	BFLB_PINMUX(17, pdm, clk, periph)

/* gpio17_i2c0_sda */
#define GPIO17_I2C0_SDA \
	BFLB_PINMUX(17, i2c0, sda, periph)

/* gpio17_i2c1_sda */
#define GPIO17_I2C1_SDA \
	BFLB_PINMUX(17, i2c1, sda, periph)

/* gpio17_uart0_rts */
#define GPIO17_UART0_RTS \
	BFLB_PINMUX(17, uart0, rts, periph)

/* gpio17_uart0_cts */
#define GPIO17_UART0_CTS \
	BFLB_PINMUX(17, uart0, cts, periph)

/* gpio17_uart0_tx */
#define GPIO17_UART0_TX \
	BFLB_PINMUX(17, uart0, tx, periph)

/* gpio17_uart0_rx */
#define GPIO17_UART0_RX \
	BFLB_PINMUX(17, uart0, rx, periph)

/* gpio17_uart1_rts */
#define GPIO17_UART1_RTS \
	BFLB_PINMUX(17, uart1, rts, periph)

/* gpio17_uart1_cts */
#define GPIO17_UART1_CTS \
	BFLB_PINMUX(17, uart1, cts, periph)

/* gpio17_uart1_tx */
#define GPIO17_UART1_TX \
	BFLB_PINMUX(17, uart1, tx, periph)

/* gpio17_uart1_rx */
#define GPIO17_UART1_RX \
	BFLB_PINMUX(17, uart1, rx, periph)

/* gpio17_uart2_rts */
#define GPIO17_UART2_RTS \
	BFLB_PINMUX(17, uart2, rts, periph)

/* gpio17_uart2_cts */
#define GPIO17_UART2_CTS \
	BFLB_PINMUX(17, uart2, cts, periph)

/* gpio17_uart2_tx */
#define GPIO17_UART2_TX \
	BFLB_PINMUX(17, uart2, tx, periph)

/* gpio17_uart2_rx */
#define GPIO17_UART2_RX \
	BFLB_PINMUX(17, uart2, rx, periph)

/* gpio17_cam_vsync */
#define GPIO17_CAM_VSYNC \
	BFLB_PINMUX(17, cam, vsync, periph)

/* gpio17_pwm0_ch1p */
#define GPIO17_PWM0_CH1P \
	BFLB_PINMUX(17, pwm0, ch1p, periph)

/* gpio17_pwm1_ch1p */
#define GPIO17_PWM1_CH1P \
	BFLB_PINMUX(17, pwm1, ch1p, periph)

/* gpio17_spi1_mosi */
#define GPIO17_SPI1_MOSI \
	BFLB_PINMUX(17, spi1, mosi, periph)

/* gpio17_i2c2_sda */
#define GPIO17_I2C2_SDA \
	BFLB_PINMUX(17, i2c2, sda, periph)

/* gpio17_i2c3_sda */
#define GPIO17_I2C3_SDA \
	BFLB_PINMUX(17, i2c3, sda, periph)

/* gpio17_mm_uart_rx */
#define GPIO17_MM_UART_RX \
	BFLB_PINMUX(17, mm_uart, rx, periph)

/* gpio17_dbi_b_db1 */
#define GPIO17_DBI_B_DB1 \
	BFLB_PINMUX(17, dbi_b, db1, periph)

/* gpio17_dbi_c_dcn */
#define GPIO17_DBI_C_DCN \
	BFLB_PINMUX(17, dbi_c, dcn, periph)

