zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio17_dpi_data0 */
#define GPIO17_DPI_DATA0 \
	BFLB_PINMUX(17, dpi, data0, periph)

/* gpio17_jtag_lp_tdi */
#define GPIO17_JTAG_LP_TDI \
	BFLB_PINMUX(17, jtag_lp, tdi, periph)

/* gpio17_jtag_m0_tdi */
#define GPIO17_JTAG_M0_TDI \
	BFLB_PINMUX(17, jtag_m0, tdi, periph)

/* gpio17_jtag_d0_tdi */
#define GPIO17_JTAG_D0_TDI \
	BFLB_PINMUX(17, jtag_d0, tdi, periph)

/* gpio17_clock_out1_cam_ref */
#define GPIO17_CLOCK_OUT1_CAM_REF \
	BFLB_PINMUX(17, clock_out1, cam_ref, periph)

/* gpio17_clock_out1_i2s_ref */
#define GPIO17_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(17, clock_out1, i2s_ref, periph)

/* gpio17_clock_out1_clk_audio_adc */
#define GPIO17_CLOCK_OUT1_CLK_AUDIO_ADC \
	BFLB_PINMUX(17, clock_out1, clk_audio_adc, periph)

/* gpio17_clock_out1_clk_audio_dac */
#define GPIO17_CLOCK_OUT1_CLK_AUDIO_DAC \
	BFLB_PINMUX(17, clock_out1, clk_audio_dac, periph)

/* gpio17_adc_ch0 */
#define GPIO17_ADC_CH0 \
	BFLB_PINMUX(17, adc, ch0, analog)

/* gpio18_spi0_miso */
#define GPIO18_SPI0_MISO \
	BFLB_PINMUX(18, spi0, miso, periph)

/* gpio18_i2s_di */
#define GPIO18_I2S_DI \
	BFLB_PINMUX(18, i2s, di, periph)

/* gpio18_pdm_in */
#define GPIO18_PDM_IN \
	BFLB_PINMUX(18, pdm, in, periph)

/* gpio18_i2c0_scl */
#define GPIO18_I2C0_SCL \
	BFLB_PINMUX(18, i2c0, scl, periph)

/* gpio18_i2c1_scl */
#define GPIO18_I2C1_SCL \
	BFLB_PINMUX(18, i2c1, scl, periph)

/* gpio18_uart0_rts */
#define GPIO18_UART0_RTS \
	BFLB_PINMUX(18, uart0, rts, periph)

/* gpio18_uart0_cts */
#define GPIO18_UART0_CTS \
	BFLB_PINMUX(18, uart0, cts, periph)

/* gpio18_uart0_tx */
#define GPIO18_UART0_TX \
	BFLB_PINMUX(18, uart0, tx, periph)

/* gpio18_uart0_rx */
#define GPIO18_UART0_RX \
	BFLB_PINMUX(18, uart0, rx, periph)

/* gpio18_uart1_rts */
#define GPIO18_UART1_RTS \
	BFLB_PINMUX(18, uart1, rts, periph)

/* gpio18_uart1_cts */
#define GPIO18_UART1_CTS \
	BFLB_PINMUX(18, uart1, cts, periph)

/* gpio18_uart1_tx */
#define GPIO18_UART1_TX \
	BFLB_PINMUX(18, uart1, tx, periph)

/* gpio18_uart1_rx */
#define GPIO18_UART1_RX \
	BFLB_PINMUX(18, uart1, rx, periph)

/* gpio18_uart2_rts */
#define GPIO18_UART2_RTS \
	BFLB_PINMUX(18, uart2, rts, periph)

/* gpio18_uart2_cts */
#define GPIO18_UART2_CTS \
	BFLB_PINMUX(18, uart2, cts, periph)

/* gpio18_uart2_tx */
#define GPIO18_UART2_TX \
	BFLB_PINMUX(18, uart2, tx, periph)

/* gpio18_uart2_rx */
#define GPIO18_UART2_RX \
	BFLB_PINMUX(18, uart2, rx, periph)

/* gpio18_cam_dat8 */
#define GPIO18_CAM_DAT8 \
	BFLB_PINMUX(18, cam, dat8, periph)

/* gpio18_pwm0_ch2p */
#define GPIO18_PWM0_CH2P \
	BFLB_PINMUX(18, pwm0, ch2p, periph)

/* gpio18_pwm1_ch2p */
#define GPIO18_PWM1_CH2P \
	BFLB_PINMUX(18, pwm1, ch2p, periph)

/* gpio18_spi1_miso */
#define GPIO18_SPI1_MISO \
	BFLB_PINMUX(18, spi1, miso, periph)

/* gpio18_i2c2_scl */
#define GPIO18_I2C2_SCL \
	BFLB_PINMUX(18, i2c2, scl, periph)

/* gpio18_i2c3_scl */
#define GPIO18_I2C3_SCL \
	BFLB_PINMUX(18, i2c3, scl, periph)

/* gpio18_mm_uart_rts */
#define GPIO18_MM_UART_RTS \
	BFLB_PINMUX(18, mm_uart, rts, periph)

/* gpio18_dbi_b_db2 */
#define GPIO18_DBI_B_DB2 \
	BFLB_PINMUX(18, dbi_b, db2, periph)

/* gpio18_dbi_c_scl */
#define GPIO18_DBI_C_SCL \
	BFLB_PINMUX(18, dbi_c, scl, periph)

/* gpio18_dpi_data1 */
#define GPIO18_DPI_DATA1 \
	BFLB_PINMUX(18, dpi, data1, periph)

/* gpio18_jtag_lp_tms */
#define GPIO18_JTAG_LP_TMS \
	BFLB_PINMUX(18, jtag_lp, tms, periph)

/* gpio18_jtag_m0_tms */
#define GPIO18_JTAG_M0_TMS \
	BFLB_PINMUX(18, jtag_m0, tms, periph)

/* gpio18_jtag_d0_tms */
#define GPIO18_JTAG_D0_TMS \
	BFLB_PINMUX(18, jtag_d0, tms, periph)

/* gpio18_clock_out2_cam_ref */
#define GPIO18_CLOCK_OUT2_CAM_REF \
	BFLB_PINMUX(18, clock_out2, cam_ref, periph)

/* gpio18_clock_out2_i2s_ref */
#define GPIO18_CLOCK_OUT2_I2S_REF \
	BFLB_PINMUX(18, clock_out2, i2s_ref, periph)

/* gpio18_clock_out2_xtal */
#define GPIO18_CLOCK_OUT2_XTAL \
	BFLB_PINMUX(18, clock_out2, xtal, periph)

/* gpio18_clock_out2_wifipll_32m */
#define GPIO18_CLOCK_OUT2_WIFIPLL_32M \
	BFLB_PINMUX(18, clock_out2, wifipll_32m, periph)

/* gpio18_adc_ch9 */
#define GPIO18_ADC_CH9 \
	BFLB_PINMUX(18, adc, ch9, analog)

/* gpio19_spi0_sclk */
#define GPIO19_SPI0_SCLK \
	BFLB_PINMUX(19, spi0, sclk, periph)

/* gpio19_i2s_do */
#define GPIO19_I2S_DO \
	BFLB_PINMUX(19, i2s, do, periph)

/* gpio19_pdm_in */
#define GPIO19_PDM_IN \
	BFLB_PINMUX(19, pdm, in, periph)

/* gpio19_i2c0_sda */
#define GPIO19_I2C0_SDA \
	BFLB_PINMUX(19, i2c0, sda, periph)

/* gpio19_i2c1_sda */
#define GPIO19_I2C1_SDA \
	BFLB_PINMUX(19, i2c1, sda, periph)

/* gpio19_uart0_rts */
#define GPIO19_UART0_RTS \
	BFLB_PINMUX(19, uart0, rts, periph)

/* gpio19_uart0_cts */
#define GPIO19_UART0_CTS \
	BFLB_PINMUX(19, uart0, cts, periph)

/* gpio19_uart0_tx */
#define GPIO19_UART0_TX \
	BFLB_PINMUX(19, uart0, tx, periph)

/* gpio19_uart0_rx */
#define GPIO19_UART0_RX \
	BFLB_PINMUX(19, uart0, rx, periph)

/* gpio19_uart1_rts */
#define GPIO19_UART1_RTS \
	BFLB_PINMUX(19, uart1, rts, periph)

/* gpio19_uart1_cts */
#define GPIO19_UART1_CTS \
	BFLB_PINMUX(19, uart1, cts, periph)

/* gpio19_uart1_tx */
#define GPIO19_UART1_TX \
	BFLB_PINMUX(19, uart1, tx, periph)

/* gpio19_uart1_rx */
#define GPIO19_UART1_RX \
	BFLB_PINMUX(19, uart1, rx, periph)

/* gpio19_uart2_rts */
#define GPIO19_UART2_RTS \
	BFLB_PINMUX(19, uart2, rts, periph)

/* gpio19_uart2_cts */
#define GPIO19_UART2_CTS \
	BFLB_PINMUX(19, uart2, cts, periph)

/* gpio19_uart2_tx */
#define GPIO19_UART2_TX \
	BFLB_PINMUX(19, uart2, tx, periph)

/* gpio19_uart2_rx */
#define GPIO19_UART2_RX \
	BFLB_PINMUX(19, uart2, rx, periph)

/* gpio19_cam_dat9 */
#define GPIO19_CAM_DAT9 \
	BFLB_PINMUX(19, cam, dat9, periph)

/* gpio19_pwm0_ch3p */
#define GPIO19_PWM0_CH3P \
	BFLB_PINMUX(19, pwm0, ch3p, periph)

/* gpio19_pwm1_ch3p */
#define GPIO19_PWM1_CH3P \
	BFLB_PINMUX(19, pwm1, ch3p, periph)

/* gpio19_spi1_sclk */
#define GPIO19_SPI1_SCLK \
	BFLB_PINMUX(19, spi1, sclk, periph)

/* gpio19_i2c2_sda */
#define GPIO19_I2C2_SDA \
	BFLB_PINMUX(19, i2c2, sda, periph)

/* gpio19_i2c3_sda */
#define GPIO19_I2C3_SDA \
	BFLB_PINMUX(19, i2c3, sda, periph)

/* gpio19_mm_uart_cts */
#define GPIO19_MM_UART_CTS \
	BFLB_PINMUX(19, mm_uart, cts, periph)

/* gpio19_dbi_b_db3 */
#define GPIO19_DBI_B_DB3 \
	BFLB_PINMUX(19, dbi_b, db3, periph)

/* gpio19_dbi_c_sda */
#define GPIO19_DBI_C_SDA \
	BFLB_PINMUX(19, dbi_c, sda, periph)

/* gpio19_dpi_data2 */
#define GPIO19_DPI_DATA2 \
	BFLB_PINMUX(19, dpi, data2, periph)

