zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio19_jtag_lp_tdo */
#define GPIO19_JTAG_LP_TDO \
	BFLB_PINMUX(19, jtag_lp, tdo, periph)

/* gpio19_jtag_m0_tdo */
#define GPIO19_JTAG_M0_TDO \
	BFLB_PINMUX(19, jtag_m0, tdo, periph)

/* gpio19_jtag_d0_tdo */
#define GPIO19_JTAG_D0_TDO \
	BFLB_PINMUX(19, jtag_d0, tdo, periph)

/* gpio19_clock_out3_cam_ref */
#define GPIO19_CLOCK_OUT3_CAM_REF \
	BFLB_PINMUX(19, clock_out3, cam_ref, periph)

/* gpio19_clock_out3_i2s_ref */
#define GPIO19_CLOCK_OUT3_I2S_REF \
	BFLB_PINMUX(19, clock_out3, i2s_ref, periph)

/* gpio19_clock_out3_wifipll_48m */
#define GPIO19_CLOCK_OUT3_WIFIPLL_48M \
	BFLB_PINMUX(19, clock_out3, wifipll_48m, periph)

/* gpio19_adc_ch10 */
#define GPIO19_ADC_CH10 \
	BFLB_PINMUX(19, adc, ch10, analog)

/* gpio20_spi0_ss */
#define GPIO20_SPI0_SS \
	BFLB_PINMUX(20, spi0, ss, periph)

/* gpio20_i2s_bclk */
#define GPIO20_I2S_BCLK \
	BFLB_PINMUX(20, i2s, bclk, periph)

/* gpio20_pdm_clk */
#define GPIO20_PDM_CLK \
	BFLB_PINMUX(20, pdm, clk, periph)

/* gpio20_i2c0_scl */
#define GPIO20_I2C0_SCL \
	BFLB_PINMUX(20, i2c0, scl, periph)

/* gpio20_i2c1_scl */
#define GPIO20_I2C1_SCL \
	BFLB_PINMUX(20, i2c1, scl, periph)

/* gpio20_uart0_rts */
#define GPIO20_UART0_RTS \
	BFLB_PINMUX(20, uart0, rts, periph)

/* gpio20_uart0_cts */
#define GPIO20_UART0_CTS \
	BFLB_PINMUX(20, uart0, cts, periph)

/* gpio20_uart0_tx */
#define GPIO20_UART0_TX \
	BFLB_PINMUX(20, uart0, tx, periph)

/* gpio20_uart0_rx */
#define GPIO20_UART0_RX \
	BFLB_PINMUX(20, uart0, rx, periph)

/* gpio20_uart1_rts */
#define GPIO20_UART1_RTS \
	BFLB_PINMUX(20, uart1, rts, periph)

/* gpio20_uart1_cts */
#define GPIO20_UART1_CTS \
	BFLB_PINMUX(20, uart1, cts, periph)

/* gpio20_uart1_tx */
#define GPIO20_UART1_TX \
	BFLB_PINMUX(20, uart1, tx, periph)

/* gpio20_uart1_rx */
#define GPIO20_UART1_RX \
	BFLB_PINMUX(20, uart1, rx, periph)

/* gpio20_uart2_rts */
#define GPIO20_UART2_RTS \
	BFLB_PINMUX(20, uart2, rts, periph)

/* gpio20_uart2_cts */
#define GPIO20_UART2_CTS \
	BFLB_PINMUX(20, uart2, cts, periph)

/* gpio20_uart2_tx */
#define GPIO20_UART2_TX \
	BFLB_PINMUX(20, uart2, tx, periph)

/* gpio20_uart2_rx */
#define GPIO20_UART2_RX \
	BFLB_PINMUX(20, uart2, rx, periph)

/* gpio20_cam_dat10 */
#define GPIO20_CAM_DAT10 \
	BFLB_PINMUX(20, cam, dat10, periph)

/* gpio20_pwm0_ch0p */
#define GPIO20_PWM0_CH0P \
	BFLB_PINMUX(20, pwm0, ch0p, periph)

/* gpio20_pwm1_ch0p */
#define GPIO20_PWM1_CH0P \
	BFLB_PINMUX(20, pwm1, ch0p, periph)

/* gpio20_spi1_ss */
#define GPIO20_SPI1_SS \
	BFLB_PINMUX(20, spi1, ss, periph)

/* gpio20_i2c2_scl */
#define GPIO20_I2C2_SCL \
	BFLB_PINMUX(20, i2c2, scl, periph)

/* gpio20_i2c3_scl */
#define GPIO20_I2C3_SCL \
	BFLB_PINMUX(20, i2c3, scl, periph)

/* gpio20_mm_uart_tx */
#define GPIO20_MM_UART_TX \
	BFLB_PINMUX(20, mm_uart, tx, periph)

/* gpio20_dbi_b_db4 */
#define GPIO20_DBI_B_DB4 \
	BFLB_PINMUX(20, dbi_b, db4, periph)

/* gpio20_dbi_c_cs */
#define GPIO20_DBI_C_CS \
	BFLB_PINMUX(20, dbi_c, cs, periph)

/* gpio20_dpi_data3 */
#define GPIO20_DPI_DATA3 \
	BFLB_PINMUX(20, dpi, data3, periph)

/* gpio20_jtag_lp_tck */
#define GPIO20_JTAG_LP_TCK \
	BFLB_PINMUX(20, jtag_lp, tck, periph)

/* gpio20_jtag_m0_tck */
#define GPIO20_JTAG_M0_TCK \
	BFLB_PINMUX(20, jtag_m0, tck, periph)

/* gpio20_jtag_d0_tck */
#define GPIO20_JTAG_D0_TCK \
	BFLB_PINMUX(20, jtag_d0, tck, periph)

/* gpio20_clock_out0_cam_ref */
#define GPIO20_CLOCK_OUT0_CAM_REF \
	BFLB_PINMUX(20, clock_out0, cam_ref, periph)

/* gpio20_clock_out0_i2s_ref */
#define GPIO20_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(20, clock_out0, i2s_ref, periph)

/* gpio20_clock_out0_clk_audio_adc */
#define GPIO20_CLOCK_OUT0_CLK_AUDIO_ADC \
	BFLB_PINMUX(20, clock_out0, clk_audio_adc, periph)

/* gpio20_clock_out0_clk_audio_dac */
#define GPIO20_CLOCK_OUT0_CLK_AUDIO_DAC \
	BFLB_PINMUX(20, clock_out0, clk_audio_dac, periph)

/* gpio21_spi0_mosi */
#define GPIO21_SPI0_MOSI \
	BFLB_PINMUX(21, spi0, mosi, periph)

/* gpio21_i2s_fs */
#define GPIO21_I2S_FS \
	BFLB_PINMUX(21, i2s, fs, periph)

/* gpio21_pdm_in */
#define GPIO21_PDM_IN \
	BFLB_PINMUX(21, pdm, in, periph)

/* gpio21_i2c0_sda */
#define GPIO21_I2C0_SDA \
	BFLB_PINMUX(21, i2c0, sda, periph)

/* gpio21_i2c1_sda */
#define GPIO21_I2C1_SDA \
	BFLB_PINMUX(21, i2c1, sda, periph)

/* gpio21_uart0_rts */
#define GPIO21_UART0_RTS \
	BFLB_PINMUX(21, uart0, rts, periph)

/* gpio21_uart0_cts */
#define GPIO21_UART0_CTS \
	BFLB_PINMUX(21, uart0, cts, periph)

/* gpio21_uart0_tx */
#define GPIO21_UART0_TX \
	BFLB_PINMUX(21, uart0, tx, periph)

/* gpio21_uart0_rx */
#define GPIO21_UART0_RX \
	BFLB_PINMUX(21, uart0, rx, periph)

/* gpio21_uart1_rts */
#define GPIO21_UART1_RTS \
	BFLB_PINMUX(21, uart1, rts, periph)

/* gpio21_uart1_cts */
#define GPIO21_UART1_CTS \
	BFLB_PINMUX(21, uart1, cts, periph)

/* gpio21_uart1_tx */
#define GPIO21_UART1_TX \
	BFLB_PINMUX(21, uart1, tx, periph)

/* gpio21_uart1_rx */
#define GPIO21_UART1_RX \
	BFLB_PINMUX(21, uart1, rx, periph)

/* gpio21_uart2_rts */
#define GPIO21_UART2_RTS \
	BFLB_PINMUX(21, uart2, rts, periph)

/* gpio21_uart2_cts */
#define GPIO21_UART2_CTS \
	BFLB_PINMUX(21, uart2, cts, periph)

/* gpio21_uart2_tx */
#define GPIO21_UART2_TX \
	BFLB_PINMUX(21, uart2, tx, periph)

/* gpio21_uart2_rx */
#define GPIO21_UART2_RX \
	BFLB_PINMUX(21, uart2, rx, periph)

/* gpio21_cam_dat11 */
#define GPIO21_CAM_DAT11 \
	BFLB_PINMUX(21, cam, dat11, periph)

/* gpio21_pwm0_ch1p */
#define GPIO21_PWM0_CH1P \
	BFLB_PINMUX(21, pwm0, ch1p, periph)

/* gpio21_pwm1_ch1p */
#define GPIO21_PWM1_CH1P \
	BFLB_PINMUX(21, pwm1, ch1p, periph)

/* gpio21_spi1_mosi */
#define GPIO21_SPI1_MOSI \
	BFLB_PINMUX(21, spi1, mosi, periph)

/* gpio21_i2c2_sda */
#define GPIO21_I2C2_SDA \
	BFLB_PINMUX(21, i2c2, sda, periph)

/* gpio21_i2c3_sda */
#define GPIO21_I2C3_SDA \
	BFLB_PINMUX(21, i2c3, sda, periph)

/* gpio21_mm_uart_rx */
#define GPIO21_MM_UART_RX \
	BFLB_PINMUX(21, mm_uart, rx, periph)

/* gpio21_dbi_b_db5 */
#define GPIO21_DBI_B_DB5 \
	BFLB_PINMUX(21, dbi_b, db5, periph)

/* gpio21_dbi_c_dcn */
#define GPIO21_DBI_C_DCN \
	BFLB_PINMUX(21, dbi_c, dcn, periph)

