zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio21_dpi_data4 */
#define GPIO21_DPI_DATA4 \
	BFLB_PINMUX(21, dpi, data4, periph)

/* gpio21_jtag_lp_tdi */
#define GPIO21_JTAG_LP_TDI \
	BFLB_PINMUX(21, jtag_lp, tdi, periph)

/* gpio21_jtag_m0_tdi */
#define GPIO21_JTAG_M0_TDI \
	BFLB_PINMUX(21, jtag_m0, tdi, periph)

/* gpio21_jtag_d0_tdi */
#define GPIO21_JTAG_D0_TDI \
	BFLB_PINMUX(21, jtag_d0, tdi, periph)

/* gpio21_clock_out1_cam_ref */
#define GPIO21_CLOCK_OUT1_CAM_REF \
	BFLB_PINMUX(21, clock_out1, cam_ref, periph)

/* gpio21_clock_out1_i2s_ref */
#define GPIO21_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(21, clock_out1, i2s_ref, periph)

/* gpio21_clock_out1_clk_audio_adc */
#define GPIO21_CLOCK_OUT1_CLK_AUDIO_ADC \
	BFLB_PINMUX(21, clock_out1, clk_audio_adc, periph)

/* gpio21_clock_out1_clk_audio_dac */
#define GPIO21_CLOCK_OUT1_CLK_AUDIO_DAC \
	BFLB_PINMUX(21, clock_out1, clk_audio_dac, periph)

/* gpio22_spi0_miso */
#define GPIO22_SPI0_MISO \
	BFLB_PINMUX(22, spi0, miso, periph)

/* gpio22_i2s_di */
#define GPIO22_I2S_DI \
	BFLB_PINMUX(22, i2s, di, periph)

/* gpio22_i2c0_scl */
#define GPIO22_I2C0_SCL \
	BFLB_PINMUX(22, i2c0, scl, periph)

/* gpio22_i2c1_scl */
#define GPIO22_I2C1_SCL \
	BFLB_PINMUX(22, i2c1, scl, periph)

/* gpio22_uart0_rts */
#define GPIO22_UART0_RTS \
	BFLB_PINMUX(22, uart0, rts, periph)

/* gpio22_uart0_cts */
#define GPIO22_UART0_CTS \
	BFLB_PINMUX(22, uart0, cts, periph)

/* gpio22_uart0_tx */
#define GPIO22_UART0_TX \
	BFLB_PINMUX(22, uart0, tx, periph)

/* gpio22_uart0_rx */
#define GPIO22_UART0_RX \
	BFLB_PINMUX(22, uart0, rx, periph)

/* gpio22_uart1_rts */
#define GPIO22_UART1_RTS \
	BFLB_PINMUX(22, uart1, rts, periph)

/* gpio22_uart1_cts */
#define GPIO22_UART1_CTS \
	BFLB_PINMUX(22, uart1, cts, periph)

/* gpio22_uart1_tx */
#define GPIO22_UART1_TX \
	BFLB_PINMUX(22, uart1, tx, periph)

/* gpio22_uart1_rx */
#define GPIO22_UART1_RX \
	BFLB_PINMUX(22, uart1, rx, periph)

/* gpio22_uart2_rts */
#define GPIO22_UART2_RTS \
	BFLB_PINMUX(22, uart2, rts, periph)

/* gpio22_uart2_cts */
#define GPIO22_UART2_CTS \
	BFLB_PINMUX(22, uart2, cts, periph)

/* gpio22_uart2_tx */
#define GPIO22_UART2_TX \
	BFLB_PINMUX(22, uart2, tx, periph)

/* gpio22_uart2_rx */
#define GPIO22_UART2_RX \
	BFLB_PINMUX(22, uart2, rx, periph)

/* gpio22_cam_hsync */
#define GPIO22_CAM_HSYNC \
	BFLB_PINMUX(22, cam, hsync, periph)

/* gpio22_pwm0_ch2p */
#define GPIO22_PWM0_CH2P \
	BFLB_PINMUX(22, pwm0, ch2p, periph)

/* gpio22_pwm1_ch2p */
#define GPIO22_PWM1_CH2P \
	BFLB_PINMUX(22, pwm1, ch2p, periph)

/* gpio22_spi1_miso */
#define GPIO22_SPI1_MISO \
	BFLB_PINMUX(22, spi1, miso, periph)

/* gpio22_i2c2_scl */
#define GPIO22_I2C2_SCL \
	BFLB_PINMUX(22, i2c2, scl, periph)

/* gpio22_i2c3_scl */
#define GPIO22_I2C3_SCL \
	BFLB_PINMUX(22, i2c3, scl, periph)

/* gpio22_mm_uart_rts */
#define GPIO22_MM_UART_RTS \
	BFLB_PINMUX(22, mm_uart, rts, periph)

/* gpio22_dbi_b_db6 */
#define GPIO22_DBI_B_DB6 \
	BFLB_PINMUX(22, dbi_b, db6, periph)

/* gpio22_dbi_c_scl */
#define GPIO22_DBI_C_SCL \
	BFLB_PINMUX(22, dbi_c, scl, periph)

/* gpio22_dpi_data5 */
#define GPIO22_DPI_DATA5 \
	BFLB_PINMUX(22, dpi, data5, periph)

/* gpio22_jtag_lp_tms */
#define GPIO22_JTAG_LP_TMS \
	BFLB_PINMUX(22, jtag_lp, tms, periph)

/* gpio22_jtag_m0_tms */
#define GPIO22_JTAG_M0_TMS \
	BFLB_PINMUX(22, jtag_m0, tms, periph)

/* gpio22_jtag_d0_tms */
#define GPIO22_JTAG_D0_TMS \
	BFLB_PINMUX(22, jtag_d0, tms, periph)

/* gpio22_clock_out2_cam_ref */
#define GPIO22_CLOCK_OUT2_CAM_REF \
	BFLB_PINMUX(22, clock_out2, cam_ref, periph)

/* gpio22_clock_out2_i2s_ref */
#define GPIO22_CLOCK_OUT2_I2S_REF \
	BFLB_PINMUX(22, clock_out2, i2s_ref, periph)

/* gpio22_clock_out2_xtal */
#define GPIO22_CLOCK_OUT2_XTAL \
	BFLB_PINMUX(22, clock_out2, xtal, periph)

/* gpio22_clock_out2_wifipll_32m */
#define GPIO22_CLOCK_OUT2_WIFIPLL_32M \
	BFLB_PINMUX(22, clock_out2, wifipll_32m, periph)

/* gpio23_spi0_sclk */
#define GPIO23_SPI0_SCLK \
	BFLB_PINMUX(23, spi0, sclk, periph)

/* gpio23_i2s_do */
#define GPIO23_I2S_DO \
	BFLB_PINMUX(23, i2s, do, periph)

/* gpio23_i2c0_sda */
#define GPIO23_I2C0_SDA \
	BFLB_PINMUX(23, i2c0, sda, periph)

/* gpio23_i2c1_sda */
#define GPIO23_I2C1_SDA \
	BFLB_PINMUX(23, i2c1, sda, periph)

/* gpio23_uart0_rts */
#define GPIO23_UART0_RTS \
	BFLB_PINMUX(23, uart0, rts, periph)

/* gpio23_uart0_cts */
#define GPIO23_UART0_CTS \
	BFLB_PINMUX(23, uart0, cts, periph)

/* gpio23_uart0_tx */
#define GPIO23_UART0_TX \
	BFLB_PINMUX(23, uart0, tx, periph)

/* gpio23_uart0_rx */
#define GPIO23_UART0_RX \
	BFLB_PINMUX(23, uart0, rx, periph)

/* gpio23_uart1_rts */
#define GPIO23_UART1_RTS \
	BFLB_PINMUX(23, uart1, rts, periph)

/* gpio23_uart1_cts */
#define GPIO23_UART1_CTS \
	BFLB_PINMUX(23, uart1, cts, periph)

/* gpio23_uart1_tx */
#define GPIO23_UART1_TX \
	BFLB_PINMUX(23, uart1, tx, periph)

/* gpio23_uart1_rx */
#define GPIO23_UART1_RX \
	BFLB_PINMUX(23, uart1, rx, periph)

/* gpio23_uart2_rts */
#define GPIO23_UART2_RTS \
	BFLB_PINMUX(23, uart2, rts, periph)

/* gpio23_uart2_cts */
#define GPIO23_UART2_CTS \
	BFLB_PINMUX(23, uart2, cts, periph)

/* gpio23_uart2_tx */
#define GPIO23_UART2_TX \
	BFLB_PINMUX(23, uart2, tx, periph)

/* gpio23_uart2_rx */
#define GPIO23_UART2_RX \
	BFLB_PINMUX(23, uart2, rx, periph)

/* gpio23_cam_vsync */
#define GPIO23_CAM_VSYNC \
	BFLB_PINMUX(23, cam, vsync, periph)

/* gpio23_pwm0_ch3p */
#define GPIO23_PWM0_CH3P \
	BFLB_PINMUX(23, pwm0, ch3p, periph)

/* gpio23_pwm1_ch3p */
#define GPIO23_PWM1_CH3P \
	BFLB_PINMUX(23, pwm1, ch3p, periph)

/* gpio23_spi1_sclk */
#define GPIO23_SPI1_SCLK \
	BFLB_PINMUX(23, spi1, sclk, periph)

/* gpio23_i2c2_sda */
#define GPIO23_I2C2_SDA \
	BFLB_PINMUX(23, i2c2, sda, periph)

/* gpio23_i2c3_sda */
#define GPIO23_I2C3_SDA \
	BFLB_PINMUX(23, i2c3, sda, periph)

/* gpio23_mm_uart_cts */
#define GPIO23_MM_UART_CTS \
	BFLB_PINMUX(23, mm_uart, cts, periph)

/* gpio23_dbi_b_db7 */
#define GPIO23_DBI_B_DB7 \
	BFLB_PINMUX(23, dbi_b, db7, periph)

/* gpio23_dbi_c_sda */
#define GPIO23_DBI_C_SDA \
	BFLB_PINMUX(23, dbi_c, sda, periph)

/* gpio23_dpi_data6 */
#define GPIO23_DPI_DATA6 \
	BFLB_PINMUX(23, dpi, data6, periph)

