zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio23_jtag_lp_tdo */
#define GPIO23_JTAG_LP_TDO \
	BFLB_PINMUX(23, jtag_lp, tdo, periph)

/* gpio23_jtag_m0_tdo */
#define GPIO23_JTAG_M0_TDO \
	BFLB_PINMUX(23, jtag_m0, tdo, periph)

/* gpio23_jtag_d0_tdo */
#define GPIO23_JTAG_D0_TDO \
	BFLB_PINMUX(23, jtag_d0, tdo, periph)

/* gpio23_clock_out3_cam_ref */
#define GPIO23_CLOCK_OUT3_CAM_REF \
	BFLB_PINMUX(23, clock_out3, cam_ref, periph)

/* gpio23_clock_out3_i2s_ref */
#define GPIO23_CLOCK_OUT3_I2S_REF \
	BFLB_PINMUX(23, clock_out3, i2s_ref, periph)

/* gpio23_clock_out3_wifipll_48m */
#define GPIO23_CLOCK_OUT3_WIFIPLL_48M \
	BFLB_PINMUX(23, clock_out3, wifipll_48m, periph)

/* gpio24_spi0_ss */
#define GPIO24_SPI0_SS \
	BFLB_PINMUX(24, spi0, ss, periph)

/* gpio24_i2s_bclk */
#define GPIO24_I2S_BCLK \
	BFLB_PINMUX(24, i2s, bclk, periph)

/* gpio24_i2c0_scl */
#define GPIO24_I2C0_SCL \
	BFLB_PINMUX(24, i2c0, scl, periph)

/* gpio24_i2c1_scl */
#define GPIO24_I2C1_SCL \
	BFLB_PINMUX(24, i2c1, scl, periph)

/* gpio24_uart0_rts */
#define GPIO24_UART0_RTS \
	BFLB_PINMUX(24, uart0, rts, periph)

/* gpio24_uart0_cts */
#define GPIO24_UART0_CTS \
	BFLB_PINMUX(24, uart0, cts, periph)

/* gpio24_uart0_tx */
#define GPIO24_UART0_TX \
	BFLB_PINMUX(24, uart0, tx, periph)

/* gpio24_uart0_rx */
#define GPIO24_UART0_RX \
	BFLB_PINMUX(24, uart0, rx, periph)

/* gpio24_uart1_rts */
#define GPIO24_UART1_RTS \
	BFLB_PINMUX(24, uart1, rts, periph)

/* gpio24_uart1_cts */
#define GPIO24_UART1_CTS \
	BFLB_PINMUX(24, uart1, cts, periph)

/* gpio24_uart1_tx */
#define GPIO24_UART1_TX \
	BFLB_PINMUX(24, uart1, tx, periph)

/* gpio24_uart1_rx */
#define GPIO24_UART1_RX \
	BFLB_PINMUX(24, uart1, rx, periph)

/* gpio24_uart2_rts */
#define GPIO24_UART2_RTS \
	BFLB_PINMUX(24, uart2, rts, periph)

/* gpio24_uart2_cts */
#define GPIO24_UART2_CTS \
	BFLB_PINMUX(24, uart2, cts, periph)

/* gpio24_uart2_tx */
#define GPIO24_UART2_TX \
	BFLB_PINMUX(24, uart2, tx, periph)

/* gpio24_uart2_rx */
#define GPIO24_UART2_RX \
	BFLB_PINMUX(24, uart2, rx, periph)

/* gpio24_emac_ref_clk */
#define GPIO24_EMAC_REF_CLK \
	BFLB_PINMUX(24, emac, ref_clk, periph)

/* gpio24_cam_clk */
#define GPIO24_CAM_CLK \
	BFLB_PINMUX(24, cam, clk, periph)

/* gpio24_pwm0_ch0p */
#define GPIO24_PWM0_CH0P \
	BFLB_PINMUX(24, pwm0, ch0p, periph)

/* gpio24_pwm1_ch0p */
#define GPIO24_PWM1_CH0P \
	BFLB_PINMUX(24, pwm1, ch0p, periph)

/* gpio24_spi1_ss */
#define GPIO24_SPI1_SS \
	BFLB_PINMUX(24, spi1, ss, periph)

/* gpio24_i2c2_scl */
#define GPIO24_I2C2_SCL \
	BFLB_PINMUX(24, i2c2, scl, periph)

/* gpio24_i2c3_scl */
#define GPIO24_I2C3_SCL \
	BFLB_PINMUX(24, i2c3, scl, periph)

/* gpio24_mm_uart_tx */
#define GPIO24_MM_UART_TX \
	BFLB_PINMUX(24, mm_uart, tx, periph)

/* gpio24_dbi_c_cs */
#define GPIO24_DBI_C_CS \
	BFLB_PINMUX(24, dbi_c, cs, periph)

/* gpio24_dpi_data7 */
#define GPIO24_DPI_DATA7 \
	BFLB_PINMUX(24, dpi, data7, periph)

/* gpio24_jtag_lp_tck */
#define GPIO24_JTAG_LP_TCK \
	BFLB_PINMUX(24, jtag_lp, tck, periph)

/* gpio24_jtag_m0_tck */
#define GPIO24_JTAG_M0_TCK \
	BFLB_PINMUX(24, jtag_m0, tck, periph)

/* gpio24_jtag_d0_tck */
#define GPIO24_JTAG_D0_TCK \
	BFLB_PINMUX(24, jtag_d0, tck, periph)

/* gpio24_clock_out0_cam_ref */
#define GPIO24_CLOCK_OUT0_CAM_REF \
	BFLB_PINMUX(24, clock_out0, cam_ref, periph)

/* gpio24_clock_out0_i2s_ref */
#define GPIO24_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(24, clock_out0, i2s_ref, periph)

/* gpio24_clock_out0_clk_audio_adc */
#define GPIO24_CLOCK_OUT0_CLK_AUDIO_ADC \
	BFLB_PINMUX(24, clock_out0, clk_audio_adc, periph)

/* gpio24_clock_out0_clk_audio_dac */
#define GPIO24_CLOCK_OUT0_CLK_AUDIO_DAC \
	BFLB_PINMUX(24, clock_out0, clk_audio_dac, periph)

/* gpio25_spi0_mosi */
#define GPIO25_SPI0_MOSI \
	BFLB_PINMUX(25, spi0, mosi, periph)

/* gpio25_i2s_fs */
#define GPIO25_I2S_FS \
	BFLB_PINMUX(25, i2s, fs, periph)

/* gpio25_pdm_in */
#define GPIO25_PDM_IN \
	BFLB_PINMUX(25, pdm, in, periph)

/* gpio25_i2c0_sda */
#define GPIO25_I2C0_SDA \
	BFLB_PINMUX(25, i2c0, sda, periph)

/* gpio25_i2c1_sda */
#define GPIO25_I2C1_SDA \
	BFLB_PINMUX(25, i2c1, sda, periph)

/* gpio25_uart0_rts */
#define GPIO25_UART0_RTS \
	BFLB_PINMUX(25, uart0, rts, periph)

/* gpio25_uart0_cts */
#define GPIO25_UART0_CTS \
	BFLB_PINMUX(25, uart0, cts, periph)

/* gpio25_uart0_tx */
#define GPIO25_UART0_TX \
	BFLB_PINMUX(25, uart0, tx, periph)

/* gpio25_uart0_rx */
#define GPIO25_UART0_RX \
	BFLB_PINMUX(25, uart0, rx, periph)

/* gpio25_uart1_rts */
#define GPIO25_UART1_RTS \
	BFLB_PINMUX(25, uart1, rts, periph)

/* gpio25_uart1_cts */
#define GPIO25_UART1_CTS \
	BFLB_PINMUX(25, uart1, cts, periph)

/* gpio25_uart1_tx */
#define GPIO25_UART1_TX \
	BFLB_PINMUX(25, uart1, tx, periph)

/* gpio25_uart1_rx */
#define GPIO25_UART1_RX \
	BFLB_PINMUX(25, uart1, rx, periph)

/* gpio25_uart2_rts */
#define GPIO25_UART2_RTS \
	BFLB_PINMUX(25, uart2, rts, periph)

/* gpio25_uart2_cts */
#define GPIO25_UART2_CTS \
	BFLB_PINMUX(25, uart2, cts, periph)

/* gpio25_uart2_tx */
#define GPIO25_UART2_TX \
	BFLB_PINMUX(25, uart2, tx, periph)

/* gpio25_uart2_rx */
#define GPIO25_UART2_RX \
	BFLB_PINMUX(25, uart2, rx, periph)

/* gpio25_emac_txd0 */
#define GPIO25_EMAC_TXD0 \
	BFLB_PINMUX(25, emac, txd0, periph)

/* gpio25_cam_dat0 */
#define GPIO25_CAM_DAT0 \
	BFLB_PINMUX(25, cam, dat0, periph)

/* gpio25_pwm0_ch1p */
#define GPIO25_PWM0_CH1P \
	BFLB_PINMUX(25, pwm0, ch1p, periph)

/* gpio25_pwm1_ch1p */
#define GPIO25_PWM1_CH1P \
	BFLB_PINMUX(25, pwm1, ch1p, periph)

/* gpio25_spi1_mosi */
#define GPIO25_SPI1_MOSI \
	BFLB_PINMUX(25, spi1, mosi, periph)

/* gpio25_i2c2_sda */
#define GPIO25_I2C2_SDA \
	BFLB_PINMUX(25, i2c2, sda, periph)

/* gpio25_i2c3_sda */
#define GPIO25_I2C3_SDA \
	BFLB_PINMUX(25, i2c3, sda, periph)

/* gpio25_mm_uart_rx */
#define GPIO25_MM_UART_RX \
	BFLB_PINMUX(25, mm_uart, rx, periph)

/* gpio25_dbi_c_dcn */
#define GPIO25_DBI_C_DCN \
	BFLB_PINMUX(25, dbi_c, dcn, periph)

/* gpio25_dpi_data8 */
#define GPIO25_DPI_DATA8 \
	BFLB_PINMUX(25, dpi, data8, periph)

/* gpio25_jtag_lp_tdi */
#define GPIO25_JTAG_LP_TDI \
	BFLB_PINMUX(25, jtag_lp, tdi, periph)

/* gpio25_jtag_m0_tdi */
#define GPIO25_JTAG_M0_TDI \
	BFLB_PINMUX(25, jtag_m0, tdi, periph)

/* gpio25_jtag_d0_tdi */
#define GPIO25_JTAG_D0_TDI \
	BFLB_PINMUX(25, jtag_d0, tdi, periph)

/* gpio25_clock_out1_cam_ref */
#define GPIO25_CLOCK_OUT1_CAM_REF \
	BFLB_PINMUX(25, clock_out1, cam_ref, periph)

/* gpio25_clock_out1_i2s_ref */
#define GPIO25_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(25, clock_out1, i2s_ref, periph)

/* gpio25_clock_out1_clk_audio_adc */
#define GPIO25_CLOCK_OUT1_CLK_AUDIO_ADC \
	BFLB_PINMUX(25, clock_out1, clk_audio_adc, periph)

/* gpio25_clock_out1_clk_audio_dac */
#define GPIO25_CLOCK_OUT1_CLK_AUDIO_DAC \
	BFLB_PINMUX(25, clock_out1, clk_audio_dac, periph)

/* gpio26_spi0_miso */
#define GPIO26_SPI0_MISO \
	BFLB_PINMUX(26, spi0, miso, periph)

/* gpio26_i2s_di */
#define GPIO26_I2S_DI \
	BFLB_PINMUX(26, i2s, di, periph)

/* gpio26_pdm_clk */
#define GPIO26_PDM_CLK \
	BFLB_PINMUX(26, pdm, clk, periph)

