zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio26_i2c0_scl */
#define GPIO26_I2C0_SCL \
	BFLB_PINMUX(26, i2c0, scl, periph)

/* gpio26_i2c1_scl */
#define GPIO26_I2C1_SCL \
	BFLB_PINMUX(26, i2c1, scl, periph)

/* gpio26_uart0_rts */
#define GPIO26_UART0_RTS \
	BFLB_PINMUX(26, uart0, rts, periph)

/* gpio26_uart0_cts */
#define GPIO26_UART0_CTS \
	BFLB_PINMUX(26, uart0, cts, periph)

/* gpio26_uart0_tx */
#define GPIO26_UART0_TX \
	BFLB_PINMUX(26, uart0, tx, periph)

/* gpio26_uart0_rx */
#define GPIO26_UART0_RX \
	BFLB_PINMUX(26, uart0, rx, periph)

/* gpio26_uart1_rts */
#define GPIO26_UART1_RTS \
	BFLB_PINMUX(26, uart1, rts, periph)

/* gpio26_uart1_cts */
#define GPIO26_UART1_CTS \
	BFLB_PINMUX(26, uart1, cts, periph)

/* gpio26_uart1_tx */
#define GPIO26_UART1_TX \
	BFLB_PINMUX(26, uart1, tx, periph)

/* gpio26_uart1_rx */
#define GPIO26_UART1_RX \
	BFLB_PINMUX(26, uart1, rx, periph)

/* gpio26_uart2_rts */
#define GPIO26_UART2_RTS \
	BFLB_PINMUX(26, uart2, rts, periph)

/* gpio26_uart2_cts */
#define GPIO26_UART2_CTS \
	BFLB_PINMUX(26, uart2, cts, periph)

/* gpio26_uart2_tx */
#define GPIO26_UART2_TX \
	BFLB_PINMUX(26, uart2, tx, periph)

/* gpio26_uart2_rx */
#define GPIO26_UART2_RX \
	BFLB_PINMUX(26, uart2, rx, periph)

/* gpio26_emac_txd1 */
#define GPIO26_EMAC_TXD1 \
	BFLB_PINMUX(26, emac, txd1, periph)

/* gpio26_cam_dat1 */
#define GPIO26_CAM_DAT1 \
	BFLB_PINMUX(26, cam, dat1, periph)

/* gpio26_pwm0_ch2p */
#define GPIO26_PWM0_CH2P \
	BFLB_PINMUX(26, pwm0, ch2p, periph)

/* gpio26_pwm1_ch2p */
#define GPIO26_PWM1_CH2P \
	BFLB_PINMUX(26, pwm1, ch2p, periph)

/* gpio26_spi1_miso */
#define GPIO26_SPI1_MISO \
	BFLB_PINMUX(26, spi1, miso, periph)

/* gpio26_i2c2_scl */
#define GPIO26_I2C2_SCL \
	BFLB_PINMUX(26, i2c2, scl, periph)

/* gpio26_i2c3_scl */
#define GPIO26_I2C3_SCL \
	BFLB_PINMUX(26, i2c3, scl, periph)

/* gpio26_mm_uart_rts */
#define GPIO26_MM_UART_RTS \
	BFLB_PINMUX(26, mm_uart, rts, periph)

/* gpio26_dbi_c_scl */
#define GPIO26_DBI_C_SCL \
	BFLB_PINMUX(26, dbi_c, scl, periph)

/* gpio26_dpi_data9 */
#define GPIO26_DPI_DATA9 \
	BFLB_PINMUX(26, dpi, data9, periph)

/* gpio26_jtag_lp_tms */
#define GPIO26_JTAG_LP_TMS \
	BFLB_PINMUX(26, jtag_lp, tms, periph)

/* gpio26_jtag_m0_tms */
#define GPIO26_JTAG_M0_TMS \
	BFLB_PINMUX(26, jtag_m0, tms, periph)

/* gpio26_jtag_d0_tms */
#define GPIO26_JTAG_D0_TMS \
	BFLB_PINMUX(26, jtag_d0, tms, periph)

/* gpio26_clock_out2_cam_ref */
#define GPIO26_CLOCK_OUT2_CAM_REF \
	BFLB_PINMUX(26, clock_out2, cam_ref, periph)

/* gpio26_clock_out2_i2s_ref */
#define GPIO26_CLOCK_OUT2_I2S_REF \
	BFLB_PINMUX(26, clock_out2, i2s_ref, periph)

/* gpio26_clock_out2_xtal */
#define GPIO26_CLOCK_OUT2_XTAL \
	BFLB_PINMUX(26, clock_out2, xtal, periph)

/* gpio26_clock_out2_wifipll_32m */
#define GPIO26_CLOCK_OUT2_WIFIPLL_32M \
	BFLB_PINMUX(26, clock_out2, wifipll_32m, periph)

/* gpio27_spi0_sclk */
#define GPIO27_SPI0_SCLK \
	BFLB_PINMUX(27, spi0, sclk, periph)

/* gpio27_i2s_do */
#define GPIO27_I2S_DO \
	BFLB_PINMUX(27, i2s, do, periph)

/* gpio27_pdm_in */
#define GPIO27_PDM_IN \
	BFLB_PINMUX(27, pdm, in, periph)

/* gpio27_i2c0_sda */
#define GPIO27_I2C0_SDA \
	BFLB_PINMUX(27, i2c0, sda, periph)

/* gpio27_i2c1_sda */
#define GPIO27_I2C1_SDA \
	BFLB_PINMUX(27, i2c1, sda, periph)

/* gpio27_uart0_rts */
#define GPIO27_UART0_RTS \
	BFLB_PINMUX(27, uart0, rts, periph)

/* gpio27_uart0_cts */
#define GPIO27_UART0_CTS \
	BFLB_PINMUX(27, uart0, cts, periph)

/* gpio27_uart0_tx */
#define GPIO27_UART0_TX \
	BFLB_PINMUX(27, uart0, tx, periph)

/* gpio27_uart0_rx */
#define GPIO27_UART0_RX \
	BFLB_PINMUX(27, uart0, rx, periph)

/* gpio27_uart1_rts */
#define GPIO27_UART1_RTS \
	BFLB_PINMUX(27, uart1, rts, periph)

/* gpio27_uart1_cts */
#define GPIO27_UART1_CTS \
	BFLB_PINMUX(27, uart1, cts, periph)

/* gpio27_uart1_tx */
#define GPIO27_UART1_TX \
	BFLB_PINMUX(27, uart1, tx, periph)

/* gpio27_uart1_rx */
#define GPIO27_UART1_RX \
	BFLB_PINMUX(27, uart1, rx, periph)

/* gpio27_uart2_rts */
#define GPIO27_UART2_RTS \
	BFLB_PINMUX(27, uart2, rts, periph)

/* gpio27_uart2_cts */
#define GPIO27_UART2_CTS \
	BFLB_PINMUX(27, uart2, cts, periph)

/* gpio27_uart2_tx */
#define GPIO27_UART2_TX \
	BFLB_PINMUX(27, uart2, tx, periph)

/* gpio27_uart2_rx */
#define GPIO27_UART2_RX \
	BFLB_PINMUX(27, uart2, rx, periph)

/* gpio27_emac_rxd0 */
#define GPIO27_EMAC_RXD0 \
	BFLB_PINMUX(27, emac, rxd0, periph)

/* gpio27_cam_dat2 */
#define GPIO27_CAM_DAT2 \
	BFLB_PINMUX(27, cam, dat2, periph)

/* gpio27_pwm0_ch3p */
#define GPIO27_PWM0_CH3P \
	BFLB_PINMUX(27, pwm0, ch3p, periph)

/* gpio27_pwm1_ch3p */
#define GPIO27_PWM1_CH3P \
	BFLB_PINMUX(27, pwm1, ch3p, periph)

/* gpio27_spi1_sclk */
#define GPIO27_SPI1_SCLK \
	BFLB_PINMUX(27, spi1, sclk, periph)

/* gpio27_i2c2_sda */
#define GPIO27_I2C2_SDA \
	BFLB_PINMUX(27, i2c2, sda, periph)

/* gpio27_i2c3_sda */
#define GPIO27_I2C3_SDA \
	BFLB_PINMUX(27, i2c3, sda, periph)

/* gpio27_mm_uart_cts */
#define GPIO27_MM_UART_CTS \
	BFLB_PINMUX(27, mm_uart, cts, periph)

/* gpio27_dbi_c_sda */
#define GPIO27_DBI_C_SDA \
	BFLB_PINMUX(27, dbi_c, sda, periph)

/* gpio27_dpi_data10 */
#define GPIO27_DPI_DATA10 \
	BFLB_PINMUX(27, dpi, data10, periph)

/* gpio27_jtag_lp_tdo */
#define GPIO27_JTAG_LP_TDO \
	BFLB_PINMUX(27, jtag_lp, tdo, periph)

/* gpio27_jtag_m0_tdo */
#define GPIO27_JTAG_M0_TDO \
	BFLB_PINMUX(27, jtag_m0, tdo, periph)

/* gpio27_jtag_d0_tdo */
#define GPIO27_JTAG_D0_TDO \
	BFLB_PINMUX(27, jtag_d0, tdo, periph)

/* gpio27_clock_out3_cam_ref */
#define GPIO27_CLOCK_OUT3_CAM_REF \
	BFLB_PINMUX(27, clock_out3, cam_ref, periph)

/* gpio27_clock_out3_i2s_ref */
#define GPIO27_CLOCK_OUT3_I2S_REF \
	BFLB_PINMUX(27, clock_out3, i2s_ref, periph)

/* gpio27_clock_out3_wifipll_48m */
#define GPIO27_CLOCK_OUT3_WIFIPLL_48M \
	BFLB_PINMUX(27, clock_out3, wifipll_48m, periph)

/* gpio28_spi0_ss */
#define GPIO28_SPI0_SS \
	BFLB_PINMUX(28, spi0, ss, periph)

/* gpio28_i2s_bclk */
#define GPIO28_I2S_BCLK \
	BFLB_PINMUX(28, i2s, bclk, periph)

/* gpio28_i2c0_scl */
#define GPIO28_I2C0_SCL \
	BFLB_PINMUX(28, i2c0, scl, periph)

/* gpio28_i2c1_scl */
#define GPIO28_I2C1_SCL \
	BFLB_PINMUX(28, i2c1, scl, periph)

/* gpio28_uart0_rts */
#define GPIO28_UART0_RTS \
	BFLB_PINMUX(28, uart0, rts, periph)

/* gpio28_uart0_cts */
#define GPIO28_UART0_CTS \
	BFLB_PINMUX(28, uart0, cts, periph)

/* gpio28_uart0_tx */
#define GPIO28_UART0_TX \
	BFLB_PINMUX(28, uart0, tx, periph)

/* gpio28_uart0_rx */
#define GPIO28_UART0_RX \
	BFLB_PINMUX(28, uart0, rx, periph)

/* gpio28_uart1_rts */
#define GPIO28_UART1_RTS \
	BFLB_PINMUX(28, uart1, rts, periph)

/* gpio28_uart1_cts */
#define GPIO28_UART1_CTS \
	BFLB_PINMUX(28, uart1, cts, periph)

/* gpio28_uart1_tx */
#define GPIO28_UART1_TX \
	BFLB_PINMUX(28, uart1, tx, periph)

/* gpio28_uart1_rx */
#define GPIO28_UART1_RX \
	BFLB_PINMUX(28, uart1, rx, periph)

