zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio28_uart2_rts */
#define GPIO28_UART2_RTS \
	BFLB_PINMUX(28, uart2, rts, periph)

/* gpio28_uart2_cts */
#define GPIO28_UART2_CTS \
	BFLB_PINMUX(28, uart2, cts, periph)

/* gpio28_uart2_tx */
#define GPIO28_UART2_TX \
	BFLB_PINMUX(28, uart2, tx, periph)

/* gpio28_uart2_rx */
#define GPIO28_UART2_RX \
	BFLB_PINMUX(28, uart2, rx, periph)

/* gpio28_emac_rxd1 */
#define GPIO28_EMAC_RXD1 \
	BFLB_PINMUX(28, emac, rxd1, periph)

/* gpio28_cam_dat3 */
#define GPIO28_CAM_DAT3 \
	BFLB_PINMUX(28, cam, dat3, periph)

/* gpio28_pwm0_ch0p */
#define GPIO28_PWM0_CH0P \
	BFLB_PINMUX(28, pwm0, ch0p, periph)

/* gpio28_pwm1_ch0p */
#define GPIO28_PWM1_CH0P \
	BFLB_PINMUX(28, pwm1, ch0p, periph)

/* gpio28_spi1_ss */
#define GPIO28_SPI1_SS \
	BFLB_PINMUX(28, spi1, ss, periph)

/* gpio28_i2c2_scl */
#define GPIO28_I2C2_SCL \
	BFLB_PINMUX(28, i2c2, scl, periph)

/* gpio28_i2c3_scl */
#define GPIO28_I2C3_SCL \
	BFLB_PINMUX(28, i2c3, scl, periph)

/* gpio28_mm_uart_tx */
#define GPIO28_MM_UART_TX \
	BFLB_PINMUX(28, mm_uart, tx, periph)

/* gpio28_dbi_c_cs */
#define GPIO28_DBI_C_CS \
	BFLB_PINMUX(28, dbi_c, cs, periph)

/* gpio28_dpi_data11 */
#define GPIO28_DPI_DATA11 \
	BFLB_PINMUX(28, dpi, data11, periph)

/* gpio28_jtag_lp_tck */
#define GPIO28_JTAG_LP_TCK \
	BFLB_PINMUX(28, jtag_lp, tck, periph)

/* gpio28_jtag_m0_tck */
#define GPIO28_JTAG_M0_TCK \
	BFLB_PINMUX(28, jtag_m0, tck, periph)

/* gpio28_jtag_d0_tck */
#define GPIO28_JTAG_D0_TCK \
	BFLB_PINMUX(28, jtag_d0, tck, periph)

/* gpio28_clock_out0_cam_ref */
#define GPIO28_CLOCK_OUT0_CAM_REF \
	BFLB_PINMUX(28, clock_out0, cam_ref, periph)

/* gpio28_clock_out0_i2s_ref */
#define GPIO28_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(28, clock_out0, i2s_ref, periph)

/* gpio28_clock_out0_clk_audio_adc */
#define GPIO28_CLOCK_OUT0_CLK_AUDIO_ADC \
	BFLB_PINMUX(28, clock_out0, clk_audio_adc, periph)

/* gpio28_clock_out0_clk_audio_dac */
#define GPIO28_CLOCK_OUT0_CLK_AUDIO_DAC \
	BFLB_PINMUX(28, clock_out0, clk_audio_dac, periph)

/* gpio29_spi0_mosi */
#define GPIO29_SPI0_MOSI \
	BFLB_PINMUX(29, spi0, mosi, periph)

/* gpio29_i2s_fs */
#define GPIO29_I2S_FS \
	BFLB_PINMUX(29, i2s, fs, periph)

/* gpio29_i2c0_sda */
#define GPIO29_I2C0_SDA \
	BFLB_PINMUX(29, i2c0, sda, periph)

/* gpio29_i2c1_sda */
#define GPIO29_I2C1_SDA \
	BFLB_PINMUX(29, i2c1, sda, periph)

/* gpio29_uart0_rts */
#define GPIO29_UART0_RTS \
	BFLB_PINMUX(29, uart0, rts, periph)

/* gpio29_uart0_cts */
#define GPIO29_UART0_CTS \
	BFLB_PINMUX(29, uart0, cts, periph)

/* gpio29_uart0_tx */
#define GPIO29_UART0_TX \
	BFLB_PINMUX(29, uart0, tx, periph)

/* gpio29_uart0_rx */
#define GPIO29_UART0_RX \
	BFLB_PINMUX(29, uart0, rx, periph)

/* gpio29_uart1_rts */
#define GPIO29_UART1_RTS \
	BFLB_PINMUX(29, uart1, rts, periph)

/* gpio29_uart1_cts */
#define GPIO29_UART1_CTS \
	BFLB_PINMUX(29, uart1, cts, periph)

/* gpio29_uart1_tx */
#define GPIO29_UART1_TX \
	BFLB_PINMUX(29, uart1, tx, periph)

/* gpio29_uart1_rx */
#define GPIO29_UART1_RX \
	BFLB_PINMUX(29, uart1, rx, periph)

/* gpio29_uart2_rts */
#define GPIO29_UART2_RTS \
	BFLB_PINMUX(29, uart2, rts, periph)

/* gpio29_uart2_cts */
#define GPIO29_UART2_CTS \
	BFLB_PINMUX(29, uart2, cts, periph)

/* gpio29_uart2_tx */
#define GPIO29_UART2_TX \
	BFLB_PINMUX(29, uart2, tx, periph)

/* gpio29_uart2_rx */
#define GPIO29_UART2_RX \
	BFLB_PINMUX(29, uart2, rx, periph)

/* gpio29_emac_rxerr */
#define GPIO29_EMAC_RXERR \
	BFLB_PINMUX(29, emac, rxerr, periph)

/* gpio29_cam_dat4 */
#define GPIO29_CAM_DAT4 \
	BFLB_PINMUX(29, cam, dat4, periph)

/* gpio29_pwm0_ch1p */
#define GPIO29_PWM0_CH1P \
	BFLB_PINMUX(29, pwm0, ch1p, periph)

/* gpio29_pwm1_ch1p */
#define GPIO29_PWM1_CH1P \
	BFLB_PINMUX(29, pwm1, ch1p, periph)

/* gpio29_spi1_mosi */
#define GPIO29_SPI1_MOSI \
	BFLB_PINMUX(29, spi1, mosi, periph)

/* gpio29_i2c2_sda */
#define GPIO29_I2C2_SDA \
	BFLB_PINMUX(29, i2c2, sda, periph)

/* gpio29_i2c3_sda */
#define GPIO29_I2C3_SDA \
	BFLB_PINMUX(29, i2c3, sda, periph)

/* gpio29_mm_uart_rx */
#define GPIO29_MM_UART_RX \
	BFLB_PINMUX(29, mm_uart, rx, periph)

/* gpio29_dbi_c_dcn */
#define GPIO29_DBI_C_DCN \
	BFLB_PINMUX(29, dbi_c, dcn, periph)

/* gpio29_dpi_data12 */
#define GPIO29_DPI_DATA12 \
	BFLB_PINMUX(29, dpi, data12, periph)

/* gpio29_jtag_lp_tdi */
#define GPIO29_JTAG_LP_TDI \
	BFLB_PINMUX(29, jtag_lp, tdi, periph)

/* gpio29_jtag_m0_tdi */
#define GPIO29_JTAG_M0_TDI \
	BFLB_PINMUX(29, jtag_m0, tdi, periph)

/* gpio29_jtag_d0_tdi */
#define GPIO29_JTAG_D0_TDI \
	BFLB_PINMUX(29, jtag_d0, tdi, periph)

/* gpio29_clock_out1_cam_ref */
#define GPIO29_CLOCK_OUT1_CAM_REF \
	BFLB_PINMUX(29, clock_out1, cam_ref, periph)

/* gpio29_clock_out1_i2s_ref */
#define GPIO29_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(29, clock_out1, i2s_ref, periph)

/* gpio29_clock_out1_clk_audio_adc */
#define GPIO29_CLOCK_OUT1_CLK_AUDIO_ADC \
	BFLB_PINMUX(29, clock_out1, clk_audio_adc, periph)

/* gpio29_clock_out1_clk_audio_dac */
#define GPIO29_CLOCK_OUT1_CLK_AUDIO_DAC \
	BFLB_PINMUX(29, clock_out1, clk_audio_dac, periph)

/* gpio30_spi0_miso */
#define GPIO30_SPI0_MISO \
	BFLB_PINMUX(30, spi0, miso, periph)

/* gpio30_i2s_di */
#define GPIO30_I2S_DI \
	BFLB_PINMUX(30, i2s, di, periph)

/* gpio30_i2c0_scl */
#define GPIO30_I2C0_SCL \
	BFLB_PINMUX(30, i2c0, scl, periph)

/* gpio30_i2c1_scl */
#define GPIO30_I2C1_SCL \
	BFLB_PINMUX(30, i2c1, scl, periph)

/* gpio30_uart0_rts */
#define GPIO30_UART0_RTS \
	BFLB_PINMUX(30, uart0, rts, periph)

/* gpio30_uart0_cts */
#define GPIO30_UART0_CTS \
	BFLB_PINMUX(30, uart0, cts, periph)

/* gpio30_uart0_tx */
#define GPIO30_UART0_TX \
	BFLB_PINMUX(30, uart0, tx, periph)

/* gpio30_uart0_rx */
#define GPIO30_UART0_RX \
	BFLB_PINMUX(30, uart0, rx, periph)

/* gpio30_uart1_rts */
#define GPIO30_UART1_RTS \
	BFLB_PINMUX(30, uart1, rts, periph)

/* gpio30_uart1_cts */
#define GPIO30_UART1_CTS \
	BFLB_PINMUX(30, uart1, cts, periph)

/* gpio30_uart1_tx */
#define GPIO30_UART1_TX \
	BFLB_PINMUX(30, uart1, tx, periph)

/* gpio30_uart1_rx */
#define GPIO30_UART1_RX \
	BFLB_PINMUX(30, uart1, rx, periph)

/* gpio30_uart2_rts */
#define GPIO30_UART2_RTS \
	BFLB_PINMUX(30, uart2, rts, periph)

