zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio30_uart2_cts */
#define GPIO30_UART2_CTS \
	BFLB_PINMUX(30, uart2, cts, periph)

/* gpio30_uart2_tx */
#define GPIO30_UART2_TX \
	BFLB_PINMUX(30, uart2, tx, periph)

/* gpio30_uart2_rx */
#define GPIO30_UART2_RX \
	BFLB_PINMUX(30, uart2, rx, periph)

/* gpio30_emac_tx_en */
#define GPIO30_EMAC_TX_EN \
	BFLB_PINMUX(30, emac, tx_en, periph)

/* gpio30_cam_dat5 */
#define GPIO30_CAM_DAT5 \
	BFLB_PINMUX(30, cam, dat5, periph)

/* gpio30_pwm0_ch2p */
#define GPIO30_PWM0_CH2P \
	BFLB_PINMUX(30, pwm0, ch2p, periph)

/* gpio30_pwm1_ch2p */
#define GPIO30_PWM1_CH2P \
	BFLB_PINMUX(30, pwm1, ch2p, periph)

/* gpio30_spi1_miso */
#define GPIO30_SPI1_MISO \
	BFLB_PINMUX(30, spi1, miso, periph)

/* gpio30_i2c2_scl */
#define GPIO30_I2C2_SCL \
	BFLB_PINMUX(30, i2c2, scl, periph)

/* gpio30_i2c3_scl */
#define GPIO30_I2C3_SCL \
	BFLB_PINMUX(30, i2c3, scl, periph)

/* gpio30_mm_uart_rts */
#define GPIO30_MM_UART_RTS \
	BFLB_PINMUX(30, mm_uart, rts, periph)

/* gpio30_dbi_c_scl */
#define GPIO30_DBI_C_SCL \
	BFLB_PINMUX(30, dbi_c, scl, periph)

/* gpio30_dpi_data13 */
#define GPIO30_DPI_DATA13 \
	BFLB_PINMUX(30, dpi, data13, periph)

/* gpio30_jtag_lp_tms */
#define GPIO30_JTAG_LP_TMS \
	BFLB_PINMUX(30, jtag_lp, tms, periph)

/* gpio30_jtag_m0_tms */
#define GPIO30_JTAG_M0_TMS \
	BFLB_PINMUX(30, jtag_m0, tms, periph)

/* gpio30_jtag_d0_tms */
#define GPIO30_JTAG_D0_TMS \
	BFLB_PINMUX(30, jtag_d0, tms, periph)

/* gpio30_clock_out2_cam_ref */
#define GPIO30_CLOCK_OUT2_CAM_REF \
	BFLB_PINMUX(30, clock_out2, cam_ref, periph)

/* gpio30_clock_out2_i2s_ref */
#define GPIO30_CLOCK_OUT2_I2S_REF \
	BFLB_PINMUX(30, clock_out2, i2s_ref, periph)

/* gpio30_clock_out2_xtal */
#define GPIO30_CLOCK_OUT2_XTAL \
	BFLB_PINMUX(30, clock_out2, xtal, periph)

/* gpio30_clock_out2_wifipll_32m */
#define GPIO30_CLOCK_OUT2_WIFIPLL_32M \
	BFLB_PINMUX(30, clock_out2, wifipll_32m, periph)

/* gpio31_spi0_sclk */
#define GPIO31_SPI0_SCLK \
	BFLB_PINMUX(31, spi0, sclk, periph)

/* gpio31_i2s_do */
#define GPIO31_I2S_DO \
	BFLB_PINMUX(31, i2s, do, periph)

/* gpio31_i2c0_sda */
#define GPIO31_I2C0_SDA \
	BFLB_PINMUX(31, i2c0, sda, periph)

/* gpio31_i2c1_sda */
#define GPIO31_I2C1_SDA \
	BFLB_PINMUX(31, i2c1, sda, periph)

/* gpio31_uart0_rts */
#define GPIO31_UART0_RTS \
	BFLB_PINMUX(31, uart0, rts, periph)

/* gpio31_uart0_cts */
#define GPIO31_UART0_CTS \
	BFLB_PINMUX(31, uart0, cts, periph)

/* gpio31_uart0_tx */
#define GPIO31_UART0_TX \
	BFLB_PINMUX(31, uart0, tx, periph)

/* gpio31_uart0_rx */
#define GPIO31_UART0_RX \
	BFLB_PINMUX(31, uart0, rx, periph)

/* gpio31_uart1_rts */
#define GPIO31_UART1_RTS \
	BFLB_PINMUX(31, uart1, rts, periph)

/* gpio31_uart1_cts */
#define GPIO31_UART1_CTS \
	BFLB_PINMUX(31, uart1, cts, periph)

/* gpio31_uart1_tx */
#define GPIO31_UART1_TX \
	BFLB_PINMUX(31, uart1, tx, periph)

/* gpio31_uart1_rx */
#define GPIO31_UART1_RX \
	BFLB_PINMUX(31, uart1, rx, periph)

/* gpio31_uart2_rts */
#define GPIO31_UART2_RTS \
	BFLB_PINMUX(31, uart2, rts, periph)

/* gpio31_uart2_cts */
#define GPIO31_UART2_CTS \
	BFLB_PINMUX(31, uart2, cts, periph)

/* gpio31_uart2_tx */
#define GPIO31_UART2_TX \
	BFLB_PINMUX(31, uart2, tx, periph)

/* gpio31_uart2_rx */
#define GPIO31_UART2_RX \
	BFLB_PINMUX(31, uart2, rx, periph)

/* gpio31_emac_rx_dv */
#define GPIO31_EMAC_RX_DV \
	BFLB_PINMUX(31, emac, rx_dv, periph)

/* gpio31_cam_dat6 */
#define GPIO31_CAM_DAT6 \
	BFLB_PINMUX(31, cam, dat6, periph)

/* gpio31_pwm0_ch3p */
#define GPIO31_PWM0_CH3P \
	BFLB_PINMUX(31, pwm0, ch3p, periph)

/* gpio31_pwm1_ch3p */
#define GPIO31_PWM1_CH3P \
	BFLB_PINMUX(31, pwm1, ch3p, periph)

/* gpio31_spi1_sclk */
#define GPIO31_SPI1_SCLK \
	BFLB_PINMUX(31, spi1, sclk, periph)

/* gpio31_i2c2_sda */
#define GPIO31_I2C2_SDA \
	BFLB_PINMUX(31, i2c2, sda, periph)

/* gpio31_i2c3_sda */
#define GPIO31_I2C3_SDA \
	BFLB_PINMUX(31, i2c3, sda, periph)

/* gpio31_mm_uart_cts */
#define GPIO31_MM_UART_CTS \
	BFLB_PINMUX(31, mm_uart, cts, periph)

/* gpio31_dbi_c_sda */
#define GPIO31_DBI_C_SDA \
	BFLB_PINMUX(31, dbi_c, sda, periph)

/* gpio31_dpi_data14 */
#define GPIO31_DPI_DATA14 \
	BFLB_PINMUX(31, dpi, data14, periph)

/* gpio31_jtag_lp_tdo */
#define GPIO31_JTAG_LP_TDO \
	BFLB_PINMUX(31, jtag_lp, tdo, periph)

/* gpio31_jtag_m0_tdo */
#define GPIO31_JTAG_M0_TDO \
	BFLB_PINMUX(31, jtag_m0, tdo, periph)

/* gpio31_jtag_d0_tdo */
#define GPIO31_JTAG_D0_TDO \
	BFLB_PINMUX(31, jtag_d0, tdo, periph)

/* gpio31_clock_out3_cam_ref */
#define GPIO31_CLOCK_OUT3_CAM_REF \
	BFLB_PINMUX(31, clock_out3, cam_ref, periph)

/* gpio31_clock_out3_i2s_ref */
#define GPIO31_CLOCK_OUT3_I2S_REF \
	BFLB_PINMUX(31, clock_out3, i2s_ref, periph)

/* gpio31_clock_out3_wifipll_48m */
#define GPIO31_CLOCK_OUT3_WIFIPLL_48M \
	BFLB_PINMUX(31, clock_out3, wifipll_48m, periph)

/* gpio32_spi0_ss */
#define GPIO32_SPI0_SS \
	BFLB_PINMUX(32, spi0, ss, periph)

/* gpio32_i2s_bclk */
#define GPIO32_I2S_BCLK \
	BFLB_PINMUX(32, i2s, bclk, periph)

/* gpio32_i2c0_scl */
#define GPIO32_I2C0_SCL \
	BFLB_PINMUX(32, i2c0, scl, periph)

/* gpio32_i2c1_scl */
#define GPIO32_I2C1_SCL \
	BFLB_PINMUX(32, i2c1, scl, periph)

/* gpio32_uart0_rts */
#define GPIO32_UART0_RTS \
	BFLB_PINMUX(32, uart0, rts, periph)

/* gpio32_uart0_cts */
#define GPIO32_UART0_CTS \
	BFLB_PINMUX(32, uart0, cts, periph)

/* gpio32_uart0_tx */
#define GPIO32_UART0_TX \
	BFLB_PINMUX(32, uart0, tx, periph)

/* gpio32_uart0_rx */
#define GPIO32_UART0_RX \
	BFLB_PINMUX(32, uart0, rx, periph)

/* gpio32_uart1_rts */
#define GPIO32_UART1_RTS \
	BFLB_PINMUX(32, uart1, rts, periph)

/* gpio32_uart1_cts */
#define GPIO32_UART1_CTS \
	BFLB_PINMUX(32, uart1, cts, periph)

/* gpio32_uart1_tx */
#define GPIO32_UART1_TX \
	BFLB_PINMUX(32, uart1, tx, periph)

/* gpio32_uart1_rx */
#define GPIO32_UART1_RX \
	BFLB_PINMUX(32, uart1, rx, periph)

/* gpio32_uart2_rts */
#define GPIO32_UART2_RTS \
	BFLB_PINMUX(32, uart2, rts, periph)

/* gpio32_uart2_cts */
#define GPIO32_UART2_CTS \
	BFLB_PINMUX(32, uart2, cts, periph)

/* gpio32_uart2_tx */
#define GPIO32_UART2_TX \
	BFLB_PINMUX(32, uart2, tx, periph)

