zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio32_uart2_rx */
#define GPIO32_UART2_RX \
	BFLB_PINMUX(32, uart2, rx, periph)

/* gpio32_emac_mdc */
#define GPIO32_EMAC_MDC \
	BFLB_PINMUX(32, emac, mdc, periph)

/* gpio32_cam_dat7 */
#define GPIO32_CAM_DAT7 \
	BFLB_PINMUX(32, cam, dat7, periph)

/* gpio32_pwm0_ch0p */
#define GPIO32_PWM0_CH0P \
	BFLB_PINMUX(32, pwm0, ch0p, periph)

/* gpio32_pwm1_ch0p */
#define GPIO32_PWM1_CH0P \
	BFLB_PINMUX(32, pwm1, ch0p, periph)

/* gpio32_spi1_ss */
#define GPIO32_SPI1_SS \
	BFLB_PINMUX(32, spi1, ss, periph)

/* gpio32_i2c2_scl */
#define GPIO32_I2C2_SCL \
	BFLB_PINMUX(32, i2c2, scl, periph)

/* gpio32_i2c3_scl */
#define GPIO32_I2C3_SCL \
	BFLB_PINMUX(32, i2c3, scl, periph)

/* gpio32_mm_uart_tx */
#define GPIO32_MM_UART_TX \
	BFLB_PINMUX(32, mm_uart, tx, periph)

/* gpio32_dbi_c_cs */
#define GPIO32_DBI_C_CS \
	BFLB_PINMUX(32, dbi_c, cs, periph)

/* gpio32_dpi_data15 */
#define GPIO32_DPI_DATA15 \
	BFLB_PINMUX(32, dpi, data15, periph)

/* gpio32_jtag_lp_tck */
#define GPIO32_JTAG_LP_TCK \
	BFLB_PINMUX(32, jtag_lp, tck, periph)

/* gpio32_jtag_m0_tck */
#define GPIO32_JTAG_M0_TCK \
	BFLB_PINMUX(32, jtag_m0, tck, periph)

/* gpio32_jtag_d0_tck */
#define GPIO32_JTAG_D0_TCK \
	BFLB_PINMUX(32, jtag_d0, tck, periph)

/* gpio32_clock_out0_cam_ref */
#define GPIO32_CLOCK_OUT0_CAM_REF \
	BFLB_PINMUX(32, clock_out0, cam_ref, periph)

/* gpio32_clock_out0_i2s_ref */
#define GPIO32_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(32, clock_out0, i2s_ref, periph)

/* gpio32_clock_out0_clk_audio_adc */
#define GPIO32_CLOCK_OUT0_CLK_AUDIO_ADC \
	BFLB_PINMUX(32, clock_out0, clk_audio_adc, periph)

/* gpio32_clock_out0_clk_audio_dac */
#define GPIO32_CLOCK_OUT0_CLK_AUDIO_DAC \
	BFLB_PINMUX(32, clock_out0, clk_audio_dac, periph)

/* gpio33_spi0_mosi */
#define GPIO33_SPI0_MOSI \
	BFLB_PINMUX(33, spi0, mosi, periph)

/* gpio33_i2s_fs */
#define GPIO33_I2S_FS \
	BFLB_PINMUX(33, i2s, fs, periph)

/* gpio33_i2c0_sda */
#define GPIO33_I2C0_SDA \
	BFLB_PINMUX(33, i2c0, sda, periph)

/* gpio33_i2c1_sda */
#define GPIO33_I2C1_SDA \
	BFLB_PINMUX(33, i2c1, sda, periph)

/* gpio33_uart0_rts */
#define GPIO33_UART0_RTS \
	BFLB_PINMUX(33, uart0, rts, periph)

/* gpio33_uart0_cts */
#define GPIO33_UART0_CTS \
	BFLB_PINMUX(33, uart0, cts, periph)

/* gpio33_uart0_tx */
#define GPIO33_UART0_TX \
	BFLB_PINMUX(33, uart0, tx, periph)

/* gpio33_uart0_rx */
#define GPIO33_UART0_RX \
	BFLB_PINMUX(33, uart0, rx, periph)

/* gpio33_uart1_rts */
#define GPIO33_UART1_RTS \
	BFLB_PINMUX(33, uart1, rts, periph)

/* gpio33_uart1_cts */
#define GPIO33_UART1_CTS \
	BFLB_PINMUX(33, uart1, cts, periph)

/* gpio33_uart1_tx */
#define GPIO33_UART1_TX \
	BFLB_PINMUX(33, uart1, tx, periph)

/* gpio33_uart1_rx */
#define GPIO33_UART1_RX \
	BFLB_PINMUX(33, uart1, rx, periph)

/* gpio33_uart2_rts */
#define GPIO33_UART2_RTS \
	BFLB_PINMUX(33, uart2, rts, periph)

/* gpio33_uart2_cts */
#define GPIO33_UART2_CTS \
	BFLB_PINMUX(33, uart2, cts, periph)

/* gpio33_uart2_tx */
#define GPIO33_UART2_TX \
	BFLB_PINMUX(33, uart2, tx, periph)

/* gpio33_uart2_rx */
#define GPIO33_UART2_RX \
	BFLB_PINMUX(33, uart2, rx, periph)

/* gpio33_emac_mdio */
#define GPIO33_EMAC_MDIO \
	BFLB_PINMUX(33, emac, mdio, periph)

/* gpio33_pwm0_ch1p */
#define GPIO33_PWM0_CH1P \
	BFLB_PINMUX(33, pwm0, ch1p, periph)

/* gpio33_pwm1_ch1p */
#define GPIO33_PWM1_CH1P \
	BFLB_PINMUX(33, pwm1, ch1p, periph)

/* gpio33_spi1_mosi */
#define GPIO33_SPI1_MOSI \
	BFLB_PINMUX(33, spi1, mosi, periph)

/* gpio33_i2c2_sda */
#define GPIO33_I2C2_SDA \
	BFLB_PINMUX(33, i2c2, sda, periph)

/* gpio33_i2c3_sda */
#define GPIO33_I2C3_SDA \
	BFLB_PINMUX(33, i2c3, sda, periph)

/* gpio33_mm_uart_rx */
#define GPIO33_MM_UART_RX \
	BFLB_PINMUX(33, mm_uart, rx, periph)

/* gpio33_dbi_c_dcn */
#define GPIO33_DBI_C_DCN \
	BFLB_PINMUX(33, dbi_c, dcn, periph)

/* gpio33_dpi_de */
#define GPIO33_DPI_DE \
	BFLB_PINMUX(33, dpi, de, periph)

/* gpio33_jtag_lp_tdi */
#define GPIO33_JTAG_LP_TDI \
	BFLB_PINMUX(33, jtag_lp, tdi, periph)

/* gpio33_jtag_m0_tdi */
#define GPIO33_JTAG_M0_TDI \
	BFLB_PINMUX(33, jtag_m0, tdi, periph)

/* gpio33_jtag_d0_tdi */
#define GPIO33_JTAG_D0_TDI \
	BFLB_PINMUX(33, jtag_d0, tdi, periph)

/* gpio33_clock_out1_cam_ref */
#define GPIO33_CLOCK_OUT1_CAM_REF \
	BFLB_PINMUX(33, clock_out1, cam_ref, periph)

/* gpio33_clock_out1_i2s_ref */
#define GPIO33_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(33, clock_out1, i2s_ref, periph)

/* gpio33_clock_out1_clk_audio_adc */
#define GPIO33_CLOCK_OUT1_CLK_AUDIO_ADC \
	BFLB_PINMUX(33, clock_out1, clk_audio_adc, periph)

/* gpio33_clock_out1_clk_audio_dac */
#define GPIO33_CLOCK_OUT1_CLK_AUDIO_DAC \
	BFLB_PINMUX(33, clock_out1, clk_audio_dac, periph)

/* gpio34_spi0_miso */
#define GPIO34_SPI0_MISO \
	BFLB_PINMUX(34, spi0, miso, periph)

/* gpio34_flash2_clk */
#define GPIO34_FLASH2_CLK \
	BFLB_PINMUX(34, flash2, clk, periph)

/* gpio34_i2s_di */
#define GPIO34_I2S_DI \
	BFLB_PINMUX(34, i2s, di, periph)

/* gpio34_pdm_in */
#define GPIO34_PDM_IN \
	BFLB_PINMUX(34, pdm, in, periph)

/* gpio34_i2c0_scl */
#define GPIO34_I2C0_SCL \
	BFLB_PINMUX(34, i2c0, scl, periph)

/* gpio34_i2c1_scl */
#define GPIO34_I2C1_SCL \
	BFLB_PINMUX(34, i2c1, scl, periph)

/* gpio34_uart0_rts */
#define GPIO34_UART0_RTS \
	BFLB_PINMUX(34, uart0, rts, periph)

/* gpio34_uart0_cts */
#define GPIO34_UART0_CTS \
	BFLB_PINMUX(34, uart0, cts, periph)

/* gpio34_uart0_tx */
#define GPIO34_UART0_TX \
	BFLB_PINMUX(34, uart0, tx, periph)

/* gpio34_uart0_rx */
#define GPIO34_UART0_RX \
	BFLB_PINMUX(34, uart0, rx, periph)

/* gpio34_uart1_rts */
#define GPIO34_UART1_RTS \
	BFLB_PINMUX(34, uart1, rts, periph)

/* gpio34_uart1_cts */
#define GPIO34_UART1_CTS \
	BFLB_PINMUX(34, uart1, cts, periph)

/* gpio34_uart1_tx */
#define GPIO34_UART1_TX \
	BFLB_PINMUX(34, uart1, tx, periph)

/* gpio34_uart1_rx */
#define GPIO34_UART1_RX \
	BFLB_PINMUX(34, uart1, rx, periph)

/* gpio34_uart2_rts */
#define GPIO34_UART2_RTS \
	BFLB_PINMUX(34, uart2, rts, periph)

/* gpio34_uart2_cts */
#define GPIO34_UART2_CTS \
	BFLB_PINMUX(34, uart2, cts, periph)

/* gpio34_uart2_tx */
#define GPIO34_UART2_TX \
	BFLB_PINMUX(34, uart2, tx, periph)

/* gpio34_uart2_rx */
#define GPIO34_UART2_RX \
	BFLB_PINMUX(34, uart2, rx, periph)

/* gpio34_emac_rxerr */
#define GPIO34_EMAC_RXERR \
	BFLB_PINMUX(34, emac, rxerr, periph)

/* gpio34_pwm0_ch2p */
#define GPIO34_PWM0_CH2P \
	BFLB_PINMUX(34, pwm0, ch2p, periph)

/* gpio34_pwm1_ch2p */
#define GPIO34_PWM1_CH2P \
	BFLB_PINMUX(34, pwm1, ch2p, periph)

/* gpio34_spi1_miso */
#define GPIO34_SPI1_MISO \
	BFLB_PINMUX(34, spi1, miso, periph)

