zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio34_i2c2_scl */
#define GPIO34_I2C2_SCL \
	BFLB_PINMUX(34, i2c2, scl, periph)

/* gpio34_i2c3_scl */
#define GPIO34_I2C3_SCL \
	BFLB_PINMUX(34, i2c3, scl, periph)

/* gpio34_mm_uart_rts */
#define GPIO34_MM_UART_RTS \
	BFLB_PINMUX(34, mm_uart, rts, periph)

/* gpio34_dbi_c_scl */
#define GPIO34_DBI_C_SCL \
	BFLB_PINMUX(34, dbi_c, scl, periph)

/* gpio34_jtag_lp_tms */
#define GPIO34_JTAG_LP_TMS \
	BFLB_PINMUX(34, jtag_lp, tms, periph)

/* gpio34_jtag_m0_tms */
#define GPIO34_JTAG_M0_TMS \
	BFLB_PINMUX(34, jtag_m0, tms, periph)

/* gpio34_jtag_d0_tms */
#define GPIO34_JTAG_D0_TMS \
	BFLB_PINMUX(34, jtag_d0, tms, periph)

/* gpio34_clock_out2_cam_ref */
#define GPIO34_CLOCK_OUT2_CAM_REF \
	BFLB_PINMUX(34, clock_out2, cam_ref, periph)

/* gpio34_clock_out2_i2s_ref */
#define GPIO34_CLOCK_OUT2_I2S_REF \
	BFLB_PINMUX(34, clock_out2, i2s_ref, periph)

/* gpio34_clock_out2_xtal */
#define GPIO34_CLOCK_OUT2_XTAL \
	BFLB_PINMUX(34, clock_out2, xtal, periph)

/* gpio34_clock_out2_wifipll_32m */
#define GPIO34_CLOCK_OUT2_WIFIPLL_32M \
	BFLB_PINMUX(34, clock_out2, wifipll_32m, periph)

/* gpio34_adc_ch11 */
#define GPIO34_ADC_CH11 \
	BFLB_PINMUX(34, adc, ch11, analog)

/* gpio35_spi0_sclk */
#define GPIO35_SPI0_SCLK \
	BFLB_PINMUX(35, spi0, sclk, periph)

/* gpio35_flash2_cs */
#define GPIO35_FLASH2_CS \
	BFLB_PINMUX(35, flash2, cs, periph)

/* gpio35_i2s_do */
#define GPIO35_I2S_DO \
	BFLB_PINMUX(35, i2s, do, periph)

/* gpio35_pdm_clk */
#define GPIO35_PDM_CLK \
	BFLB_PINMUX(35, pdm, clk, periph)

/* gpio35_i2c0_sda */
#define GPIO35_I2C0_SDA \
	BFLB_PINMUX(35, i2c0, sda, periph)

/* gpio35_i2c1_sda */
#define GPIO35_I2C1_SDA \
	BFLB_PINMUX(35, i2c1, sda, periph)

/* gpio35_uart0_rts */
#define GPIO35_UART0_RTS \
	BFLB_PINMUX(35, uart0, rts, periph)

/* gpio35_uart0_cts */
#define GPIO35_UART0_CTS \
	BFLB_PINMUX(35, uart0, cts, periph)

/* gpio35_uart0_tx */
#define GPIO35_UART0_TX \
	BFLB_PINMUX(35, uart0, tx, periph)

/* gpio35_uart0_rx */
#define GPIO35_UART0_RX \
	BFLB_PINMUX(35, uart0, rx, periph)

/* gpio35_uart1_rts */
#define GPIO35_UART1_RTS \
	BFLB_PINMUX(35, uart1, rts, periph)

/* gpio35_uart1_cts */
#define GPIO35_UART1_CTS \
	BFLB_PINMUX(35, uart1, cts, periph)

/* gpio35_uart1_tx */
#define GPIO35_UART1_TX \
	BFLB_PINMUX(35, uart1, tx, periph)

/* gpio35_uart1_rx */
#define GPIO35_UART1_RX \
	BFLB_PINMUX(35, uart1, rx, periph)

/* gpio35_uart2_rts */
#define GPIO35_UART2_RTS \
	BFLB_PINMUX(35, uart2, rts, periph)

/* gpio35_uart2_cts */
#define GPIO35_UART2_CTS \
	BFLB_PINMUX(35, uart2, cts, periph)

/* gpio35_uart2_tx */
#define GPIO35_UART2_TX \
	BFLB_PINMUX(35, uart2, tx, periph)

/* gpio35_uart2_rx */
#define GPIO35_UART2_RX \
	BFLB_PINMUX(35, uart2, rx, periph)

/* gpio35_emac_tx_en */
#define GPIO35_EMAC_TX_EN \
	BFLB_PINMUX(35, emac, tx_en, periph)

/* gpio35_pwm0_ch3p */
#define GPIO35_PWM0_CH3P \
	BFLB_PINMUX(35, pwm0, ch3p, periph)

/* gpio35_pwm1_ch3p */
#define GPIO35_PWM1_CH3P \
	BFLB_PINMUX(35, pwm1, ch3p, periph)

/* gpio35_spi1_sclk */
#define GPIO35_SPI1_SCLK \
	BFLB_PINMUX(35, spi1, sclk, periph)

/* gpio35_i2c2_sda */
#define GPIO35_I2C2_SDA \
	BFLB_PINMUX(35, i2c2, sda, periph)

/* gpio35_i2c3_sda */
#define GPIO35_I2C3_SDA \
	BFLB_PINMUX(35, i2c3, sda, periph)

/* gpio35_mm_uart_cts */
#define GPIO35_MM_UART_CTS \
	BFLB_PINMUX(35, mm_uart, cts, periph)

/* gpio35_dbi_c_sda */
#define GPIO35_DBI_C_SDA \
	BFLB_PINMUX(35, dbi_c, sda, periph)

/* gpio35_jtag_lp_tdo */
#define GPIO35_JTAG_LP_TDO \
	BFLB_PINMUX(35, jtag_lp, tdo, periph)

/* gpio35_jtag_m0_tdo */
#define GPIO35_JTAG_M0_TDO \
	BFLB_PINMUX(35, jtag_m0, tdo, periph)

/* gpio35_jtag_d0_tdo */
#define GPIO35_JTAG_D0_TDO \
	BFLB_PINMUX(35, jtag_d0, tdo, periph)

/* gpio35_clock_out3_cam_ref */
#define GPIO35_CLOCK_OUT3_CAM_REF \
	BFLB_PINMUX(35, clock_out3, cam_ref, periph)

/* gpio35_clock_out3_i2s_ref */
#define GPIO35_CLOCK_OUT3_I2S_REF \
	BFLB_PINMUX(35, clock_out3, i2s_ref, periph)

/* gpio35_clock_out3_wifipll_48m */
#define GPIO35_CLOCK_OUT3_WIFIPLL_48M \
	BFLB_PINMUX(35, clock_out3, wifipll_48m, periph)

/* gpio36_spi0_ss */
#define GPIO36_SPI0_SS \
	BFLB_PINMUX(36, spi0, ss, periph)

/* gpio36_flash2_d0 */
#define GPIO36_FLASH2_D0 \
	BFLB_PINMUX(36, flash2, d0, periph)

/* gpio36_i2s_bclk */
#define GPIO36_I2S_BCLK \
	BFLB_PINMUX(36, i2s, bclk, periph)

/* gpio36_pdm_in */
#define GPIO36_PDM_IN \
	BFLB_PINMUX(36, pdm, in, periph)

/* gpio36_i2c0_scl */
#define GPIO36_I2C0_SCL \
	BFLB_PINMUX(36, i2c0, scl, periph)

/* gpio36_i2c1_scl */
#define GPIO36_I2C1_SCL \
	BFLB_PINMUX(36, i2c1, scl, periph)

/* gpio36_uart0_rts */
#define GPIO36_UART0_RTS \
	BFLB_PINMUX(36, uart0, rts, periph)

/* gpio36_uart0_cts */
#define GPIO36_UART0_CTS \
	BFLB_PINMUX(36, uart0, cts, periph)

/* gpio36_uart0_tx */
#define GPIO36_UART0_TX \
	BFLB_PINMUX(36, uart0, tx, periph)

/* gpio36_uart0_rx */
#define GPIO36_UART0_RX \
	BFLB_PINMUX(36, uart0, rx, periph)

/* gpio36_uart1_rts */
#define GPIO36_UART1_RTS \
	BFLB_PINMUX(36, uart1, rts, periph)

/* gpio36_uart1_cts */
#define GPIO36_UART1_CTS \
	BFLB_PINMUX(36, uart1, cts, periph)

/* gpio36_uart1_tx */
#define GPIO36_UART1_TX \
	BFLB_PINMUX(36, uart1, tx, periph)

/* gpio36_uart1_rx */
#define GPIO36_UART1_RX \
	BFLB_PINMUX(36, uart1, rx, periph)

/* gpio36_uart2_rts */
#define GPIO36_UART2_RTS \
	BFLB_PINMUX(36, uart2, rts, periph)

/* gpio36_uart2_cts */
#define GPIO36_UART2_CTS \
	BFLB_PINMUX(36, uart2, cts, periph)

/* gpio36_uart2_tx */
#define GPIO36_UART2_TX \
	BFLB_PINMUX(36, uart2, tx, periph)

/* gpio36_uart2_rx */
#define GPIO36_UART2_RX \
	BFLB_PINMUX(36, uart2, rx, periph)

/* gpio36_emac_rx_dv */
#define GPIO36_EMAC_RX_DV \
	BFLB_PINMUX(36, emac, rx_dv, periph)

/* gpio36_pwm0_ch0p */
#define GPIO36_PWM0_CH0P \
	BFLB_PINMUX(36, pwm0, ch0p, periph)

/* gpio36_pwm1_ch0p */
#define GPIO36_PWM1_CH0P \
	BFLB_PINMUX(36, pwm1, ch0p, periph)

/* gpio36_spi1_ss */
#define GPIO36_SPI1_SS \
	BFLB_PINMUX(36, spi1, ss, periph)

/* gpio36_i2c2_scl */
#define GPIO36_I2C2_SCL \
	BFLB_PINMUX(36, i2c2, scl, periph)

/* gpio36_i2c3_scl */
#define GPIO36_I2C3_SCL \
	BFLB_PINMUX(36, i2c3, scl, periph)

/* gpio36_mm_uart_tx */
#define GPIO36_MM_UART_TX \
	BFLB_PINMUX(36, mm_uart, tx, periph)

/* gpio36_dbi_c_cs */
#define GPIO36_DBI_C_CS \
	BFLB_PINMUX(36, dbi_c, cs, periph)

/* gpio36_jtag_lp_tck */
#define GPIO36_JTAG_LP_TCK \
	BFLB_PINMUX(36, jtag_lp, tck, periph)

