zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio36_jtag_m0_tck */
#define GPIO36_JTAG_M0_TCK \
	BFLB_PINMUX(36, jtag_m0, tck, periph)

/* gpio36_jtag_d0_tck */
#define GPIO36_JTAG_D0_TCK \
	BFLB_PINMUX(36, jtag_d0, tck, periph)

/* gpio36_clock_out0_cam_ref */
#define GPIO36_CLOCK_OUT0_CAM_REF \
	BFLB_PINMUX(36, clock_out0, cam_ref, periph)

/* gpio36_clock_out0_i2s_ref */
#define GPIO36_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(36, clock_out0, i2s_ref, periph)

/* gpio36_clock_out0_clk_audio_adc */
#define GPIO36_CLOCK_OUT0_CLK_AUDIO_ADC \
	BFLB_PINMUX(36, clock_out0, clk_audio_adc, periph)

/* gpio36_clock_out0_clk_audio_dac */
#define GPIO36_CLOCK_OUT0_CLK_AUDIO_DAC \
	BFLB_PINMUX(36, clock_out0, clk_audio_dac, periph)

/* gpio37_spi0_mosi */
#define GPIO37_SPI0_MOSI \
	BFLB_PINMUX(37, spi0, mosi, periph)

/* gpio37_flash2_d1 */
#define GPIO37_FLASH2_D1 \
	BFLB_PINMUX(37, flash2, d1, periph)

/* gpio37_i2s_fs */
#define GPIO37_I2S_FS \
	BFLB_PINMUX(37, i2s, fs, periph)

/* gpio37_pdm_in */
#define GPIO37_PDM_IN \
	BFLB_PINMUX(37, pdm, in, periph)

/* gpio37_i2c0_sda */
#define GPIO37_I2C0_SDA \
	BFLB_PINMUX(37, i2c0, sda, periph)

/* gpio37_i2c1_sda */
#define GPIO37_I2C1_SDA \
	BFLB_PINMUX(37, i2c1, sda, periph)

/* gpio37_uart0_rts */
#define GPIO37_UART0_RTS \
	BFLB_PINMUX(37, uart0, rts, periph)

/* gpio37_uart0_cts */
#define GPIO37_UART0_CTS \
	BFLB_PINMUX(37, uart0, cts, periph)

/* gpio37_uart0_tx */
#define GPIO37_UART0_TX \
	BFLB_PINMUX(37, uart0, tx, periph)

/* gpio37_uart0_rx */
#define GPIO37_UART0_RX \
	BFLB_PINMUX(37, uart0, rx, periph)

/* gpio37_uart1_rts */
#define GPIO37_UART1_RTS \
	BFLB_PINMUX(37, uart1, rts, periph)

/* gpio37_uart1_cts */
#define GPIO37_UART1_CTS \
	BFLB_PINMUX(37, uart1, cts, periph)

/* gpio37_uart1_tx */
#define GPIO37_UART1_TX \
	BFLB_PINMUX(37, uart1, tx, periph)

/* gpio37_uart1_rx */
#define GPIO37_UART1_RX \
	BFLB_PINMUX(37, uart1, rx, periph)

/* gpio37_uart2_rts */
#define GPIO37_UART2_RTS \
	BFLB_PINMUX(37, uart2, rts, periph)

/* gpio37_uart2_cts */
#define GPIO37_UART2_CTS \
	BFLB_PINMUX(37, uart2, cts, periph)

/* gpio37_uart2_tx */
#define GPIO37_UART2_TX \
	BFLB_PINMUX(37, uart2, tx, periph)

/* gpio37_uart2_rx */
#define GPIO37_UART2_RX \
	BFLB_PINMUX(37, uart2, rx, periph)

/* gpio37_emac_mdc */
#define GPIO37_EMAC_MDC \
	BFLB_PINMUX(37, emac, mdc, periph)

/* gpio37_pwm0_ch1p */
#define GPIO37_PWM0_CH1P \
	BFLB_PINMUX(37, pwm0, ch1p, periph)

/* gpio37_pwm1_ch1p */
#define GPIO37_PWM1_CH1P \
	BFLB_PINMUX(37, pwm1, ch1p, periph)

/* gpio37_spi1_mosi */
#define GPIO37_SPI1_MOSI \
	BFLB_PINMUX(37, spi1, mosi, periph)

/* gpio37_i2c2_sda */
#define GPIO37_I2C2_SDA \
	BFLB_PINMUX(37, i2c2, sda, periph)

/* gpio37_i2c3_sda */
#define GPIO37_I2C3_SDA \
	BFLB_PINMUX(37, i2c3, sda, periph)

/* gpio37_mm_uart_rx */
#define GPIO37_MM_UART_RX \
	BFLB_PINMUX(37, mm_uart, rx, periph)

/* gpio37_dbi_c_dcn */
#define GPIO37_DBI_C_DCN \
	BFLB_PINMUX(37, dbi_c, dcn, periph)

/* gpio37_jtag_lp_tdi */
#define GPIO37_JTAG_LP_TDI \
	BFLB_PINMUX(37, jtag_lp, tdi, periph)

/* gpio37_jtag_m0_tdi */
#define GPIO37_JTAG_M0_TDI \
	BFLB_PINMUX(37, jtag_m0, tdi, periph)

/* gpio37_jtag_d0_tdi */
#define GPIO37_JTAG_D0_TDI \
	BFLB_PINMUX(37, jtag_d0, tdi, periph)

/* gpio37_clock_out1_cam_ref */
#define GPIO37_CLOCK_OUT1_CAM_REF \
	BFLB_PINMUX(37, clock_out1, cam_ref, periph)

/* gpio37_clock_out1_i2s_ref */
#define GPIO37_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(37, clock_out1, i2s_ref, periph)

/* gpio37_clock_out1_clk_audio_adc */
#define GPIO37_CLOCK_OUT1_CLK_AUDIO_ADC \
	BFLB_PINMUX(37, clock_out1, clk_audio_adc, periph)

/* gpio37_clock_out1_clk_audio_dac */
#define GPIO37_CLOCK_OUT1_CLK_AUDIO_DAC \
	BFLB_PINMUX(37, clock_out1, clk_audio_dac, periph)

/* gpio38_spi0_miso */
#define GPIO38_SPI0_MISO \
	BFLB_PINMUX(38, spi0, miso, periph)

/* gpio38_flash2_d2 */
#define GPIO38_FLASH2_D2 \
	BFLB_PINMUX(38, flash2, d2, periph)

/* gpio38_i2s_di */
#define GPIO38_I2S_DI \
	BFLB_PINMUX(38, i2s, di, periph)

/* gpio38_pdm_clk */
#define GPIO38_PDM_CLK \
	BFLB_PINMUX(38, pdm, clk, periph)

/* gpio38_i2c0_scl */
#define GPIO38_I2C0_SCL \
	BFLB_PINMUX(38, i2c0, scl, periph)

/* gpio38_i2c1_scl */
#define GPIO38_I2C1_SCL \
	BFLB_PINMUX(38, i2c1, scl, periph)

/* gpio38_uart0_rts */
#define GPIO38_UART0_RTS \
	BFLB_PINMUX(38, uart0, rts, periph)

/* gpio38_uart0_cts */
#define GPIO38_UART0_CTS \
	BFLB_PINMUX(38, uart0, cts, periph)

/* gpio38_uart0_tx */
#define GPIO38_UART0_TX \
	BFLB_PINMUX(38, uart0, tx, periph)

/* gpio38_uart0_rx */
#define GPIO38_UART0_RX \
	BFLB_PINMUX(38, uart0, rx, periph)

/* gpio38_uart1_rts */
#define GPIO38_UART1_RTS \
	BFLB_PINMUX(38, uart1, rts, periph)

/* gpio38_uart1_cts */
#define GPIO38_UART1_CTS \
	BFLB_PINMUX(38, uart1, cts, periph)

/* gpio38_uart1_tx */
#define GPIO38_UART1_TX \
	BFLB_PINMUX(38, uart1, tx, periph)

/* gpio38_uart1_rx */
#define GPIO38_UART1_RX \
	BFLB_PINMUX(38, uart1, rx, periph)

/* gpio38_uart2_rts */
#define GPIO38_UART2_RTS \
	BFLB_PINMUX(38, uart2, rts, periph)

/* gpio38_uart2_cts */
#define GPIO38_UART2_CTS \
	BFLB_PINMUX(38, uart2, cts, periph)

/* gpio38_uart2_tx */
#define GPIO38_UART2_TX \
	BFLB_PINMUX(38, uart2, tx, periph)

/* gpio38_uart2_rx */
#define GPIO38_UART2_RX \
	BFLB_PINMUX(38, uart2, rx, periph)

/* gpio38_emac_mdio */
#define GPIO38_EMAC_MDIO \
	BFLB_PINMUX(38, emac, mdio, periph)

/* gpio38_pwm0_ch2p */
#define GPIO38_PWM0_CH2P \
	BFLB_PINMUX(38, pwm0, ch2p, periph)

/* gpio38_pwm1_ch2p */
#define GPIO38_PWM1_CH2P \
	BFLB_PINMUX(38, pwm1, ch2p, periph)

/* gpio38_spi1_miso */
#define GPIO38_SPI1_MISO \
	BFLB_PINMUX(38, spi1, miso, periph)

/* gpio38_i2c2_scl */
#define GPIO38_I2C2_SCL \
	BFLB_PINMUX(38, i2c2, scl, periph)

/* gpio38_i2c3_scl */
#define GPIO38_I2C3_SCL \
	BFLB_PINMUX(38, i2c3, scl, periph)

/* gpio38_mm_uart_rts */
#define GPIO38_MM_UART_RTS \
	BFLB_PINMUX(38, mm_uart, rts, periph)

/* gpio38_dbi_c_scl */
#define GPIO38_DBI_C_SCL \
	BFLB_PINMUX(38, dbi_c, scl, periph)

/* gpio38_jtag_lp_tms */
#define GPIO38_JTAG_LP_TMS \
	BFLB_PINMUX(38, jtag_lp, tms, periph)

/* gpio38_jtag_m0_tms */
#define GPIO38_JTAG_M0_TMS \
	BFLB_PINMUX(38, jtag_m0, tms, periph)

/* gpio38_jtag_d0_tms */
#define GPIO38_JTAG_D0_TMS \
	BFLB_PINMUX(38, jtag_d0, tms, periph)

/* gpio38_clock_out2_cam_ref */
#define GPIO38_CLOCK_OUT2_CAM_REF \
	BFLB_PINMUX(38, clock_out2, cam_ref, periph)

