zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio38_clock_out2_i2s_ref */
#define GPIO38_CLOCK_OUT2_I2S_REF \
	BFLB_PINMUX(38, clock_out2, i2s_ref, periph)

/* gpio38_clock_out2_xtal */
#define GPIO38_CLOCK_OUT2_XTAL \
	BFLB_PINMUX(38, clock_out2, xtal, periph)

/* gpio38_clock_out2_wifipll_32m */
#define GPIO38_CLOCK_OUT2_WIFIPLL_32M \
	BFLB_PINMUX(38, clock_out2, wifipll_32m, periph)

/* gpio39_spi0_sclk */
#define GPIO39_SPI0_SCLK \
	BFLB_PINMUX(39, spi0, sclk, periph)

/* gpio39_flash2_d3 */
#define GPIO39_FLASH2_D3 \
	BFLB_PINMUX(39, flash2, d3, periph)

/* gpio39_i2s_do */
#define GPIO39_I2S_DO \
	BFLB_PINMUX(39, i2s, do, periph)

/* gpio39_pdm_in */
#define GPIO39_PDM_IN \
	BFLB_PINMUX(39, pdm, in, periph)

/* gpio39_i2c0_sda */
#define GPIO39_I2C0_SDA \
	BFLB_PINMUX(39, i2c0, sda, periph)

/* gpio39_i2c1_sda */
#define GPIO39_I2C1_SDA \
	BFLB_PINMUX(39, i2c1, sda, periph)

/* gpio39_uart0_rts */
#define GPIO39_UART0_RTS \
	BFLB_PINMUX(39, uart0, rts, periph)

/* gpio39_uart0_cts */
#define GPIO39_UART0_CTS \
	BFLB_PINMUX(39, uart0, cts, periph)

/* gpio39_uart0_tx */
#define GPIO39_UART0_TX \
	BFLB_PINMUX(39, uart0, tx, periph)

/* gpio39_uart0_rx */
#define GPIO39_UART0_RX \
	BFLB_PINMUX(39, uart0, rx, periph)

/* gpio39_uart1_rts */
#define GPIO39_UART1_RTS \
	BFLB_PINMUX(39, uart1, rts, periph)

/* gpio39_uart1_cts */
#define GPIO39_UART1_CTS \
	BFLB_PINMUX(39, uart1, cts, periph)

/* gpio39_uart1_tx */
#define GPIO39_UART1_TX \
	BFLB_PINMUX(39, uart1, tx, periph)

/* gpio39_uart1_rx */
#define GPIO39_UART1_RX \
	BFLB_PINMUX(39, uart1, rx, periph)

/* gpio39_uart2_rts */
#define GPIO39_UART2_RTS \
	BFLB_PINMUX(39, uart2, rts, periph)

/* gpio39_uart2_cts */
#define GPIO39_UART2_CTS \
	BFLB_PINMUX(39, uart2, cts, periph)

/* gpio39_uart2_tx */
#define GPIO39_UART2_TX \
	BFLB_PINMUX(39, uart2, tx, periph)

/* gpio39_uart2_rx */
#define GPIO39_UART2_RX \
	BFLB_PINMUX(39, uart2, rx, periph)

/* gpio39_pwm0_ch3p */
#define GPIO39_PWM0_CH3P \
	BFLB_PINMUX(39, pwm0, ch3p, periph)

/* gpio39_pwm1_ch3p */
#define GPIO39_PWM1_CH3P \
	BFLB_PINMUX(39, pwm1, ch3p, periph)

/* gpio39_spi1_sclk */
#define GPIO39_SPI1_SCLK \
	BFLB_PINMUX(39, spi1, sclk, periph)

/* gpio39_i2c2_sda */
#define GPIO39_I2C2_SDA \
	BFLB_PINMUX(39, i2c2, sda, periph)

/* gpio39_i2c3_sda */
#define GPIO39_I2C3_SDA \
	BFLB_PINMUX(39, i2c3, sda, periph)

/* gpio39_mm_uart_cts */
#define GPIO39_MM_UART_CTS \
	BFLB_PINMUX(39, mm_uart, cts, periph)

/* gpio39_dbi_c_sda */
#define GPIO39_DBI_C_SDA \
	BFLB_PINMUX(39, dbi_c, sda, periph)

/* gpio39_jtag_lp_tdo */
#define GPIO39_JTAG_LP_TDO \
	BFLB_PINMUX(39, jtag_lp, tdo, periph)

/* gpio39_jtag_m0_tdo */
#define GPIO39_JTAG_M0_TDO \
	BFLB_PINMUX(39, jtag_m0, tdo, periph)

/* gpio39_jtag_d0_tdo */
#define GPIO39_JTAG_D0_TDO \
	BFLB_PINMUX(39, jtag_d0, tdo, periph)

/* gpio39_clock_out3_cam_ref */
#define GPIO39_CLOCK_OUT3_CAM_REF \
	BFLB_PINMUX(39, clock_out3, cam_ref, periph)

/* gpio39_clock_out3_i2s_ref */
#define GPIO39_CLOCK_OUT3_I2S_REF \
	BFLB_PINMUX(39, clock_out3, i2s_ref, periph)

/* gpio39_clock_out3_wifipll_48m */
#define GPIO39_CLOCK_OUT3_WIFIPLL_48M \
	BFLB_PINMUX(39, clock_out3, wifipll_48m, periph)

/* gpio40_spi0_ss */
#define GPIO40_SPI0_SS \
	BFLB_PINMUX(40, spi0, ss, periph)

/* gpio40_i2s_bclk */
#define GPIO40_I2S_BCLK \
	BFLB_PINMUX(40, i2s, bclk, periph)

/* gpio40_i2c0_scl */
#define GPIO40_I2C0_SCL \
	BFLB_PINMUX(40, i2c0, scl, periph)

/* gpio40_i2c1_scl */
#define GPIO40_I2C1_SCL \
	BFLB_PINMUX(40, i2c1, scl, periph)

/* gpio40_uart0_rts */
#define GPIO40_UART0_RTS \
	BFLB_PINMUX(40, uart0, rts, periph)

/* gpio40_uart0_cts */
#define GPIO40_UART0_CTS \
	BFLB_PINMUX(40, uart0, cts, periph)

/* gpio40_uart0_tx */
#define GPIO40_UART0_TX \
	BFLB_PINMUX(40, uart0, tx, periph)

/* gpio40_uart0_rx */
#define GPIO40_UART0_RX \
	BFLB_PINMUX(40, uart0, rx, periph)

/* gpio40_uart1_rts */
#define GPIO40_UART1_RTS \
	BFLB_PINMUX(40, uart1, rts, periph)

/* gpio40_uart1_cts */
#define GPIO40_UART1_CTS \
	BFLB_PINMUX(40, uart1, cts, periph)

/* gpio40_uart1_tx */
#define GPIO40_UART1_TX \
	BFLB_PINMUX(40, uart1, tx, periph)

/* gpio40_uart1_rx */
#define GPIO40_UART1_RX \
	BFLB_PINMUX(40, uart1, rx, periph)

/* gpio40_uart2_rts */
#define GPIO40_UART2_RTS \
	BFLB_PINMUX(40, uart2, rts, periph)

/* gpio40_uart2_cts */
#define GPIO40_UART2_CTS \
	BFLB_PINMUX(40, uart2, cts, periph)

/* gpio40_uart2_tx */
#define GPIO40_UART2_TX \
	BFLB_PINMUX(40, uart2, tx, periph)

/* gpio40_uart2_rx */
#define GPIO40_UART2_RX \
	BFLB_PINMUX(40, uart2, rx, periph)

/* gpio40_pwm0_ch0p */
#define GPIO40_PWM0_CH0P \
	BFLB_PINMUX(40, pwm0, ch0p, periph)

/* gpio40_pwm1_ch0p */
#define GPIO40_PWM1_CH0P \
	BFLB_PINMUX(40, pwm1, ch0p, periph)

/* gpio40_spi1_ss */
#define GPIO40_SPI1_SS \
	BFLB_PINMUX(40, spi1, ss, periph)

/* gpio40_i2c2_scl */
#define GPIO40_I2C2_SCL \
	BFLB_PINMUX(40, i2c2, scl, periph)

/* gpio40_i2c3_scl */
#define GPIO40_I2C3_SCL \
	BFLB_PINMUX(40, i2c3, scl, periph)

/* gpio40_mm_uart_tx */
#define GPIO40_MM_UART_TX \
	BFLB_PINMUX(40, mm_uart, tx, periph)

/* gpio40_dbi_b_rd */
#define GPIO40_DBI_B_RD \
	BFLB_PINMUX(40, dbi_b, rd, periph)

/* gpio40_dbi_c_cs */
#define GPIO40_DBI_C_CS \
	BFLB_PINMUX(40, dbi_c, cs, periph)

/* gpio40_jtag_lp_tck */
#define GPIO40_JTAG_LP_TCK \
	BFLB_PINMUX(40, jtag_lp, tck, periph)

/* gpio40_jtag_m0_tck */
#define GPIO40_JTAG_M0_TCK \
	BFLB_PINMUX(40, jtag_m0, tck, periph)

/* gpio40_jtag_d0_tck */
#define GPIO40_JTAG_D0_TCK \
	BFLB_PINMUX(40, jtag_d0, tck, periph)

/* gpio40_clock_out0_cam_ref */
#define GPIO40_CLOCK_OUT0_CAM_REF \
	BFLB_PINMUX(40, clock_out0, cam_ref, periph)

/* gpio40_clock_out0_i2s_ref */
#define GPIO40_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(40, clock_out0, i2s_ref, periph)

/* gpio40_clock_out0_clk_audio_adc */
#define GPIO40_CLOCK_OUT0_CLK_AUDIO_ADC \
	BFLB_PINMUX(40, clock_out0, clk_audio_adc, periph)

/* gpio40_clock_out0_clk_audio_dac */
#define GPIO40_CLOCK_OUT0_CLK_AUDIO_DAC \
	BFLB_PINMUX(40, clock_out0, clk_audio_dac, periph)

/* gpio40_adc_ch5 */
#define GPIO40_ADC_CH5 \
	BFLB_PINMUX(40, adc, ch5, analog)

/* gpio41_spi0_mosi */
#define GPIO41_SPI0_MOSI \
	BFLB_PINMUX(41, spi0, mosi, periph)

/* gpio41_i2s_fs */
#define GPIO41_I2S_FS \
	BFLB_PINMUX(41, i2s, fs, periph)

/* gpio41_i2c0_sda */
#define GPIO41_I2C0_SDA \
	BFLB_PINMUX(41, i2c0, sda, periph)

/* gpio41_i2c1_sda */
#define GPIO41_I2C1_SDA \
	BFLB_PINMUX(41, i2c1, sda, periph)

/* gpio41_uart0_rts */
#define GPIO41_UART0_RTS \
	BFLB_PINMUX(41, uart0, rts, periph)

/* gpio41_uart0_cts */
#define GPIO41_UART0_CTS \
	BFLB_PINMUX(41, uart0, cts, periph)

/* gpio41_uart0_tx */
#define GPIO41_UART0_TX \
	BFLB_PINMUX(41, uart0, tx, periph)

/* gpio41_uart0_rx */
#define GPIO41_UART0_RX \
	BFLB_PINMUX(41, uart0, rx, periph)

/* gpio41_uart1_rts */
#define GPIO41_UART1_RTS \
	BFLB_PINMUX(41, uart1, rts, periph)

/* gpio41_uart1_cts */
#define GPIO41_UART1_CTS \
	BFLB_PINMUX(41, uart1, cts, periph)

/* gpio41_uart1_tx */
#define GPIO41_UART1_TX \
	BFLB_PINMUX(41, uart1, tx, periph)

/* gpio41_uart1_rx */
#define GPIO41_UART1_RX \
	BFLB_PINMUX(41, uart1, rx, periph)

/* gpio41_uart2_rts */
#define GPIO41_UART2_RTS \
	BFLB_PINMUX(41, uart2, rts, periph)

