zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio41_uart2_cts */
#define GPIO41_UART2_CTS \
	BFLB_PINMUX(41, uart2, cts, periph)

/* gpio41_uart2_tx */
#define GPIO41_UART2_TX \
	BFLB_PINMUX(41, uart2, tx, periph)

/* gpio41_uart2_rx */
#define GPIO41_UART2_RX \
	BFLB_PINMUX(41, uart2, rx, periph)

/* gpio41_pwm0_ch1p */
#define GPIO41_PWM0_CH1P \
	BFLB_PINMUX(41, pwm0, ch1p, periph)

/* gpio41_pwm1_ch1p */
#define GPIO41_PWM1_CH1P \
	BFLB_PINMUX(41, pwm1, ch1p, periph)

/* gpio41_spi1_mosi */
#define GPIO41_SPI1_MOSI \
	BFLB_PINMUX(41, spi1, mosi, periph)

/* gpio41_i2c2_sda */
#define GPIO41_I2C2_SDA \
	BFLB_PINMUX(41, i2c2, sda, periph)

/* gpio41_i2c3_sda */
#define GPIO41_I2C3_SDA \
	BFLB_PINMUX(41, i2c3, sda, periph)

/* gpio41_mm_uart_rx */
#define GPIO41_MM_UART_RX \
	BFLB_PINMUX(41, mm_uart, rx, periph)

/* gpio41_dbi_c_dcn */
#define GPIO41_DBI_C_DCN \
	BFLB_PINMUX(41, dbi_c, dcn, periph)

/* gpio41_jtag_lp_tdi */
#define GPIO41_JTAG_LP_TDI \
	BFLB_PINMUX(41, jtag_lp, tdi, periph)

/* gpio41_jtag_m0_tdi */
#define GPIO41_JTAG_M0_TDI \
	BFLB_PINMUX(41, jtag_m0, tdi, periph)

/* gpio41_jtag_d0_tdi */
#define GPIO41_JTAG_D0_TDI \
	BFLB_PINMUX(41, jtag_d0, tdi, periph)

/* gpio41_clock_out1_cam_ref */
#define GPIO41_CLOCK_OUT1_CAM_REF \
	BFLB_PINMUX(41, clock_out1, cam_ref, periph)

/* gpio41_clock_out1_i2s_ref */
#define GPIO41_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(41, clock_out1, i2s_ref, periph)

/* gpio41_clock_out1_clk_audio_adc */
#define GPIO41_CLOCK_OUT1_CLK_AUDIO_ADC \
	BFLB_PINMUX(41, clock_out1, clk_audio_adc, periph)

/* gpio41_clock_out1_clk_audio_dac */
#define GPIO41_CLOCK_OUT1_CLK_AUDIO_DAC \
	BFLB_PINMUX(41, clock_out1, clk_audio_dac, periph)

/* gpio42_spi0_miso */
#define GPIO42_SPI0_MISO \
	BFLB_PINMUX(42, spi0, miso, periph)

/* gpio42_i2s_di */
#define GPIO42_I2S_DI \
	BFLB_PINMUX(42, i2s, di, periph)

/* gpio42_i2c0_scl */
#define GPIO42_I2C0_SCL \
	BFLB_PINMUX(42, i2c0, scl, periph)

/* gpio42_i2c1_scl */
#define GPIO42_I2C1_SCL \
	BFLB_PINMUX(42, i2c1, scl, periph)

/* gpio42_uart0_rts */
#define GPIO42_UART0_RTS \
	BFLB_PINMUX(42, uart0, rts, periph)

/* gpio42_uart0_cts */
#define GPIO42_UART0_CTS \
	BFLB_PINMUX(42, uart0, cts, periph)

/* gpio42_uart0_tx */
#define GPIO42_UART0_TX \
	BFLB_PINMUX(42, uart0, tx, periph)

/* gpio42_uart0_rx */
#define GPIO42_UART0_RX \
	BFLB_PINMUX(42, uart0, rx, periph)

/* gpio42_uart1_rts */
#define GPIO42_UART1_RTS \
	BFLB_PINMUX(42, uart1, rts, periph)

/* gpio42_uart1_cts */
#define GPIO42_UART1_CTS \
	BFLB_PINMUX(42, uart1, cts, periph)

/* gpio42_uart1_tx */
#define GPIO42_UART1_TX \
	BFLB_PINMUX(42, uart1, tx, periph)

/* gpio42_uart1_rx */
#define GPIO42_UART1_RX \
	BFLB_PINMUX(42, uart1, rx, periph)

/* gpio42_uart2_rts */
#define GPIO42_UART2_RTS \
	BFLB_PINMUX(42, uart2, rts, periph)

/* gpio42_uart2_cts */
#define GPIO42_UART2_CTS \
	BFLB_PINMUX(42, uart2, cts, periph)

/* gpio42_uart2_tx */
#define GPIO42_UART2_TX \
	BFLB_PINMUX(42, uart2, tx, periph)

/* gpio42_uart2_rx */
#define GPIO42_UART2_RX \
	BFLB_PINMUX(42, uart2, rx, periph)

/* gpio42_pwm0_ch2p */
#define GPIO42_PWM0_CH2P \
	BFLB_PINMUX(42, pwm0, ch2p, periph)

/* gpio42_pwm1_ch2p */
#define GPIO42_PWM1_CH2P \
	BFLB_PINMUX(42, pwm1, ch2p, periph)

/* gpio42_spi1_miso */
#define GPIO42_SPI1_MISO \
	BFLB_PINMUX(42, spi1, miso, periph)

/* gpio42_i2c2_scl */
#define GPIO42_I2C2_SCL \
	BFLB_PINMUX(42, i2c2, scl, periph)

/* gpio42_i2c3_scl */
#define GPIO42_I2C3_SCL \
	BFLB_PINMUX(42, i2c3, scl, periph)

/* gpio42_mm_uart_rts */
#define GPIO42_MM_UART_RTS \
	BFLB_PINMUX(42, mm_uart, rts, periph)

/* gpio42_dbi_c_scl */
#define GPIO42_DBI_C_SCL \
	BFLB_PINMUX(42, dbi_c, scl, periph)

/* gpio42_jtag_lp_tms */
#define GPIO42_JTAG_LP_TMS \
	BFLB_PINMUX(42, jtag_lp, tms, periph)

/* gpio42_jtag_m0_tms */
#define GPIO42_JTAG_M0_TMS \
	BFLB_PINMUX(42, jtag_m0, tms, periph)

/* gpio42_jtag_d0_tms */
#define GPIO42_JTAG_D0_TMS \
	BFLB_PINMUX(42, jtag_d0, tms, periph)

/* gpio42_clock_out2_cam_ref */
#define GPIO42_CLOCK_OUT2_CAM_REF \
	BFLB_PINMUX(42, clock_out2, cam_ref, periph)

/* gpio42_clock_out2_i2s_ref */
#define GPIO42_CLOCK_OUT2_I2S_REF \
	BFLB_PINMUX(42, clock_out2, i2s_ref, periph)

/* gpio42_clock_out2_xtal */
#define GPIO42_CLOCK_OUT2_XTAL \
	BFLB_PINMUX(42, clock_out2, xtal, periph)

/* gpio42_clock_out2_wifipll_32m */
#define GPIO42_CLOCK_OUT2_WIFIPLL_32M \
	BFLB_PINMUX(42, clock_out2, wifipll_32m, periph)

/* gpio43_spi0_sclk */
#define GPIO43_SPI0_SCLK \
	BFLB_PINMUX(43, spi0, sclk, periph)

/* gpio43_i2s_do */
#define GPIO43_I2S_DO \
	BFLB_PINMUX(43, i2s, do, periph)

/* gpio43_i2c0_sda */
#define GPIO43_I2C0_SDA \
	BFLB_PINMUX(43, i2c0, sda, periph)

/* gpio43_i2c1_sda */
#define GPIO43_I2C1_SDA \
	BFLB_PINMUX(43, i2c1, sda, periph)

/* gpio43_uart0_rts */
#define GPIO43_UART0_RTS \
	BFLB_PINMUX(43, uart0, rts, periph)

/* gpio43_uart0_cts */
#define GPIO43_UART0_CTS \
	BFLB_PINMUX(43, uart0, cts, periph)

/* gpio43_uart0_tx */
#define GPIO43_UART0_TX \
	BFLB_PINMUX(43, uart0, tx, periph)

/* gpio43_uart0_rx */
#define GPIO43_UART0_RX \
	BFLB_PINMUX(43, uart0, rx, periph)

/* gpio43_uart1_rts */
#define GPIO43_UART1_RTS \
	BFLB_PINMUX(43, uart1, rts, periph)

/* gpio43_uart1_cts */
#define GPIO43_UART1_CTS \
	BFLB_PINMUX(43, uart1, cts, periph)

/* gpio43_uart1_tx */
#define GPIO43_UART1_TX \
	BFLB_PINMUX(43, uart1, tx, periph)

/* gpio43_uart1_rx */
#define GPIO43_UART1_RX \
	BFLB_PINMUX(43, uart1, rx, periph)

/* gpio43_uart2_rts */
#define GPIO43_UART2_RTS \
	BFLB_PINMUX(43, uart2, rts, periph)

/* gpio43_uart2_cts */
#define GPIO43_UART2_CTS \
	BFLB_PINMUX(43, uart2, cts, periph)

/* gpio43_uart2_tx */
#define GPIO43_UART2_TX \
	BFLB_PINMUX(43, uart2, tx, periph)

/* gpio43_uart2_rx */
#define GPIO43_UART2_RX \
	BFLB_PINMUX(43, uart2, rx, periph)

/* gpio43_pwm0_ch3p */
#define GPIO43_PWM0_CH3P \
	BFLB_PINMUX(43, pwm0, ch3p, periph)

/* gpio43_pwm1_ch3p */
#define GPIO43_PWM1_CH3P \
	BFLB_PINMUX(43, pwm1, ch3p, periph)

/* gpio43_spi1_sclk */
#define GPIO43_SPI1_SCLK \
	BFLB_PINMUX(43, spi1, sclk, periph)

/* gpio43_i2c2_sda */
#define GPIO43_I2C2_SDA \
	BFLB_PINMUX(43, i2c2, sda, periph)

/* gpio43_i2c3_sda */
#define GPIO43_I2C3_SDA \
	BFLB_PINMUX(43, i2c3, sda, periph)

/* gpio43_mm_uart_cts */
#define GPIO43_MM_UART_CTS \
	BFLB_PINMUX(43, mm_uart, cts, periph)

/* gpio43_dbi_c_sda */
#define GPIO43_DBI_C_SDA \
	BFLB_PINMUX(43, dbi_c, sda, periph)

