zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl808x-pinctrl.h
/* gpio43_jtag_lp_tdo */
#define GPIO43_JTAG_LP_TDO \
	BFLB_PINMUX(43, jtag_lp, tdo, periph)

/* gpio43_jtag_m0_tdo */
#define GPIO43_JTAG_M0_TDO \
	BFLB_PINMUX(43, jtag_m0, tdo, periph)

/* gpio43_jtag_d0_tdo */
#define GPIO43_JTAG_D0_TDO \
	BFLB_PINMUX(43, jtag_d0, tdo, periph)

/* gpio43_clock_out3_cam_ref */
#define GPIO43_CLOCK_OUT3_CAM_REF \
	BFLB_PINMUX(43, clock_out3, cam_ref, periph)

/* gpio43_clock_out3_i2s_ref */
#define GPIO43_CLOCK_OUT3_I2S_REF \
	BFLB_PINMUX(43, clock_out3, i2s_ref, periph)

/* gpio43_clock_out3_wifipll_48m */
#define GPIO43_CLOCK_OUT3_WIFIPLL_48M \
	BFLB_PINMUX(43, clock_out3, wifipll_48m, periph)

/* gpio44_spi0_ss */
#define GPIO44_SPI0_SS \
	BFLB_PINMUX(44, spi0, ss, periph)

/* gpio44_i2s_bclk */
#define GPIO44_I2S_BCLK \
	BFLB_PINMUX(44, i2s, bclk, periph)

/* gpio44_i2c0_scl */
#define GPIO44_I2C0_SCL \
	BFLB_PINMUX(44, i2c0, scl, periph)

/* gpio44_i2c1_scl */
#define GPIO44_I2C1_SCL \
	BFLB_PINMUX(44, i2c1, scl, periph)

/* gpio44_uart0_rts */
#define GPIO44_UART0_RTS \
	BFLB_PINMUX(44, uart0, rts, periph)

/* gpio44_uart0_cts */
#define GPIO44_UART0_CTS \
	BFLB_PINMUX(44, uart0, cts, periph)

/* gpio44_uart0_tx */
#define GPIO44_UART0_TX \
	BFLB_PINMUX(44, uart0, tx, periph)

/* gpio44_uart0_rx */
#define GPIO44_UART0_RX \
	BFLB_PINMUX(44, uart0, rx, periph)

/* gpio44_uart1_rts */
#define GPIO44_UART1_RTS \
	BFLB_PINMUX(44, uart1, rts, periph)

/* gpio44_uart1_cts */
#define GPIO44_UART1_CTS \
	BFLB_PINMUX(44, uart1, cts, periph)

/* gpio44_uart1_tx */
#define GPIO44_UART1_TX \
	BFLB_PINMUX(44, uart1, tx, periph)

/* gpio44_uart1_rx */
#define GPIO44_UART1_RX \
	BFLB_PINMUX(44, uart1, rx, periph)

/* gpio44_uart2_rts */
#define GPIO44_UART2_RTS \
	BFLB_PINMUX(44, uart2, rts, periph)

/* gpio44_uart2_cts */
#define GPIO44_UART2_CTS \
	BFLB_PINMUX(44, uart2, cts, periph)

/* gpio44_uart2_tx */
#define GPIO44_UART2_TX \
	BFLB_PINMUX(44, uart2, tx, periph)

/* gpio44_uart2_rx */
#define GPIO44_UART2_RX \
	BFLB_PINMUX(44, uart2, rx, periph)

/* gpio44_pwm0_ch0p */
#define GPIO44_PWM0_CH0P \
	BFLB_PINMUX(44, pwm0, ch0p, periph)

/* gpio44_pwm1_ch0p */
#define GPIO44_PWM1_CH0P \
	BFLB_PINMUX(44, pwm1, ch0p, periph)

/* gpio44_spi1_ss */
#define GPIO44_SPI1_SS \
	BFLB_PINMUX(44, spi1, ss, periph)

/* gpio44_i2c2_scl */
#define GPIO44_I2C2_SCL \
	BFLB_PINMUX(44, i2c2, scl, periph)

/* gpio44_i2c3_scl */
#define GPIO44_I2C3_SCL \
	BFLB_PINMUX(44, i2c3, scl, periph)

/* gpio44_mm_uart_tx */
#define GPIO44_MM_UART_TX \
	BFLB_PINMUX(44, mm_uart, tx, periph)

/* gpio44_dbi_c_cs */
#define GPIO44_DBI_C_CS \
	BFLB_PINMUX(44, dbi_c, cs, periph)

/* gpio44_jtag_lp_tck */
#define GPIO44_JTAG_LP_TCK \
	BFLB_PINMUX(44, jtag_lp, tck, periph)

/* gpio44_jtag_m0_tck */
#define GPIO44_JTAG_M0_TCK \
	BFLB_PINMUX(44, jtag_m0, tck, periph)

/* gpio44_jtag_d0_tck */
#define GPIO44_JTAG_D0_TCK \
	BFLB_PINMUX(44, jtag_d0, tck, periph)

/* gpio44_clock_out0_cam_ref */
#define GPIO44_CLOCK_OUT0_CAM_REF \
	BFLB_PINMUX(44, clock_out0, cam_ref, periph)

/* gpio44_clock_out0_i2s_ref */
#define GPIO44_CLOCK_OUT0_I2S_REF \
	BFLB_PINMUX(44, clock_out0, i2s_ref, periph)

/* gpio44_clock_out0_clk_audio_adc */
#define GPIO44_CLOCK_OUT0_CLK_AUDIO_ADC \
	BFLB_PINMUX(44, clock_out0, clk_audio_adc, periph)

/* gpio44_clock_out0_clk_audio_dac */
#define GPIO44_CLOCK_OUT0_CLK_AUDIO_DAC \
	BFLB_PINMUX(44, clock_out0, clk_audio_dac, periph)

/* gpio45_spi0_mosi */
#define GPIO45_SPI0_MOSI \
	BFLB_PINMUX(45, spi0, mosi, periph)

/* gpio45_i2s_fs */
#define GPIO45_I2S_FS \
	BFLB_PINMUX(45, i2s, fs, periph)

/* gpio45_i2c0_sda */
#define GPIO45_I2C0_SDA \
	BFLB_PINMUX(45, i2c0, sda, periph)

/* gpio45_i2c1_sda */
#define GPIO45_I2C1_SDA \
	BFLB_PINMUX(45, i2c1, sda, periph)

/* gpio45_uart0_rts */
#define GPIO45_UART0_RTS \
	BFLB_PINMUX(45, uart0, rts, periph)

/* gpio45_uart0_cts */
#define GPIO45_UART0_CTS \
	BFLB_PINMUX(45, uart0, cts, periph)

/* gpio45_uart0_tx */
#define GPIO45_UART0_TX \
	BFLB_PINMUX(45, uart0, tx, periph)

/* gpio45_uart0_rx */
#define GPIO45_UART0_RX \
	BFLB_PINMUX(45, uart0, rx, periph)

/* gpio45_uart1_rts */
#define GPIO45_UART1_RTS \
	BFLB_PINMUX(45, uart1, rts, periph)

/* gpio45_uart1_cts */
#define GPIO45_UART1_CTS \
	BFLB_PINMUX(45, uart1, cts, periph)

/* gpio45_uart1_tx */
#define GPIO45_UART1_TX \
	BFLB_PINMUX(45, uart1, tx, periph)

/* gpio45_uart1_rx */
#define GPIO45_UART1_RX \
	BFLB_PINMUX(45, uart1, rx, periph)

/* gpio45_uart2_rts */
#define GPIO45_UART2_RTS \
	BFLB_PINMUX(45, uart2, rts, periph)

/* gpio45_uart2_cts */
#define GPIO45_UART2_CTS \
	BFLB_PINMUX(45, uart2, cts, periph)

/* gpio45_uart2_tx */
#define GPIO45_UART2_TX \
	BFLB_PINMUX(45, uart2, tx, periph)

/* gpio45_uart2_rx */
#define GPIO45_UART2_RX \
	BFLB_PINMUX(45, uart2, rx, periph)

/* gpio45_pwm0_ch1p */
#define GPIO45_PWM0_CH1P \
	BFLB_PINMUX(45, pwm0, ch1p, periph)

/* gpio45_pwm1_ch1p */
#define GPIO45_PWM1_CH1P \
	BFLB_PINMUX(45, pwm1, ch1p, periph)

/* gpio45_spi1_mosi */
#define GPIO45_SPI1_MOSI \
	BFLB_PINMUX(45, spi1, mosi, periph)

/* gpio45_i2c2_sda */
#define GPIO45_I2C2_SDA \
	BFLB_PINMUX(45, i2c2, sda, periph)

/* gpio45_i2c3_sda */
#define GPIO45_I2C3_SDA \
	BFLB_PINMUX(45, i2c3, sda, periph)

/* gpio45_mm_uart_rx */
#define GPIO45_MM_UART_RX \
	BFLB_PINMUX(45, mm_uart, rx, periph)

/* gpio45_dbi_c_dcn */
#define GPIO45_DBI_C_DCN \
	BFLB_PINMUX(45, dbi_c, dcn, periph)

/* gpio45_jtag_lp_tdi */
#define GPIO45_JTAG_LP_TDI \
	BFLB_PINMUX(45, jtag_lp, tdi, periph)

/* gpio45_jtag_m0_tdi */
#define GPIO45_JTAG_M0_TDI \
	BFLB_PINMUX(45, jtag_m0, tdi, periph)

/* gpio45_jtag_d0_tdi */
#define GPIO45_JTAG_D0_TDI \
	BFLB_PINMUX(45, jtag_d0, tdi, periph)

/* gpio45_clock_out1_cam_ref */
#define GPIO45_CLOCK_OUT1_CAM_REF \
	BFLB_PINMUX(45, clock_out1, cam_ref, periph)

/* gpio45_clock_out1_i2s_ref */
#define GPIO45_CLOCK_OUT1_I2S_REF \
	BFLB_PINMUX(45, clock_out1, i2s_ref, periph)

/* gpio45_clock_out1_clk_audio_adc */
#define GPIO45_CLOCK_OUT1_CLK_AUDIO_ADC \
	BFLB_PINMUX(45, clock_out1, clk_audio_adc, periph)

/* gpio45_clock_out1_clk_audio_dac */
#define GPIO45_CLOCK_OUT1_CLK_AUDIO_DAC \
	BFLB_PINMUX(45, clock_out1, clk_audio_dac, periph)

#endif /* DT_BINDINGS_PINCTRL_BFLB_BL808X_PINCTRL_H_ */
